dianyundou/DA14592BLE_CSL/CSL-59x_10.679.2.17/sdk/bsp/include/DA1459x-00.h
/*
 * Copyright (C) 2020-2023 Renesas Electronics Corporation and/or its affiliates.
 * All rights reserved. Confidential Information.
 *
 * This software ("Software") is supplied by Renesas Electronics Corporation and/or its
 * affiliates ("Renesas"). Renesas grants you a personal, non-exclusive, non-transferable,
 * revocable, non-sub-licensable right and license to use the Software, solely if used in
 * or together with Renesas products. You may make copies of this Software, provided this
 * copyright notice and disclaimer ("Notice") is included in all such copies. Renesas
 * reserves the right to change or discontinue the Software at any time without notice.
 *
 * THE SOFTWARE IS PROVIDED "AS IS". RENESAS DISCLAIMS ALL WARRANTIES OF ANY KIND,
 * WHETHER EXPRESS, IMPLIED, OR STATUTORY, INCLUDING BUT NOT LIMITED TO THE WARRANTIES
 * OF MERCHANTABILITY, FITNESS FOR A PARTICULAR PURPOSE AND NON-INFRINGEMENT. TO THE
 * MAXIMUM EXTENT PERMITTED UNDER LAW, IN NO EVENT SHALL RENESAS BE LIABLE FOR ANY DIRECT,
 * INDIRECT, SPECIAL, INCIDENTAL OR CONSEQUENTIAL DAMAGES ARISING FROM, OUT OF OR IN
 * CONNECTION WITH THE SOFTWARE, EVEN IF RENESAS HAS BEEN ADVISED OF THE POSSIBILITY OF
 * SUCH DAMAGES. USE OF THIS SOFTWARE MAY BE SUBJECT TO TERMS AND CONDITIONS CONTAINED IN
 * AN ADDITIONAL AGREEMENT BETWEEN YOU AND RENESAS. IN CASE OF CONFLICT BETWEEN THE TERMS
 * OF THIS NOTICE AND ANY SUCH ADDITIONAL LICENSE AGREEMENT, THE TERMS OF THE AGREEMENT
 * SHALL TAKE PRECEDENCE. BY CONTINUING TO USE THIS SOFTWARE, YOU AGREE TO THE TERMS OF
 * THIS NOTICE.IF YOU DO NOT AGREE TO THESE TERMS, YOU ARE NOT PERMITTED TO USE THIS
 * SOFTWARE.
 *
 * @file     DA1459x-00.h
 * @brief    CMSIS HeaderFile
 * @version  1.2
 * @date     10. October 2023
 * @note     Generated by SVDConv V3.3.42 on Tuesday, 10.10.2023 12:59:21
 *           from File 'config/embsys/Dialog_Semiconductor/DA1459x-00.xml',
 *           last modified on Tuesday, 10.10.2023 13:02:31.
 */



/** @addtogroup PLA_BSP_REGISTERS
  * @{
  */


/** @addtogroup DA1459x
  * @{
  */


#ifndef DA1459X_H
#define DA1459X_H

#ifdef __cplusplus
extern "C" {
#endif


/** @addtogroup Configuration_of_CMSIS
  * @{
  */



/* =========================================================================================================================== */
/* ================                                Interrupt Number Definition                                ================ */
/* =========================================================================================================================== */

/**
  * @brief Interrupt Number Definition
  */
typedef enum {
/* =======================================  ARM Cortex-M33 Specific Interrupt Numbers  ======================================= */
  Reset_IRQn                = -15,              /*!< -15  Reset Vector, invoked on Power up and warm reset                     */
  NonMaskableInt_IRQn       = -14,              /*!< -14  Non maskable Interrupt, cannot be stopped or preempted               */
  HardFault_IRQn            = -13,              /*!< -13  Hard Fault, all classes of Fault                                     */
  MemoryManagement_IRQn     = -12,              /*!< -12  Memory Management, MPU mismatch, including Access Violation
                                                     and No Match                                                              */
  BusFault_IRQn             = -11,              /*!< -11  Bus Fault, Pre-Fetch-, Memory Access Fault, other address/memory
                                                     related Fault                                                             */
  UsageFault_IRQn           = -10,              /*!< -10  Usage Fault, i.e. Undef Instruction, Illegal State Transition        */
  SecureFault_IRQn          =  -9,              /*!< -9 Secure Fault Handler                                                   */
  SVCall_IRQn               =  -5,              /*!< -5 System Service Call via SVC instruction                                */
  DebugMonitor_IRQn         =  -4,              /*!< -4 Debug Monitor                                                          */
  PendSV_IRQn               =  -2,              /*!< -2 Pendable request for system service                                    */
  SysTick_IRQn              =  -1,              /*!< -1 System Tick Timer                                                      */
/* ==========================================  DA1459x Specific Interrupt Numbers  =========================================== */
  RESERVED0_IRQn            =   0,              /*!< 0  Reserved interrupt request.                                            */
  DMA_IRQn                  =   1,              /*!< 1  General Purpose DMA interrupt request.                                 */
  CMAC2SYS_IRQn             =   2,              /*!< 2  CMAC and mailbox interrupt request.                                    */
  UART_IRQn                 =   3,              /*!< 3  UART interrupt request.                                                */
  UART2_IRQn                =   4,              /*!< 4  UART2 interrupt request.                                               */
  I2C_IRQn                  =   5,              /*!< 5  I2C interrupt request.                                                 */
  SPI_IRQn                  =   6,              /*!< 6  SPI interrupt request.                                                 */
  FCU_IRQn                  =   7,              /*!< 7  FCU/eFlash interrupt request.                                          */
  PCM_IRQn                  =   8,              /*!< 8  PCM interrupt request.                                                 */
  SRC_IN_IRQn               =   9,              /*!< 9  SRC input interrupt request.                                           */
  SRC_OUT_IRQn              =  10,              /*!< 10 SRC output interrupt request.                                          */
  SRC2_IN_IRQn              =  11,              /*!< 11 SRC2 input interrupt request.                                          */
  SRC2_OUT_IRQn             =  12,              /*!< 12 SRC2 output interrupt request.                                         */
  MDCT_IRQn                 =  13,              /*!< 13 Modified Discrete Cosine Transform interrupt request.                  */
  TIMER_IRQn                =  14,              /*!< 14 TIMER interrupt request.                                               */
  TIMER2_IRQn               =  15,              /*!< 15 TIMER2 interrupt request.                                              */
  RTC_IRQn                  =  16,              /*!< 16 RTC interrupt request.                                                 */
  KEY_WKUP_GPIO_IRQn        =  17,              /*!< 17 Debounced button press interrupt request.                              */
  PDC_M33_IRQn              =  18,              /*!< 18 Wakeup from PDC to CM33 interrupt request.                             */
  MRM_IRQn                  =  19,              /*!< 19 Cache Miss Rate Monitor interrupt request.                             */
  RESERVED20_IRQn           =  20,              /*!< 20 Reserved (software) interrupt request.                                 */
  QUADDEC_IRQn              =  21,              /*!< 21 Quadrature Decoder interrupt request.                                  */
  RESERVED22_IRQn           =  22,              /*!< 22 Reserved (software) interrupt request.                                 */
  XTAL32M_RDY_IRQn          =  23,              /*!< 23 XTAL32M trimmed and ready interrupt request.                           */
  CLK_CALIBRATION_IRQn      =  24,              /*!< 24 Clock calibration successfully interrupt request.                      */
  GPADC_IRQn                =  25,              /*!< 25 General Purpose / SAR Analog-Digital Converter interrupt
                                                     request.                                                                  */
  SDADC_IRQn                =  26,              /*!< 26 Sigma Delta Analog-Digital Converter interrupt request.                */
  CRYPTO_IRQn               =  27,              /*!< 27 Crypto interrupt request. Sources: AES or HASH function interrupt.     */
  CAPTIMER_IRQn             =  28,              /*!< 28 GPIO triggered Capture Timer interrupt request.                        */
  RFDIAG_IRQn               =  29,              /*!< 29 Baseband or Radio Diagnostics interrupt request.                       */
  TIMER3_IRQn               =  30,              /*!< 30 TIMER3 interrupt request.                                              */
  TIMER4_IRQn               =  31,              /*!< 31 TIMER4 interrupt request.                                              */
  RTC_EVENT_IRQn            =  32,              /*!< 32 RTC event interrupt request.                                           */
  GPIO_P0_IRQn              =  33,              /*!< 33 GPIO port 0 toggle interrupt request.                                  */
  GPIO_P1_IRQn              =  34               /*!< 34 GPIO port 1 toggle interrupt request.                                  */
} IRQn_Type;



/* =========================================================================================================================== */
/* ================                           Processor and Core Peripheral Section                           ================ */
/* =========================================================================================================================== */

