dianyundou/DA14592BLE_CSL/CSL-59x_10.679.2.17/sdk/bsp/include/DA1459x-00.h
/* ==========================  Configuration of the ARM Cortex-M33 Processor and Core Peripherals  =========================== */
#define __CM33_REV                 0x0002U      /*!< CM33 Core Revision                                                        */
#define __NVIC_PRIO_BITS               4        /*!< Number of Bits used for Priority Levels                                   */
#define __Vendor_SysTickConfig         0        /*!< Set to 1 if different SysTick Config is used                              */
#define __VTOR_PRESENT                 1        /*!< Set to 1 if CPU supports Vector Table Offset Register                     */
#define __MPU_PRESENT                  1        /*!< MPU present                                                               */
#define __FPU_PRESENT                  1        /*!< FPU present                                                               */
#define __FPU_DP                       0        /*!< Double Precision FPU                                                      */
#define __DSP_PRESENT                  1        /*!< DSP extension present                                                     */
#define __SAUREGION_PRESENT            0        /*!< SAU region present                                                        */


/** @} */ /* End of group Configuration_of_CMSIS */

#include "core_cm33.h"                          /*!< ARM Cortex-M33 processor and core peripherals                             */
#include "system_DA1459x.h"                     /*!< DA1459x System                                                            */

#ifndef __IM                                    /*!< Fallback for older CMSIS versions                                         */
  #define __IM   __I
#endif
#ifndef __OM                                    /*!< Fallback for older CMSIS versions                                         */
  #define __OM   __O
#endif
#ifndef __IOM                                   /*!< Fallback for older CMSIS versions                                         */
  #define __IOM  __IO
#endif


/* =========================================================================================================================== */
/* ================                            Device Specific Peripheral Section                             ================ */
/* =========================================================================================================================== */


/** @addtogroup Device_Peripheral_peripherals
  * @{
  */



/* =========================================================================================================================== */
/* ================                                         AES_HASH                                          ================ */
/* =========================================================================================================================== */


/**
  * @brief AES_HASH registers (AES_HASH)
  */

typedef struct {                                /*!< (@ 0x30040000) AES_HASH Structure                                         */
  __IOM uint32_t  CRYPTO_CTRL_REG;              /*!< (@ 0x00000000) Crypto Control register                                    */
  __IOM uint32_t  CRYPTO_START_REG;             /*!< (@ 0x00000004) Crypto Start calculation                                   */
  __IOM uint32_t  CRYPTO_FETCH_ADDR_REG;        /*!< (@ 0x00000008) Crypto DMA fetch register                                  */
  __IOM uint32_t  CRYPTO_LEN_REG;               /*!< (@ 0x0000000C) Crypto Length of the input block in bytes                  */
  __IOM uint32_t  CRYPTO_DEST_ADDR_REG;         /*!< (@ 0x00000010) Crypto DMA destination memory                              */
  __IOM uint32_t  CRYPTO_STATUS_REG;            /*!< (@ 0x00000014) Crypto Status register                                     */
  __IOM uint32_t  CRYPTO_CLRIRQ_REG;            /*!< (@ 0x00000018) Crypto Clear interrupt request                             */
  __IOM uint32_t  CRYPTO_MREG0_REG;             /*!< (@ 0x0000001C) Crypto Mode depended register 0                            */
  __IOM uint32_t  CRYPTO_MREG1_REG;             /*!< (@ 0x00000020) Crypto Mode depended register 1                            */
  __IOM uint32_t  CRYPTO_MREG2_REG;             /*!< (@ 0x00000024) Crypto Mode depended register 2                            */
  __IOM uint32_t  CRYPTO_MREG3_REG;             /*!< (@ 0x00000028) Crypto Mode depended register 3                            */
  __IM  uint32_t  RESERVED[53];
  __IOM uint32_t  CRYPTO_KEYS_START;            /*!< (@ 0x00000100) Crypto First position of the AES keys storage
                                                                    memory                                                     */
} AES_HASH_Type;                                /*!< Size = 260 (0x104)                                                        */



/* =========================================================================================================================== */
/* ================                                        ANAMISC_BIF                                        ================ */
/* =========================================================================================================================== */


/**
  * @brief ANAMISC_BIF registers (ANAMISC_BIF)
  */

typedef struct {                                /*!< (@ 0x50040B00) ANAMISC_BIF Structure                                      */
  __IM  uint32_t  RESERVED[4];
  __IOM uint32_t  CLK_REF_SEL_REG;              /*!< (@ 0x00000010) Select clock for oscillator calibration                    */
  __IOM uint32_t  CLK_REF_CNT_REG;              /*!< (@ 0x00000014) Count value for oscillator calibration                     */
  __IOM uint32_t  CLK_REF_VAL_REG;              /*!< (@ 0x00000018) DIVN reference cycles, lower 16 bits                       */
  __IOM uint32_t  CLK_CAL_IRQ_REG;              /*!< (@ 0x0000001C) Select clock for oscillator calibration                    */
} ANAMISC_BIF_Type;                             /*!< Size = 32 (0x20)                                                          */



/* =========================================================================================================================== */
/* ================                                           CACHE                                           ================ */
/* =========================================================================================================================== */


/**
  * @brief CACHE registers (CACHE)
  */

typedef struct {                                /*!< (@ 0x1A0C0000) CACHE Structure                                            */
  __IM  uint32_t  RESERVED[8];
  __IOM uint32_t  CACHE_CTRL2_REG;              /*!< (@ 0x00000020) Cache control register 2 (only Word (32-bits)
                                                                    access supported).                                         */
  __IM  uint32_t  RESERVED1;
  __IOM uint32_t  CACHE_MRM_HITS_REG;           /*!< (@ 0x00000028) Cache MRM (Miss Rate Monitor) HITS register (only
                                                                    Word (32-bits) access supported).                          */
  __IOM uint32_t  CACHE_MRM_MISSES_REG;         /*!< (@ 0x0000002C) Cache MRM (Miss Rate Monitor) MISSES register
                                                                    (only Word (32-bits) access supported).                    */
  __IOM uint32_t  CACHE_MRM_CTRL_REG;           /*!< (@ 0x00000030) Cache MRM (Miss Rate Monitor) CONTROL register
                                                                    (only Word (32-bits) access supported).                    */
  __IOM uint32_t  CACHE_MRM_TINT_REG;           /*!< (@ 0x00000034) Cache MRM (Miss Rate Monitor) TIME INTERVAL register
                                                                    (only Word (32-bits) access supported).                    */
  __IOM uint32_t  CACHE_MRM_MISSES_THRES_REG;   /*!< (@ 0x00000038) Cache MRM (Miss Rate Monitor) THRESHOLD register
                                                                    (only Word (32-bits) access supported).                    */
  __IOM uint32_t  CACHE_MRM_HITS_THRES_REG;     /*!< (@ 0x0000003C) Cache MRM (Miss Rate Monitor) HITS THRESHOLD
                                                                    register (only Word (32-bits) access supported).           */
  __IOM uint32_t  CACHE_FLASH_REG;              /*!< (@ 0x00000040) Cache QSPI Flash program size and base address
                                                                    register (only Word (32-bits) access supported).
                                                                    This register is NA for the CMAC Cache (no
                                                                    remapping done in the CMAC Cache).                         */
  __IOM uint32_t  CACHE_EFLASH_REG;             /*!< (@ 0x00000044) Cache eFlash program size and base address register
                                                                    (only Word (32-bits) access supported).
                                                                    This register is NA for the CMAC Cache (no
                                                                    remapping done in the CMAC Cache).                         */
  __IOM uint32_t  CACHE_MRM_HITS1WS_REG;        /*!< (@ 0x00000048) Cache MRM (Miss Rate Monitor) HITS with 1 Wait
                                                                    State register (only Word (32-bits) access
                                                                    supported).                                                */
  __IM  uint32_t  RESERVED2;
  __IOM uint32_t  SWD_RESET_REG;                /*!< (@ 0x00000050) SWD HW reset control register (only Word (32-bits)
                                                                    access supported).                                         */
} CACHE_Type;                                   /*!< Size = 84 (0x54)                                                          */



/* =========================================================================================================================== */
/* ================                                       CHIP_VERSION                                        ================ */
/* =========================================================================================================================== */


/**
  * @brief CHIP_VERSION registers (CHIP_VERSION)
  */

typedef struct {                                /*!< (@ 0x50050200) CHIP_VERSION Structure                                     */
  __IOM uint32_t  CHIP_ID1_REG;                 /*!< (@ 0x00000000) Chip identification register 1.                            */
  __IOM uint32_t  CHIP_ID2_REG;                 /*!< (@ 0x00000004) Chip identification register 2.                            */
  __IOM uint32_t  CHIP_ID3_REG;                 /*!< (@ 0x00000008) Chip identification register 3.                            */
  __IOM uint32_t  CHIP_ID4_REG;                 /*!< (@ 0x0000000C) Chip identification register 4.                            */
  __IOM uint32_t  CHIP_SWC_REG;                 /*!< (@ 0x00000010) Software compatibility register.                           */
  __IOM uint32_t  CHIP_REVISION_REG;            /*!< (@ 0x00000014) Chip revision register.                                    */
  __IM  uint32_t  RESERVED[56];
  __IOM uint32_t  CHIP_TEST1_REG;               /*!< (@ 0x000000F8) Chip test register 1.                                      */
  __IOM uint32_t  CHIP_TEST2_REG;               /*!< (@ 0x000000FC) Chip test register 2.                                      */
} CHIP_VERSION_Type;                            /*!< Size = 256 (0x100)                                                        */



/* =========================================================================================================================== */
/* ================                                        CMAC_CACHE                                         ================ */
/* =========================================================================================================================== */


/**
  * @brief CMAC_CACHE registers (CMAC_CACHE)
  */

typedef struct {                                /*!< (@ 0x1A1C0000) CMAC_CACHE Structure                                       */
  __IM  uint32_t  RESERVED[8];
  __IOM uint32_t  CM_CACHE_CTRL2_REG;           /*!< (@ 0x00000020) Cache control register 2 (only Word (32-bits)
                                                                    access supported).                                         */
  __IM  uint32_t  RESERVED1;
  __IOM uint32_t  CM_CACHE_MRM_HITS_REG;        /*!< (@ 0x00000028) Cache MRM (Miss Rate Monitor) HITS register (only
                                                                    Word (32-bits) access supported).                          */
  __IOM uint32_t  CM_CACHE_MRM_MISSES_REG;      /*!< (@ 0x0000002C) Cache MRM (Miss Rate Monitor) MISSES register
                                                                    (only Word (32-bits) access supported).                    */
  __IOM uint32_t  CM_CACHE_MRM_CTRL_REG;        /*!< (@ 0x00000030) Cache MRM (Miss Rate Monitor) CONTROL register
                                                                    (only Word (32-bits) access supported).                    */
  __IOM uint32_t  CM_CACHE_MRM_TINT_REG;        /*!< (@ 0x00000034) Cache MRM (Miss Rate Monitor) TIME INTERVAL register
                                                                    (only Word (32-bits) access supported).                    */
  __IOM uint32_t  CM_CACHE_MRM_MISSES_THRES_REG;/*!< (@ 0x00000038) Cache MRM (Miss Rate Monitor) THRESHOLD register
                                                                    (only Word (32-bits) access supported).                    */
  __IOM uint32_t  CM_CACHE_MRM_HITS_THRES_REG;  /*!< (@ 0x0000003C) Cache MRM (Miss Rate Monitor) HITS THRESHOLD
                                                                    register (only Word (32-bits) access supported).           */
  __IOM uint32_t  CM_CACHE_FLASH_REG;           /*!< (@ 0x00000040) Cache QSPI Flash program size and base address
                                                                    register (only Word (32-bits) access supported).
                                                                    This register is NA for the CMAC Cache (no
                                                                    remapping done in the CMAC Cache).                         */
  __IOM uint32_t  CM_CACHE_EFLASH_REG;          /*!< (@ 0x00000044) Cache eFlash program size and base address register
                                                                    (only Word (32-bits) access supported).
                                                                    This register is NA for the CMAC Cache (no
                                                                    remapping done in the CMAC Cache).                         */
  __IOM uint32_t  CM_CACHE_MRM_HITS1WS_REG;     /*!< (@ 0x00000048) Cache MRM (Miss Rate Monitor) HITS with 1 Wait
                                                                    State register (only Word (32-bits) access
                                                                    supported).                                                */
  __IM  uint32_t  RESERVED2;
  __IOM uint32_t  CM_CACHE_RESET_REG;           /*!< (@ 0x00000050) SWD HW reset control register (only Word (32-bits)
                                                                    access supported).                                         */
} CMAC_CACHE_Type;                              /*!< Size = 84 (0x54)                                                          */



/* =========================================================================================================================== */
/* ================                                          CRG_AUD                                          ================ */
/* =========================================================================================================================== */


/**
  * @brief CRG_AUD registers (CRG_AUD)
  */

typedef struct {                                /*!< (@ 0x50030000) CRG_AUD Structure                                          */
  __IM  uint32_t  RESERVED[16];
  __IOM uint32_t  PCM_DIV_REG;                  /*!< (@ 0x00000040) PCM divider and enables                                    */
  __IOM uint32_t  PCM_FDIV_REG;                 /*!< (@ 0x00000044) PCM fractional division register                           */
  __IOM uint32_t  PDM_DIV_REG;                  /*!< (@ 0x00000048) PDM divider and enables                                    */
  __IOM uint32_t  SRC_DIV_REG;                  /*!< (@ 0x0000004C) SRC divider and enables                                    */
} CRG_AUD_Type;                                 /*!< Size = 80 (0x50)                                                          */



/* =========================================================================================================================== */
/* ================                                          CRG_COM                                          ================ */
/* =========================================================================================================================== */


/**
  * @brief CRG_COM registers (CRG_COM)
  */

typedef struct {                                /*!< (@ 0x50020500) CRG_COM Structure                                          */
  __IM  uint32_t  RESERVED;
  __IOM uint32_t  CLK_COM_REG;                  /*!< (@ 0x00000004) Peripheral divider register                                */
  __IOM uint32_t  SET_CLK_COM_REG;              /*!< (@ 0x00000008) Peripheral divider register SET register. Reads
                                                                    back 0x0000                                                */
  __IOM uint32_t  RESET_CLK_COM_REG;            /*!< (@ 0x0000000C) Peripheral divider register RESET register. Reads
                                                                    back 0x0000                                                */
} CRG_COM_Type;                                 /*!< Size = 16 (0x10)                                                          */



/* =========================================================================================================================== */
/* ================                                          CRG_PER                                          ================ */
/* =========================================================================================================================== */


/**
  * @brief CRG_PER registers (CRG_PER)
  */

typedef struct {                                /*!< (@ 0x50040C00) CRG_PER Structure                                          */
  __IM  uint32_t  RESERVED;
  __IOM uint32_t  CLK_PER_REG;                  /*!< (@ 0x00000004) Peripheral divider register                                */
  __IOM uint32_t  SET_CLK_PER_REG;              /*!< (@ 0x00000008) Peripheral divider register SET register, reads
                                                                    0x0000                                                     */
  __IOM uint32_t  RESET_CLK_PER_REG;            /*!< (@ 0x0000000C) Peripheral divider register RESET register, reads
                                                                    0x0000                                                     */
} CRG_PER_Type;                                 /*!< Size = 16 (0x10)                                                          */



/* =========================================================================================================================== */
/* ================                                          CRG_SYS                                          ================ */
/* =========================================================================================================================== */


/**
  * @brief CRG_SYS registers (CRG_SYS)
  */

