dianyundou/DA14592BLE_CSL/CSL-59x_10.679.2.17/sdk/bsp/include/DA1459x-00.h
typedef struct {                                /*!< (@ 0x50010000) CRG_XTAL Structure                                         */
  __IOM uint32_t  XTAL32M_START_REG;            /*!< (@ 0x00000000) Trim values for XTAL32M in START state of startup          */
  __IOM uint32_t  XTAL32M_SETTLE_REG;           /*!< (@ 0x00000004) Trim values for XTAL32M in SETTLE state of startup         */
  __IOM uint32_t  XTAL32M_TRIM_REG;             /*!< (@ 0x00000008) Trim values for XTAL32M in RUNNING state                   */
  __IOM uint32_t  XTAL32M_CAP_MEAS_REG;         /*!< (@ 0x0000000C) Capacitance measure circuit control                        */
  __IOM uint32_t  XTAL32M_FSM_REG;              /*!< (@ 0x00000010) Startup state machine configuration                        */
  __IOM uint32_t  XTAL32M_CTRL_REG;             /*!< (@ 0x00000014) Xtal32m control register                                   */
  __IOM uint32_t  XTAL32M_IRQ_CTRL_REG;         /*!< (@ 0x00000018) Xtal32m Interrupt control register                         */
  __IM  uint32_t  RESERVED[2];
  __IOM uint32_t  XTAL32M_STAT0_REG;            /*!< (@ 0x00000024) XTAL32M status register                                    */
  __IOM uint32_t  XTAL32M_IRQ_STAT_REG;         /*!< (@ 0x00000028) XTAL32M IRQ status register                                */
  __IM  uint32_t  RESERVED1[13];
  __IOM uint32_t  CLKDBLR_CTRL1_REG;            /*!< (@ 0x00000060) Clock Doubler Control Logic control register
                                                                    1                                                          */
  __IOM uint32_t  CLKDBLR_CTRL2_REG;            /*!< (@ 0x00000064) Clock Doubler Control Logic control register
                                                                    2                                                          */
  __IOM uint32_t  CLKDBLR_STATUS_REG;           /*!< (@ 0x00000068) Clock Doubler Control Logic status register                */
} CRG_XTAL_Type;                                /*!< Size = 108 (0x6c)                                                         */



/* =========================================================================================================================== */
/* ================                                           DCDC                                            ================ */
/* =========================================================================================================================== */


/**
  * @brief DCDC registers (DCDC)
  */

typedef struct {                                /*!< (@ 0x50000300) DCDC Structure                                             */
  __IOM uint32_t  DCDC_CTRL_REG;                /*!< (@ 0x00000000) DCDC_CTRL_REG                                              */
} DCDC_Type;                                    /*!< Size = 4 (0x4)                                                            */



/* =========================================================================================================================== */
/* ================                                            DMA                                            ================ */
/* =========================================================================================================================== */


/**
  * @brief DMA registers (DMA)
  */

typedef struct {                                /*!< (@ 0x50060200) DMA Structure                                              */
  __IOM uint32_t  DMA0_A_START_REG;             /*!< (@ 0x00000000) Source address register of DMA channel 0                   */
  __IOM uint32_t  DMA0_B_START_REG;             /*!< (@ 0x00000004) Destination address register of DMA channel 0              */
  __IOM uint32_t  DMA0_INT_REG;                 /*!< (@ 0x00000008) Interrupt length register of DMA channel 0                 */
  __IOM uint32_t  DMA0_LEN_REG;                 /*!< (@ 0x0000000C) Transfer length register of DMA channel 0                  */
  __IOM uint32_t  DMA0_CTRL_REG;                /*!< (@ 0x00000010) Control register of DMA channel 0                          */
  __IOM uint32_t  DMA0_IDX_REG;                 /*!< (@ 0x00000014) Index pointer register of DMA channel 0                    */
  __IM  uint32_t  RESERVED[2];
  __IOM uint32_t  DMA1_A_START_REG;             /*!< (@ 0x00000020) Source address register of DMA channel 1                   */
  __IOM uint32_t  DMA1_B_START_REG;             /*!< (@ 0x00000024) Destination address register of DMA channel 1              */
  __IOM uint32_t  DMA1_INT_REG;                 /*!< (@ 0x00000028) Interrupt length register of DMA channel 1                 */
  __IOM uint32_t  DMA1_LEN_REG;                 /*!< (@ 0x0000002C) Transfer length register of DMA channel 1                  */
  __IOM uint32_t  DMA1_CTRL_REG;                /*!< (@ 0x00000030) Control register of DMA channel 1                          */
  __IOM uint32_t  DMA1_IDX_REG;                 /*!< (@ 0x00000034) Index pointer register of DMA channel 1                    */
  __IM  uint32_t  RESERVED1[2];
  __IOM uint32_t  DMA2_A_START_REG;             /*!< (@ 0x00000040) Source address register of DMA channel 2                   */
  __IOM uint32_t  DMA2_B_START_REG;             /*!< (@ 0x00000044) Destination address register of DMA channel 2              */
  __IOM uint32_t  DMA2_INT_REG;                 /*!< (@ 0x00000048) Interrupt length register of DMA channel 2                 */
  __IOM uint32_t  DMA2_LEN_REG;                 /*!< (@ 0x0000004C) Transfer length register of DMA channel 2                  */
  __IOM uint32_t  DMA2_CTRL_REG;                /*!< (@ 0x00000050) Control register of DMA channel 2                          */
  __IOM uint32_t  DMA2_IDX_REG;                 /*!< (@ 0x00000054) Index pointer register of DMA channel 2                    */
  __IM  uint32_t  RESERVED2[2];
  __IOM uint32_t  DMA3_A_START_REG;             /*!< (@ 0x00000060) Source address register of DMA channel 3                   */
  __IOM uint32_t  DMA3_B_START_REG;             /*!< (@ 0x00000064) Destination address register of DMA channel 3              */
  __IOM uint32_t  DMA3_INT_REG;                 /*!< (@ 0x00000068) Interrupt length register of DMA channel 3                 */
  __IOM uint32_t  DMA3_LEN_REG;                 /*!< (@ 0x0000006C) Transfer length register of DMA channel 3                  */
  __IOM uint32_t  DMA3_CTRL_REG;                /*!< (@ 0x00000070) Control register of DMA channel 3                          */
  __IOM uint32_t  DMA3_IDX_REG;                 /*!< (@ 0x00000074) Index pointer register of DMA channel 3                    */
  __IM  uint32_t  RESERVED3[2];
  __IOM uint32_t  DMA4_A_START_REG;             /*!< (@ 0x00000080) Source address register of DMA channel 4                   */
  __IOM uint32_t  DMA4_B_START_REG;             /*!< (@ 0x00000084) Destination address register of DMA channel 4              */
  __IOM uint32_t  DMA4_INT_REG;                 /*!< (@ 0x00000088) Interrupt length register of DMA channel 4                 */
  __IOM uint32_t  DMA4_LEN_REG;                 /*!< (@ 0x0000008C) Transfer length register of DMA channel 4                  */
  __IOM uint32_t  DMA4_CTRL_REG;                /*!< (@ 0x00000090) Control register of DMA channel 4                          */
  __IOM uint32_t  DMA4_IDX_REG;                 /*!< (@ 0x00000094) Index pointer register of DMA channel 4                    */
  __IM  uint32_t  RESERVED4[2];
  __IOM uint32_t  DMA5_A_START_REG;             /*!< (@ 0x000000A0) Source address register of DMA channel 5                   */
  __IOM uint32_t  DMA5_B_START_REG;             /*!< (@ 0x000000A4) Destination address register of DMA channel 5              */
  __IOM uint32_t  DMA5_INT_REG;                 /*!< (@ 0x000000A8) Interrupt length register of DMA channel 5                 */
  __IOM uint32_t  DMA5_LEN_REG;                 /*!< (@ 0x000000AC) Transfer length register of DMA channel 5                  */
  __IOM uint32_t  DMA5_CTRL_REG;                /*!< (@ 0x000000B0) Control register of DMA channel 5                          */
  __IOM uint32_t  DMA5_IDX_REG;                 /*!< (@ 0x000000B4) Index pointer register of DMA channel 5                    */
  __IM  uint32_t  RESERVED5[18];
  __IOM uint32_t  DMA_REQ_MUX_REG;              /*!< (@ 0x00000100) DMA channels peripherals mapping register                  */
  __IOM uint32_t  DMA_INT_STATUS_REG;           /*!< (@ 0x00000104) DMA Interrupt status register                              */
  __IOM uint32_t  DMA_CLEAR_INT_REG;            /*!< (@ 0x00000108) DMA Interrupt clear register                               */
  __IOM uint32_t  DMA_INT_MASK_REG;             /*!< (@ 0x0000010C) DMA Interrupt mask register                                */
  __IOM uint32_t  DMA_SET_INT_MASK_REG;         /*!< (@ 0x00000110) DMA Set Interrupt mask register                            */
  __IOM uint32_t  DMA_RESET_INT_MASK_REG;       /*!< (@ 0x00000114) DMA Reset Interrupt mask register                          */
} DMA_Type;                                     /*!< Size = 280 (0x118)                                                        */



/* =========================================================================================================================== */
/* ================                                            DW                                             ================ */
/* =========================================================================================================================== */


/**
  * @brief DW registers (DW)
  */

