dianyundou/DA14592BLE_CSL/CSL-59x_10.679.2.17/sdk/bsp/include/DA1459x-00.h
typedef struct {                                /*!< (@ 0x50000500) QUADEC Structure                                           */
  __IOM uint32_t  QDEC_CTRL_REG;                /*!< (@ 0x00000000) Quad Decoder control register                              */
  __IOM uint32_t  QDEC_XCNT_REG;                /*!< (@ 0x00000004) Counter value of the X Axis                                */
  __IOM uint32_t  QDEC_YCNT_REG;                /*!< (@ 0x00000008) Counter value of the Y Axis                                */
  __IOM uint32_t  QDEC_CLOCKDIV_REG;            /*!< (@ 0x0000000C) Clock divider register                                     */
  __IOM uint32_t  QDEC_CTRL2_REG;               /*!< (@ 0x00000010) Quad Decoder port selection register                       */
  __IOM uint32_t  QDEC_ZCNT_REG;                /*!< (@ 0x00000014) Counter value of the Z Axis                                */
  __IOM uint32_t  QDEC_EVENT_CNT_REG;           /*!< (@ 0x00000018) Event counter register                                     */
} QUADEC_Type;                                  /*!< Size = 28 (0x1c)                                                          */



/* =========================================================================================================================== */
/* ================                                            RTC                                            ================ */
/* =========================================================================================================================== */


/**
  * @brief RTC registers (RTC)
  */

typedef struct {                                /*!< (@ 0x50000400) RTC Structure                                              */
  __IOM uint32_t  RTC_CONTROL_REG;              /*!< (@ 0x00000000) RTC Control Register                                       */
  __IOM uint32_t  RTC_HOUR_MODE_REG;            /*!< (@ 0x00000004) RTC Hour Mode Register                                     */
  __IOM uint32_t  RTC_TIME_REG;                 /*!< (@ 0x00000008) RTC Time Register                                          */
  __IOM uint32_t  RTC_CALENDAR_REG;             /*!< (@ 0x0000000C) RTC Calendar Register                                      */
  __IOM uint32_t  RTC_TIME_ALARM_REG;           /*!< (@ 0x00000010) RTC Time Alarm Register                                    */
  __IOM uint32_t  RTC_CALENDAR_ALARM_REG;       /*!< (@ 0x00000014) RTC Calendar Alarm Register                                */
  __IOM uint32_t  RTC_ALARM_ENABLE_REG;         /*!< (@ 0x00000018) RTC Alarm Enable Register                                  */
  __IOM uint32_t  RTC_EVENT_FLAGS_REG;          /*!< (@ 0x0000001C) RTC Event Flags Register                                   */
  __IOM uint32_t  RTC_INTERRUPT_ENABLE_REG;     /*!< (@ 0x00000020) RTC Interrupt Enable Register                              */
  __IOM uint32_t  RTC_INTERRUPT_DISABLE_REG;    /*!< (@ 0x00000024) RTC Interrupt Disable Register                             */
  __IOM uint32_t  RTC_INTERRUPT_MASK_REG;       /*!< (@ 0x00000028) RTC Interrupt Mask Register                                */
  __IOM uint32_t  RTC_STATUS_REG;               /*!< (@ 0x0000002C) RTC Status Register                                        */
  __IOM uint32_t  RTC_KEEP_RTC_REG;             /*!< (@ 0x00000030) RTC Keep RTC Register                                      */
  __IM  uint32_t  RESERVED[19];
  __IOM uint32_t  RTC_EVENT_CTRL_REG;           /*!< (@ 0x00000080) RTC Event Control Register                                 */
  __IM  uint32_t  RESERVED1;
  __IOM uint32_t  RTC_PDC_EVENT_PERIOD_REG;     /*!< (@ 0x00000088) RTC PDC Event Period Register                              */
  __IOM uint32_t  RTC_PDC_EVENT_CLEAR_REG;      /*!< (@ 0x0000008C) RTC PDC Event Clear Register                               */
  __IM  uint32_t  RESERVED2;
  __IOM uint32_t  RTC_PDC_EVENT_CNT_REG;        /*!< (@ 0x00000094) RTC PDC Event Counter Register                             */
} RTC_Type;                                     /*!< Size = 152 (0x98)                                                         */



/* =========================================================================================================================== */
/* ================                                           SDADC                                           ================ */
/* =========================================================================================================================== */


/**
  * @brief SDADC registers (SDADC)
  */

typedef struct {                                /*!< (@ 0x50020400) SDADC Structure                                            */
  __IOM uint32_t  SDADC_CTRL_REG;               /*!< (@ 0x00000000) Sigma Delta ADC Control Register                           */
  __IOM uint32_t  SDADC_PGA_CTRL_REG;           /*!< (@ 0x00000004) Sigma Delta ADC PGA Control Registers                      */
  __IM  uint32_t  RESERVED;
  __IOM uint32_t  SDADC_GAIN_CORR_REG;          /*!< (@ 0x0000000C) Sigma Delta ADC Gain Correction Register                   */
  __IOM uint32_t  SDADC_OFFS_CORR_REG;          /*!< (@ 0x00000010) Sigma Delta ADC Offset Correction Register                 */
  __IOM uint32_t  SDADC_CLEAR_INT_REG;          /*!< (@ 0x00000014) Sigma Delta ADC Clear Interrupt Register                   */
  __IOM uint32_t  SDADC_RESULT_REG;             /*!< (@ 0x00000018) Sigma Delta ADC Result Register                            */
  __IOM uint32_t  SDADC_AUDIO_FILT_REG;         /*!< (@ 0x0000001C) Sigma Delta ADC Audio Filter Register                      */
} SDADC_Type;                                   /*!< Size = 32 (0x20)                                                          */



/* =========================================================================================================================== */
/* ================                                            SPI                                            ================ */
/* =========================================================================================================================== */


/**
  * @brief SPI registers (SPI)
  */

typedef struct {                                /*!< (@ 0x50020200) SPI Structure                                              */
  __IOM uint32_t  SPI_CTRL_REG;                 /*!< (@ 0x00000000) Spi control register                                       */
  __IOM uint32_t  SPI_CONFIG_REG;               /*!< (@ 0x00000004) Spi control register                                       */
  __IOM uint32_t  SPI_CLOCK_REG;                /*!< (@ 0x00000008) Spi clock register                                         */
  __IOM uint32_t  SPI_FIFO_CONFIG_REG;          /*!< (@ 0x0000000C) Spi fifo configuration register                            */
  __IOM uint32_t  SPI_IRQ_MASK_REG;             /*!< (@ 0x00000010) Spi interrupt mask register                                */
  __IOM uint32_t  SPI_STATUS_REG;               /*!< (@ 0x00000014) Spi status register                                        */
  __IOM uint32_t  SPI_FIFO_STATUS_REG;          /*!< (@ 0x00000018) SPI RX/TX fifo status register                             */
  __IOM uint32_t  SPI_FIFO_READ_REG;            /*!< (@ 0x0000001C) Spi RX fifo read register                                  */
  __IOM uint32_t  SPI_FIFO_WRITE_REG;           /*!< (@ 0x00000020) Spi TX fifo write register                                 */
  __IOM uint32_t  SPI_CS_CONFIG_REG;            /*!< (@ 0x00000024) Spi cs configuration register                              */
  __IM  uint32_t  RESERVED;
  __IOM uint32_t  SPI_TXBUFFER_FORCE_REG;       /*!< (@ 0x0000002C) SPI TX buffer force low value                              */
} SPI_Type;                                     /*!< Size = 48 (0x30)                                                          */



/* =========================================================================================================================== */
/* ================                                           SRC1                                            ================ */
/* =========================================================================================================================== */


/**
  * @brief SRC1 registers (SRC1)
  */

typedef struct {                                /*!< (@ 0x50030100) SRC1 Structure                                             */
  __IOM uint32_t  SRC1_CTRL_REG;                /*!< (@ 0x00000000) SRC control register                                       */
  __IOM uint32_t  SRC1_IN_FS_REG;               /*!< (@ 0x00000004) SRC Sample input rate                                      */
  __IOM uint32_t  SRC1_OUT_FS_REG;              /*!< (@ 0x00000008) SRC Sample output rate                                     */
  __IOM uint32_t  SRC1_IN1_REG;                 /*!< (@ 0x0000000C) SRC data in 1                                              */
  __IOM uint32_t  SRC1_IN2_REG;                 /*!< (@ 0x00000010) SRC data in 2                                              */
  __IOM uint32_t  SRC1_OUT1_REG;                /*!< (@ 0x00000014) SRC data out 1                                             */
  __IOM uint32_t  SRC1_OUT2_REG;                /*!< (@ 0x00000018) SRC data out 2                                             */
  __IOM uint32_t  SRC1_MUX_REG;                 /*!< (@ 0x0000001C) SRC mux register                                           */
  __IOM uint32_t  SRC1_COEF10_SET1_REG;         /*!< (@ 0x00000020) SRC coefficient 1,0 set 1                                  */
  __IOM uint32_t  SRC1_COEF32_SET1_REG;         /*!< (@ 0x00000024) SRC coefficient 3,2 set 1                                  */
  __IOM uint32_t  SRC1_COEF54_SET1_REG;         /*!< (@ 0x00000028) SRC coefficient 5,4 set 1                                  */
  __IOM uint32_t  SRC1_COEF76_SET1_REG;         /*!< (@ 0x0000002C) SRC coefficient 7,6 set 1                                  */
  __IOM uint32_t  SRC1_COEF98_SET1_REG;         /*!< (@ 0x00000030) SRC coefficient 9,8 set 1                                  */
  __IOM uint32_t  SRC1_COEF0A_SET1_REG;         /*!< (@ 0x00000034) SRC coefficient 10 set 1                                   */
} SRC1_Type;                                    /*!< Size = 56 (0x38)                                                          */



/* =========================================================================================================================== */
/* ================                                           SRC2                                            ================ */
/* =========================================================================================================================== */


/**
  * @brief SRC2 registers (SRC2)
  */

typedef struct {                                /*!< (@ 0x50030200) SRC2 Structure                                             */
  __IOM uint32_t  SRC2_CTRL_REG;                /*!< (@ 0x00000000) SRC control register                                       */
  __IOM uint32_t  SRC2_IN_FS_REG;               /*!< (@ 0x00000004) SRC Sample input rate                                      */
  __IOM uint32_t  SRC2_OUT_FS_REG;              /*!< (@ 0x00000008) SRC Sample output rate                                     */
  __IOM uint32_t  SRC2_IN1_REG;                 /*!< (@ 0x0000000C) SRC data in 1                                              */
  __IOM uint32_t  SRC2_IN2_REG;                 /*!< (@ 0x00000010) SRC data in 2                                              */
  __IOM uint32_t  SRC2_OUT1_REG;                /*!< (@ 0x00000014) SRC data out 1                                             */
  __IOM uint32_t  SRC2_OUT2_REG;                /*!< (@ 0x00000018) SRC data out 2                                             */
  __IOM uint32_t  SRC2_MUX_REG;                 /*!< (@ 0x0000001C) SRC mux register                                           */
  __IOM uint32_t  SRC2_COEF10_SET1_REG;         /*!< (@ 0x00000020) SRC coefficient 1,0 set 1                                  */
  __IOM uint32_t  SRC2_COEF32_SET1_REG;         /*!< (@ 0x00000024) SRC coefficient 3,2 set 1                                  */
  __IOM uint32_t  SRC2_COEF54_SET1_REG;         /*!< (@ 0x00000028) SRC coefficient 5,4 set 1                                  */
  __IOM uint32_t  SRC2_COEF76_SET1_REG;         /*!< (@ 0x0000002C) SRC coefficient 7,6 set 1                                  */
  __IOM uint32_t  SRC2_COEF98_SET1_REG;         /*!< (@ 0x00000030) SRC coefficient 9,8 set 1                                  */
  __IOM uint32_t  SRC2_COEF0A_SET1_REG;         /*!< (@ 0x00000034) SRC coefficient 10 set 1                                   */
} SRC2_Type;                                    /*!< Size = 56 (0x38)                                                          */



/* =========================================================================================================================== */
/* ================                                         SYS_WDOG                                          ================ */
/* =========================================================================================================================== */


/**
  * @brief SYS_WDOG registers (SYS_WDOG)
  */

typedef struct {                                /*!< (@ 0x50000700) SYS_WDOG Structure                                         */
  __IOM uint32_t  WATCHDOG_REG;                 /*!< (@ 0x00000000) Watchdog timer register.                                   */
  __IOM uint32_t  WATCHDOG_CTRL_REG;            /*!< (@ 0x00000004) Watchdog control register.                                 */
} SYS_WDOG_Type;                                /*!< Size = 8 (0x8)                                                            */



/* =========================================================================================================================== */
/* ================                                           SYSB                                            ================ */
/* =========================================================================================================================== */


/**
  * @brief SYSB registers (SYSB)
  */

typedef struct {                                /*!< (@ 0x50060400) SYSB Structure                                             */
  __IOM uint32_t  QSPI_ARB_REG;                 /*!< (@ 0x00000000) ICM_S1 Priorities Register                                 */
  __IOM uint32_t  BRIDGE_REG;                   /*!< (@ 0x00000004) H2H CMAC Synchronization Register                          */
  __IOM uint32_t  FLASH_ARB_REG;                /*!< (@ 0x00000008) FPU/ICM_S2 Register                                        */
} SYSB_Type;                                    /*!< Size = 12 (0xc)                                                           */



/* =========================================================================================================================== */
/* ================                                           TIMER                                           ================ */
/* =========================================================================================================================== */


/**
  * @brief TIMER registers (TIMER)
  */

typedef struct {                                /*!< (@ 0x50010300) TIMER Structure                                            */
  __IOM uint32_t  TIMER_CTRL_REG;               /*!< (@ 0x00000000) Timer control register                                     */
  __IOM uint32_t  TIMER_TIMER_VAL_REG;          /*!< (@ 0x00000004) Timer counter value                                        */
  __IOM uint32_t  TIMER_STATUS_REG;             /*!< (@ 0x00000008) Timer status register                                      */
  __IOM uint32_t  TIMER_GPIO1_CONF_REG;         /*!< (@ 0x0000000C) Timer gpio1 selection                                      */
  __IOM uint32_t  TIMER_GPIO2_CONF_REG;         /*!< (@ 0x00000010) Timer gpio2 selection                                      */
  __IOM uint32_t  TIMER_SETTINGS_REG;           /*!< (@ 0x00000014) Timer reload value and Delay in shot mode                  */
  __IOM uint32_t  TIMER_SHOTWIDTH_REG;          /*!< (@ 0x00000018) Timer Shot duration in shot mode                           */
  __IM  uint32_t  RESERVED;
  __IOM uint32_t  TIMER_CAPTURE_GPIO1_REG;      /*!< (@ 0x00000020) Timer value for event on GPIO1                             */
  __IOM uint32_t  TIMER_CAPTURE_GPIO2_REG;      /*!< (@ 0x00000024) Timer value for event on GPIO2                             */
  __IOM uint32_t  TIMER_PRESCALER_VAL_REG;      /*!< (@ 0x00000028) Timer prescaler counter value                              */
  __IOM uint32_t  TIMER_PWM_CTRL_REG;           /*!< (@ 0x0000002C) Timer pwm frequency register                               */
  __IM  uint32_t  RESERVED1;
  __IOM uint32_t  TIMER_GPIO3_CONF_REG;         /*!< (@ 0x00000034) Timer gpio3 selection                                      */
  __IOM uint32_t  TIMER_GPIO4_CONF_REG;         /*!< (@ 0x00000038) Timer gpio4 selection                                      */
  __IOM uint32_t  TIMER_CAPTURE_GPIO3_REG;      /*!< (@ 0x0000003C) Timer value for event on GPIO1                             */
  __IOM uint32_t  TIMER_CAPTURE_GPIO4_REG;      /*!< (@ 0x00000040) Timer value for event on GPIO1                             */
  __IOM uint32_t  TIMER_CLEAR_GPIO_EVENT_REG;   /*!< (@ 0x00000044) Timer clear gpio event register                            */
  __IOM uint32_t  TIMER_CLEAR_IRQ_REG;          /*!< (@ 0x00000048) Timer clear interrupt                                      */
} TIMER_Type;                                   /*!< Size = 76 (0x4c)                                                          */



/* =========================================================================================================================== */
/* ================                                          TIMER2                                           ================ */
/* =========================================================================================================================== */


/**
  * @brief TIMER2 registers (TIMER2)
  */

typedef struct {                                /*!< (@ 0x50010400) TIMER2 Structure                                           */
  __IOM uint32_t  TIMER2_CTRL_REG;              /*!< (@ 0x00000000) Timer control register                                     */
  __IOM uint32_t  TIMER2_TIMER_VAL_REG;         /*!< (@ 0x00000004) Timer counter value                                        */
  __IOM uint32_t  TIMER2_STATUS_REG;            /*!< (@ 0x00000008) Timer status register                                      */
  __IOM uint32_t  TIMER2_GPIO1_CONF_REG;        /*!< (@ 0x0000000C) Timer gpio1 selection                                      */
  __IOM uint32_t  TIMER2_GPIO2_CONF_REG;        /*!< (@ 0x00000010) Timer gpio2 selection                                      */
  __IOM uint32_t  TIMER2_SETTINGS_REG;          /*!< (@ 0x00000014) Timer reload value and Delay in shot mode                  */
  __IOM uint32_t  TIMER2_SHOTWIDTH_REG;         /*!< (@ 0x00000018) Timer Shot duration in shot mode                           */
  __IM  uint32_t  RESERVED;
  __IOM uint32_t  TIMER2_CAPTURE_GPIO1_REG;     /*!< (@ 0x00000020) Timer value for event on GPIO1                             */
  __IOM uint32_t  TIMER2_CAPTURE_GPIO2_REG;     /*!< (@ 0x00000024) Timer value for event on GPIO2                             */
  __IOM uint32_t  TIMER2_PRESCALER_VAL_REG;     /*!< (@ 0x00000028) Timer prescaler counter value                              */
  __IOM uint32_t  TIMER2_PWM_CTRL_REG;          /*!< (@ 0x0000002C) Timer pwm frequency register                               */
  __IM  uint32_t  RESERVED1;
  __IOM uint32_t  TIMER2_CLEAR_IRQ_REG;         /*!< (@ 0x00000034) Timer clear interrupt                                      */
} TIMER2_Type;                                  /*!< Size = 56 (0x38)                                                          */



/* =========================================================================================================================== */
/* ================                                          TIMER3                                           ================ */
/* =========================================================================================================================== */


/**
  * @brief TIMER3 registers (TIMER3)
  */

typedef struct {                                /*!< (@ 0x50010500) TIMER3 Structure                                           */
  __IOM uint32_t  TIMER3_CTRL_REG;              /*!< (@ 0x00000000) Timer control register                                     */
  __IOM uint32_t  TIMER3_TIMER_VAL_REG;         /*!< (@ 0x00000004) Timer counter value                                        */
  __IOM uint32_t  TIMER3_STATUS_REG;            /*!< (@ 0x00000008) Timer status register                                      */
  __IOM uint32_t  TIMER3_GPIO1_CONF_REG;        /*!< (@ 0x0000000C) Timer gpio1 selection                                      */
  __IOM uint32_t  TIMER3_GPIO2_CONF_REG;        /*!< (@ 0x00000010) Timer gpio2 selection                                      */
  __IOM uint32_t  TIMER3_SETTINGS_REG;          /*!< (@ 0x00000014) Timer reload value and Delay in shot mode                  */
  __IM  uint32_t  RESERVED[2];
  __IOM uint32_t  TIMER3_CAPTURE_GPIO1_REG;     /*!< (@ 0x00000020) Timer value for event on GPIO1                             */
  __IOM uint32_t  TIMER3_CAPTURE_GPIO2_REG;     /*!< (@ 0x00000024) Timer value for event on GPIO2                             */
  __IOM uint32_t  TIMER3_PRESCALER_VAL_REG;     /*!< (@ 0x00000028) Timer prescaler counter value                              */
  __IOM uint32_t  TIMER3_PWM_CTRL_REG;          /*!< (@ 0x0000002C) Timer pwm frequency register                               */
  __IM  uint32_t  RESERVED1;
  __IOM uint32_t  TIMER3_CLEAR_IRQ_REG;         /*!< (@ 0x00000034) Timer clear interrupt                                      */
} TIMER3_Type;                                  /*!< Size = 56 (0x38)                                                          */



/* =========================================================================================================================== */
/* ================                                          TIMER4                                           ================ */
/* =========================================================================================================================== */


/**
  * @brief TIMER4 registers (TIMER4)
  */

