dianyundou/DA14592BLE_CSL/CSL-59x_10.679.2.17/sdk/bsp/include/DA1459x-00.h
/* ==================================================  CM_CACHE_CTRL2_REG  =================================================== */
#define CMAC_CACHE_CM_CACHE_CTRL2_REG_CACHE_READY_Pos (28UL)        /*!< CACHE_READY (Bit 28)                                  */
#define CMAC_CACHE_CM_CACHE_CTRL2_REG_CACHE_READY_Msk (0x10000000UL) /*!< CACHE_READY (Bitfield-Mask: 0x01)                    */
#define CMAC_CACHE_CM_CACHE_CTRL2_REG_CACHE_RAM_INIT_Pos (27UL)     /*!< CACHE_RAM_INIT (Bit 27)                               */
#define CMAC_CACHE_CM_CACHE_CTRL2_REG_CACHE_RAM_INIT_Msk (0x8000000UL) /*!< CACHE_RAM_INIT (Bitfield-Mask: 0x01)               */
#define CMAC_CACHE_CM_CACHE_CTRL2_REG_CACHE_EF_LEN_Pos (17UL)       /*!< CACHE_EF_LEN (Bit 17)                                 */
#define CMAC_CACHE_CM_CACHE_CTRL2_REG_CACHE_EF_LEN_Msk (0x3fe0000UL) /*!< CACHE_EF_LEN (Bitfield-Mask: 0x1ff)                  */
#define CMAC_CACHE_CM_CACHE_CTRL2_REG_CACHE_FLUSH_DISABLE_Pos (16UL) /*!< CACHE_FLUSH_DISABLE (Bit 16)                         */
#define CMAC_CACHE_CM_CACHE_CTRL2_REG_CACHE_FLUSH_DISABLE_Msk (0x10000UL) /*!< CACHE_FLUSH_DISABLE (Bitfield-Mask: 0x01)       */
#define CMAC_CACHE_CM_CACHE_CTRL2_REG_CACHE_USE_FULL_DB_RANGE_Pos (14UL) /*!< CACHE_USE_FULL_DB_RANGE (Bit 14)                 */
#define CMAC_CACHE_CM_CACHE_CTRL2_REG_CACHE_USE_FULL_DB_RANGE_Msk (0xc000UL) /*!< CACHE_USE_FULL_DB_RANGE (Bitfield-Mask: 0x03) */
#define CMAC_CACHE_CM_CACHE_CTRL2_REG_CACHE_MHCLKEN_DISABLE_Pos (13UL) /*!< CACHE_MHCLKEN_DISABLE (Bit 13)                     */
#define CMAC_CACHE_CM_CACHE_CTRL2_REG_CACHE_MHCLKEN_DISABLE_Msk (0x2000UL) /*!< CACHE_MHCLKEN_DISABLE (Bitfield-Mask: 0x01)    */
#define CMAC_CACHE_CM_CACHE_CTRL2_REG_CACHE_CWF_DISABLE_Pos (12UL)  /*!< CACHE_CWF_DISABLE (Bit 12)                            */
#define CMAC_CACHE_CM_CACHE_CTRL2_REG_CACHE_CWF_DISABLE_Msk (0x1000UL) /*!< CACHE_CWF_DISABLE (Bitfield-Mask: 0x01)            */
#define CMAC_CACHE_CM_CACHE_CTRL2_REG_CACHE_CGEN_Pos (10UL)         /*!< CACHE_CGEN (Bit 10)                                   */
#define CMAC_CACHE_CM_CACHE_CTRL2_REG_CACHE_CGEN_Msk (0x400UL)      /*!< CACHE_CGEN (Bitfield-Mask: 0x01)                      */
#define CMAC_CACHE_CM_CACHE_CTRL2_REG_CACHE_WEN_Pos (9UL)           /*!< CACHE_WEN (Bit 9)                                     */
#define CMAC_CACHE_CM_CACHE_CTRL2_REG_CACHE_WEN_Msk (0x200UL)       /*!< CACHE_WEN (Bitfield-Mask: 0x01)                       */
#define CMAC_CACHE_CM_CACHE_CTRL2_REG_CACHE_LEN_Pos (0UL)           /*!< CACHE_LEN (Bit 0)                                     */
#define CMAC_CACHE_CM_CACHE_CTRL2_REG_CACHE_LEN_Msk (0x1ffUL)       /*!< CACHE_LEN (Bitfield-Mask: 0x1ff)                      */
/* ==================================================  CM_CACHE_EFLASH_REG  ================================================== */
#define CMAC_CACHE_CM_CACHE_EFLASH_REG_EFLASH_REGION_BASE_Pos (16UL) /*!< EFLASH_REGION_BASE (Bit 16)                          */
#define CMAC_CACHE_CM_CACHE_EFLASH_REG_EFLASH_REGION_BASE_Msk (0xffff0000UL) /*!< EFLASH_REGION_BASE (Bitfield-Mask: 0xffff)   */
#define CMAC_CACHE_CM_CACHE_EFLASH_REG_EFLASH_REGION_OFFSET_Pos (4UL) /*!< EFLASH_REGION_OFFSET (Bit 4)                        */
#define CMAC_CACHE_CM_CACHE_EFLASH_REG_EFLASH_REGION_OFFSET_Msk (0xfff0UL) /*!< EFLASH_REGION_OFFSET (Bitfield-Mask: 0xfff)    */
#define CMAC_CACHE_CM_CACHE_EFLASH_REG_EFLASH_REGION_SIZE_Pos (0UL) /*!< EFLASH_REGION_SIZE (Bit 0)                            */
#define CMAC_CACHE_CM_CACHE_EFLASH_REG_EFLASH_REGION_SIZE_Msk (0x7UL) /*!< EFLASH_REGION_SIZE (Bitfield-Mask: 0x07)            */
/* ==================================================  CM_CACHE_FLASH_REG  =================================================== */
#define CMAC_CACHE_CM_CACHE_FLASH_REG_FLASH_REGION_BASE_Pos (16UL)  /*!< FLASH_REGION_BASE (Bit 16)                            */
#define CMAC_CACHE_CM_CACHE_FLASH_REG_FLASH_REGION_BASE_Msk (0xffff0000UL) /*!< FLASH_REGION_BASE (Bitfield-Mask: 0xffff)      */
#define CMAC_CACHE_CM_CACHE_FLASH_REG_FLASH_REGION_OFFSET_Pos (4UL) /*!< FLASH_REGION_OFFSET (Bit 4)                           */
#define CMAC_CACHE_CM_CACHE_FLASH_REG_FLASH_REGION_OFFSET_Msk (0xfff0UL) /*!< FLASH_REGION_OFFSET (Bitfield-Mask: 0xfff)       */
#define CMAC_CACHE_CM_CACHE_FLASH_REG_FLASH_REGION_SIZE_Pos (0UL)   /*!< FLASH_REGION_SIZE (Bit 0)                             */
#define CMAC_CACHE_CM_CACHE_FLASH_REG_FLASH_REGION_SIZE_Msk (0x7UL) /*!< FLASH_REGION_SIZE (Bitfield-Mask: 0x07)               */
/* =================================================  CM_CACHE_MRM_CTRL_REG  ================================================= */
#define CMAC_CACHE_CM_CACHE_MRM_CTRL_REG_MRM_IRQ_HITS_THRES_STATUS_Pos (4UL) /*!< MRM_IRQ_HITS_THRES_STATUS (Bit 4)            */
#define CMAC_CACHE_CM_CACHE_MRM_CTRL_REG_MRM_IRQ_HITS_THRES_STATUS_Msk (0x10UL) /*!< MRM_IRQ_HITS_THRES_STATUS (Bitfield-Mask: 0x01) */
#define CMAC_CACHE_CM_CACHE_MRM_CTRL_REG_MRM_IRQ_MISSES_THRES_STATUS_Pos (3UL) /*!< MRM_IRQ_MISSES_THRES_STATUS (Bit 3)        */
#define CMAC_CACHE_CM_CACHE_MRM_CTRL_REG_MRM_IRQ_MISSES_THRES_STATUS_Msk (0x8UL) /*!< MRM_IRQ_MISSES_THRES_STATUS (Bitfield-Mask: 0x01) */
#define CMAC_CACHE_CM_CACHE_MRM_CTRL_REG_MRM_IRQ_TINT_STATUS_Pos (2UL) /*!< MRM_IRQ_TINT_STATUS (Bit 2)                        */
#define CMAC_CACHE_CM_CACHE_MRM_CTRL_REG_MRM_IRQ_TINT_STATUS_Msk (0x4UL) /*!< MRM_IRQ_TINT_STATUS (Bitfield-Mask: 0x01)        */
#define CMAC_CACHE_CM_CACHE_MRM_CTRL_REG_MRM_IRQ_MASK_Pos (1UL)     /*!< MRM_IRQ_MASK (Bit 1)                                  */
#define CMAC_CACHE_CM_CACHE_MRM_CTRL_REG_MRM_IRQ_MASK_Msk (0x2UL)   /*!< MRM_IRQ_MASK (Bitfield-Mask: 0x01)                    */
#define CMAC_CACHE_CM_CACHE_MRM_CTRL_REG_MRM_START_Pos (0UL)        /*!< MRM_START (Bit 0)                                     */
#define CMAC_CACHE_CM_CACHE_MRM_CTRL_REG_MRM_START_Msk (0x1UL)      /*!< MRM_START (Bitfield-Mask: 0x01)                       */
/* ===============================================  CM_CACHE_MRM_HITS1WS_REG  ================================================ */
#define CMAC_CACHE_CM_CACHE_MRM_HITS1WS_REG_MRM_HITS1WS_Pos (0UL)   /*!< MRM_HITS1WS (Bit 0)                                   */
#define CMAC_CACHE_CM_CACHE_MRM_HITS1WS_REG_MRM_HITS1WS_Msk (0xffffffffUL) /*!< MRM_HITS1WS (Bitfield-Mask: 0xffffffff)        */
/* =================================================  CM_CACHE_MRM_HITS_REG  ================================================= */
#define CMAC_CACHE_CM_CACHE_MRM_HITS_REG_MRM_HITS_Pos (0UL)         /*!< MRM_HITS (Bit 0)                                      */
#define CMAC_CACHE_CM_CACHE_MRM_HITS_REG_MRM_HITS_Msk (0xffffffffUL) /*!< MRM_HITS (Bitfield-Mask: 0xffffffff)                 */
/* ==============================================  CM_CACHE_MRM_HITS_THRES_REG  ============================================== */
#define CMAC_CACHE_CM_CACHE_MRM_HITS_THRES_REG_MRM_HITS_THRES_Pos (0UL) /*!< MRM_HITS_THRES (Bit 0)                            */
#define CMAC_CACHE_CM_CACHE_MRM_HITS_THRES_REG_MRM_HITS_THRES_Msk (0xffffffffUL) /*!< MRM_HITS_THRES (Bitfield-Mask: 0xffffffff) */
/* ================================================  CM_CACHE_MRM_MISSES_REG  ================================================ */
#define CMAC_CACHE_CM_CACHE_MRM_MISSES_REG_MRM_MISSES_Pos (0UL)     /*!< MRM_MISSES (Bit 0)                                    */
#define CMAC_CACHE_CM_CACHE_MRM_MISSES_REG_MRM_MISSES_Msk (0xffffffffUL) /*!< MRM_MISSES (Bitfield-Mask: 0xffffffff)           */
/* =============================================  CM_CACHE_MRM_MISSES_THRES_REG  ============================================= */
#define CMAC_CACHE_CM_CACHE_MRM_MISSES_THRES_REG_MRM_MISSES_THRES_Pos (0UL) /*!< MRM_MISSES_THRES (Bit 0)                      */
#define CMAC_CACHE_CM_CACHE_MRM_MISSES_THRES_REG_MRM_MISSES_THRES_Msk (0xffffffffUL) /*!< MRM_MISSES_THRES (Bitfield-Mask: 0xffffffff) */
/* =================================================  CM_CACHE_MRM_TINT_REG  ================================================= */
#define CMAC_CACHE_CM_CACHE_MRM_TINT_REG_MRM_TINT_Pos (0UL)         /*!< MRM_TINT (Bit 0)                                      */
#define CMAC_CACHE_CM_CACHE_MRM_TINT_REG_MRM_TINT_Msk (0x7ffffUL)   /*!< MRM_TINT (Bitfield-Mask: 0x7ffff)                     */
/* ==================================================  CM_CACHE_RESET_REG  =================================================== */
#define CMAC_CACHE_CM_CACHE_RESET_REG_SWD_HW_RESET_REQ_Pos (0UL)    /*!< SWD_HW_RESET_REQ (Bit 0)                              */
#define CMAC_CACHE_CM_CACHE_RESET_REG_SWD_HW_RESET_REQ_Msk (0x1UL)  /*!< SWD_HW_RESET_REQ (Bitfield-Mask: 0x01)                */


/* =========================================================================================================================== */
/* ================                                          CRG_AUD                                          ================ */
/* =========================================================================================================================== */

/* ======================================================  PCM_DIV_REG  ====================================================== */
#define CRG_AUD_PCM_DIV_REG_PCM_SRC_SEL_Pos (13UL)                  /*!< PCM_SRC_SEL (Bit 13)                                  */
#define CRG_AUD_PCM_DIV_REG_PCM_SRC_SEL_Msk (0x2000UL)              /*!< PCM_SRC_SEL (Bitfield-Mask: 0x01)                     */
#define CRG_AUD_PCM_DIV_REG_CLK_PCM_EN_Pos (12UL)                   /*!< CLK_PCM_EN (Bit 12)                                   */
#define CRG_AUD_PCM_DIV_REG_CLK_PCM_EN_Msk (0x1000UL)               /*!< CLK_PCM_EN (Bitfield-Mask: 0x01)                      */
#define CRG_AUD_PCM_DIV_REG_PCM_DIV_Pos   (0UL)                     /*!< PCM_DIV (Bit 0)                                       */
#define CRG_AUD_PCM_DIV_REG_PCM_DIV_Msk   (0xfffUL)                 /*!< PCM_DIV (Bitfield-Mask: 0xfff)                        */
/* =====================================================  PCM_FDIV_REG  ====================================================== */
#define CRG_AUD_PCM_FDIV_REG_PCM_FDIV_Pos (0UL)                     /*!< PCM_FDIV (Bit 0)                                      */
#define CRG_AUD_PCM_FDIV_REG_PCM_FDIV_Msk (0xffffUL)                /*!< PCM_FDIV (Bitfield-Mask: 0xffff)                      */
/* ======================================================  PDM_DIV_REG  ====================================================== */
#define CRG_AUD_PDM_DIV_REG_PDM_MASTER_MODE_Pos (9UL)               /*!< PDM_MASTER_MODE (Bit 9)                               */
#define CRG_AUD_PDM_DIV_REG_PDM_MASTER_MODE_Msk (0x200UL)           /*!< PDM_MASTER_MODE (Bitfield-Mask: 0x01)                 */
#define CRG_AUD_PDM_DIV_REG_CLK_PDM_EN_Pos (8UL)                    /*!< CLK_PDM_EN (Bit 8)                                    */
#define CRG_AUD_PDM_DIV_REG_CLK_PDM_EN_Msk (0x100UL)                /*!< CLK_PDM_EN (Bitfield-Mask: 0x01)                      */
#define CRG_AUD_PDM_DIV_REG_PDM_DIV_Pos   (0UL)                     /*!< PDM_DIV (Bit 0)                                       */
#define CRG_AUD_PDM_DIV_REG_PDM_DIV_Msk   (0xffUL)                  /*!< PDM_DIV (Bitfield-Mask: 0xff)                         */
/* ======================================================  SRC_DIV_REG  ====================================================== */
#define CRG_AUD_SRC_DIV_REG_CLK_SRC2_EN_Pos (17UL)                  /*!< CLK_SRC2_EN (Bit 17)                                  */
#define CRG_AUD_SRC_DIV_REG_CLK_SRC2_EN_Msk (0x20000UL)             /*!< CLK_SRC2_EN (Bitfield-Mask: 0x01)                     */
#define CRG_AUD_SRC_DIV_REG_CLK_SRC_EN_Pos (16UL)                   /*!< CLK_SRC_EN (Bit 16)                                   */
#define CRG_AUD_SRC_DIV_REG_CLK_SRC_EN_Msk (0x10000UL)              /*!< CLK_SRC_EN (Bitfield-Mask: 0x01)                      */
#define CRG_AUD_SRC_DIV_REG_SRC2_DIV_Pos  (8UL)                     /*!< SRC2_DIV (Bit 8)                                      */
#define CRG_AUD_SRC_DIV_REG_SRC2_DIV_Msk  (0xff00UL)                /*!< SRC2_DIV (Bitfield-Mask: 0xff)                        */
#define CRG_AUD_SRC_DIV_REG_SRC_DIV_Pos   (0UL)                     /*!< SRC_DIV (Bit 0)                                       */
#define CRG_AUD_SRC_DIV_REG_SRC_DIV_Msk   (0xffUL)                  /*!< SRC_DIV (Bitfield-Mask: 0xff)                         */


/* =========================================================================================================================== */
/* ================                                          CRG_COM                                          ================ */
/* =========================================================================================================================== */

