dianyundou/DA14592BLE_CSL/CSL-59x_10.679.2.17/sdk/bsp/include/DA1459x-00.h
/* ======================================================  CLK_COM_REG  ====================================================== */
#define CRG_COM_CLK_COM_REG_I2C_CLK_SEL_Pos (7UL)                   /*!< I2C_CLK_SEL (Bit 7)                                   */
#define CRG_COM_CLK_COM_REG_I2C_CLK_SEL_Msk (0x80UL)                /*!< I2C_CLK_SEL (Bitfield-Mask: 0x01)                     */
#define CRG_COM_CLK_COM_REG_I2C_ENABLE_Pos (6UL)                    /*!< I2C_ENABLE (Bit 6)                                    */
#define CRG_COM_CLK_COM_REG_I2C_ENABLE_Msk (0x40UL)                 /*!< I2C_ENABLE (Bitfield-Mask: 0x01)                      */
#define CRG_COM_CLK_COM_REG_SPI_CLK_SEL_Pos (5UL)                   /*!< SPI_CLK_SEL (Bit 5)                                   */
#define CRG_COM_CLK_COM_REG_SPI_CLK_SEL_Msk (0x20UL)                /*!< SPI_CLK_SEL (Bitfield-Mask: 0x01)                     */
#define CRG_COM_CLK_COM_REG_SPI_ENABLE_Pos (4UL)                    /*!< SPI_ENABLE (Bit 4)                                    */
#define CRG_COM_CLK_COM_REG_SPI_ENABLE_Msk (0x10UL)                 /*!< SPI_ENABLE (Bitfield-Mask: 0x01)                      */
#define CRG_COM_CLK_COM_REG_UART2_CLK_SEL_Pos (3UL)                 /*!< UART2_CLK_SEL (Bit 3)                                 */
#define CRG_COM_CLK_COM_REG_UART2_CLK_SEL_Msk (0x8UL)               /*!< UART2_CLK_SEL (Bitfield-Mask: 0x01)                   */
#define CRG_COM_CLK_COM_REG_UART2_ENABLE_Pos (2UL)                  /*!< UART2_ENABLE (Bit 2)                                  */
#define CRG_COM_CLK_COM_REG_UART2_ENABLE_Msk (0x4UL)                /*!< UART2_ENABLE (Bitfield-Mask: 0x01)                    */
#define CRG_COM_CLK_COM_REG_UART_CLK_SEL_Pos (1UL)                  /*!< UART_CLK_SEL (Bit 1)                                  */
#define CRG_COM_CLK_COM_REG_UART_CLK_SEL_Msk (0x2UL)                /*!< UART_CLK_SEL (Bitfield-Mask: 0x01)                    */
#define CRG_COM_CLK_COM_REG_UART_ENABLE_Pos (0UL)                   /*!< UART_ENABLE (Bit 0)                                   */
#define CRG_COM_CLK_COM_REG_UART_ENABLE_Msk (0x1UL)                 /*!< UART_ENABLE (Bitfield-Mask: 0x01)                     */
/* ===================================================  RESET_CLK_COM_REG  =================================================== */
#define CRG_COM_RESET_CLK_COM_REG_I2C_CLK_SEL_Pos (7UL)             /*!< I2C_CLK_SEL (Bit 7)                                   */
#define CRG_COM_RESET_CLK_COM_REG_I2C_CLK_SEL_Msk (0x80UL)          /*!< I2C_CLK_SEL (Bitfield-Mask: 0x01)                     */
#define CRG_COM_RESET_CLK_COM_REG_I2C_ENABLE_Pos (6UL)              /*!< I2C_ENABLE (Bit 6)                                    */
#define CRG_COM_RESET_CLK_COM_REG_I2C_ENABLE_Msk (0x40UL)           /*!< I2C_ENABLE (Bitfield-Mask: 0x01)                      */
#define CRG_COM_RESET_CLK_COM_REG_SPI_CLK_SEL_Pos (5UL)             /*!< SPI_CLK_SEL (Bit 5)                                   */
#define CRG_COM_RESET_CLK_COM_REG_SPI_CLK_SEL_Msk (0x20UL)          /*!< SPI_CLK_SEL (Bitfield-Mask: 0x01)                     */
#define CRG_COM_RESET_CLK_COM_REG_SPI_ENABLE_Pos (4UL)              /*!< SPI_ENABLE (Bit 4)                                    */
#define CRG_COM_RESET_CLK_COM_REG_SPI_ENABLE_Msk (0x10UL)           /*!< SPI_ENABLE (Bitfield-Mask: 0x01)                      */
#define CRG_COM_RESET_CLK_COM_REG_UART2_CLK_SEL_Pos (3UL)           /*!< UART2_CLK_SEL (Bit 3)                                 */
#define CRG_COM_RESET_CLK_COM_REG_UART2_CLK_SEL_Msk (0x8UL)         /*!< UART2_CLK_SEL (Bitfield-Mask: 0x01)                   */
#define CRG_COM_RESET_CLK_COM_REG_UART2_ENABLE_Pos (2UL)            /*!< UART2_ENABLE (Bit 2)                                  */
#define CRG_COM_RESET_CLK_COM_REG_UART2_ENABLE_Msk (0x4UL)          /*!< UART2_ENABLE (Bitfield-Mask: 0x01)                    */
#define CRG_COM_RESET_CLK_COM_REG_UART_CLK_SEL_Pos (1UL)            /*!< UART_CLK_SEL (Bit 1)                                  */
#define CRG_COM_RESET_CLK_COM_REG_UART_CLK_SEL_Msk (0x2UL)          /*!< UART_CLK_SEL (Bitfield-Mask: 0x01)                    */
#define CRG_COM_RESET_CLK_COM_REG_UART_ENABLE_Pos (0UL)             /*!< UART_ENABLE (Bit 0)                                   */
#define CRG_COM_RESET_CLK_COM_REG_UART_ENABLE_Msk (0x1UL)           /*!< UART_ENABLE (Bitfield-Mask: 0x01)                     */
/* ====================================================  SET_CLK_COM_REG  ==================================================== */
#define CRG_COM_SET_CLK_COM_REG_I2C_CLK_SEL_Pos (7UL)               /*!< I2C_CLK_SEL (Bit 7)                                   */
#define CRG_COM_SET_CLK_COM_REG_I2C_CLK_SEL_Msk (0x80UL)            /*!< I2C_CLK_SEL (Bitfield-Mask: 0x01)                     */
#define CRG_COM_SET_CLK_COM_REG_I2C_ENABLE_Pos (6UL)                /*!< I2C_ENABLE (Bit 6)                                    */
#define CRG_COM_SET_CLK_COM_REG_I2C_ENABLE_Msk (0x40UL)             /*!< I2C_ENABLE (Bitfield-Mask: 0x01)                      */
#define CRG_COM_SET_CLK_COM_REG_SPI_CLK_SEL_Pos (5UL)               /*!< SPI_CLK_SEL (Bit 5)                                   */
#define CRG_COM_SET_CLK_COM_REG_SPI_CLK_SEL_Msk (0x20UL)            /*!< SPI_CLK_SEL (Bitfield-Mask: 0x01)                     */
#define CRG_COM_SET_CLK_COM_REG_SPI_ENABLE_Pos (4UL)                /*!< SPI_ENABLE (Bit 4)                                    */
#define CRG_COM_SET_CLK_COM_REG_SPI_ENABLE_Msk (0x10UL)             /*!< SPI_ENABLE (Bitfield-Mask: 0x01)                      */
#define CRG_COM_SET_CLK_COM_REG_UART2_CLK_SEL_Pos (3UL)             /*!< UART2_CLK_SEL (Bit 3)                                 */
#define CRG_COM_SET_CLK_COM_REG_UART2_CLK_SEL_Msk (0x8UL)           /*!< UART2_CLK_SEL (Bitfield-Mask: 0x01)                   */
#define CRG_COM_SET_CLK_COM_REG_UART2_ENABLE_Pos (2UL)              /*!< UART2_ENABLE (Bit 2)                                  */
#define CRG_COM_SET_CLK_COM_REG_UART2_ENABLE_Msk (0x4UL)            /*!< UART2_ENABLE (Bitfield-Mask: 0x01)                    */
#define CRG_COM_SET_CLK_COM_REG_UART_CLK_SEL_Pos (1UL)              /*!< UART_CLK_SEL (Bit 1)                                  */
#define CRG_COM_SET_CLK_COM_REG_UART_CLK_SEL_Msk (0x2UL)            /*!< UART_CLK_SEL (Bitfield-Mask: 0x01)                    */
#define CRG_COM_SET_CLK_COM_REG_UART_ENABLE_Pos (0UL)               /*!< UART_ENABLE (Bit 0)                                   */
#define CRG_COM_SET_CLK_COM_REG_UART_ENABLE_Msk (0x1UL)             /*!< UART_ENABLE (Bitfield-Mask: 0x01)                     */


/* =========================================================================================================================== */
/* ================                                          CRG_PER                                          ================ */
/* =========================================================================================================================== */

/* ======================================================  CLK_PER_REG  ====================================================== */
#define CRG_PER_CLK_PER_REG_GPADC_CLK_SEL_Pos (0UL)                 /*!< GPADC_CLK_SEL (Bit 0)                                 */
#define CRG_PER_CLK_PER_REG_GPADC_CLK_SEL_Msk (0x1UL)               /*!< GPADC_CLK_SEL (Bitfield-Mask: 0x01)                   */
/* ===================================================  RESET_CLK_PER_REG  =================================================== */
#define CRG_PER_RESET_CLK_PER_REG_GPADC_CLK_SEL_Pos (0UL)           /*!< GPADC_CLK_SEL (Bit 0)                                 */
#define CRG_PER_RESET_CLK_PER_REG_GPADC_CLK_SEL_Msk (0x1UL)         /*!< GPADC_CLK_SEL (Bitfield-Mask: 0x01)                   */
/* ====================================================  SET_CLK_PER_REG  ==================================================== */
#define CRG_PER_SET_CLK_PER_REG_GPADC_CLK_SEL_Pos (0UL)             /*!< GPADC_CLK_SEL (Bit 0)                                 */
#define CRG_PER_SET_CLK_PER_REG_GPADC_CLK_SEL_Msk (0x1UL)           /*!< GPADC_CLK_SEL (Bitfield-Mask: 0x01)                   */


/* =========================================================================================================================== */
/* ================                                          CRG_SYS                                          ================ */
/* =========================================================================================================================== */

/* ======================================================  CLK_SYS_REG  ====================================================== */


/* =========================================================================================================================== */
/* ================                                          CRG_TOP                                          ================ */
/* =========================================================================================================================== */

