dianyundou/DA14592BLE_CSL/CSL-59x_10.679.2.17/sdk/bsp/include/DA1459x-00.h
/* ====================================================  ANA_STATUS_REG  ===================================================== */
#define CRG_TOP_ANA_STATUS_REG_LDO_GPADC_OK_Pos (8UL)               /*!< LDO_GPADC_OK (Bit 8)                                  */
#define CRG_TOP_ANA_STATUS_REG_LDO_GPADC_OK_Msk (0x100UL)           /*!< LDO_GPADC_OK (Bitfield-Mask: 0x01)                    */
#define CRG_TOP_ANA_STATUS_REG_BOD_COMP_VEFLASH_OK_Pos (7UL)        /*!< BOD_COMP_VEFLASH_OK (Bit 7)                           */
#define CRG_TOP_ANA_STATUS_REG_BOD_COMP_VEFLASH_OK_Msk (0x80UL)     /*!< BOD_COMP_VEFLASH_OK (Bitfield-Mask: 0x01)             */
#define CRG_TOP_ANA_STATUS_REG_BOD_COMP_VDCDC_OK_Pos (6UL)          /*!< BOD_COMP_VDCDC_OK (Bit 6)                             */
#define CRG_TOP_ANA_STATUS_REG_BOD_COMP_VDCDC_OK_Msk (0x40UL)       /*!< BOD_COMP_VDCDC_OK (Bitfield-Mask: 0x01)               */
#define CRG_TOP_ANA_STATUS_REG_BOD_COMP_VDDIO_OK_Pos (5UL)          /*!< BOD_COMP_VDDIO_OK (Bit 5)                             */
#define CRG_TOP_ANA_STATUS_REG_BOD_COMP_VDDIO_OK_Msk (0x20UL)       /*!< BOD_COMP_VDDIO_OK (Bitfield-Mask: 0x01)               */
#define CRG_TOP_ANA_STATUS_REG_BOD_COMP_VDD_OK_Pos (4UL)            /*!< BOD_COMP_VDD_OK (Bit 4)                               */
#define CRG_TOP_ANA_STATUS_REG_BOD_COMP_VDD_OK_Msk (0x10UL)         /*!< BOD_COMP_VDD_OK (Bitfield-Mask: 0x01)                 */
#define CRG_TOP_ANA_STATUS_REG_LDO_IO_OK_Pos (3UL)                  /*!< LDO_IO_OK (Bit 3)                                     */
#define CRG_TOP_ANA_STATUS_REG_LDO_IO_OK_Msk (0x8UL)                /*!< LDO_IO_OK (Bitfield-Mask: 0x01)                       */
#define CRG_TOP_ANA_STATUS_REG_LDO_LOW_OK_Pos (2UL)                 /*!< LDO_LOW_OK (Bit 2)                                    */
#define CRG_TOP_ANA_STATUS_REG_LDO_LOW_OK_Msk (0x4UL)               /*!< LDO_LOW_OK (Bitfield-Mask: 0x01)                      */
#define CRG_TOP_ANA_STATUS_REG_LDO_CORE_OK_Pos (1UL)                /*!< LDO_CORE_OK (Bit 1)                                   */
#define CRG_TOP_ANA_STATUS_REG_LDO_CORE_OK_Msk (0x2UL)              /*!< LDO_CORE_OK (Bitfield-Mask: 0x01)                     */
#define CRG_TOP_ANA_STATUS_REG_BANDGAP_OK_Pos (0UL)                 /*!< BANDGAP_OK (Bit 0)                                    */
#define CRG_TOP_ANA_STATUS_REG_BANDGAP_OK_Msk (0x1UL)               /*!< BANDGAP_OK (Bitfield-Mask: 0x01)                      */
/* ======================================================  BANDGAP_REG  ====================================================== */
#define CRG_TOP_BANDGAP_REG_BGR_ITRIM_Pos (6UL)                     /*!< BGR_ITRIM (Bit 6)                                     */
#define CRG_TOP_BANDGAP_REG_BGR_ITRIM_Msk (0x7c0UL)                 /*!< BGR_ITRIM (Bitfield-Mask: 0x1f)                       */
#define CRG_TOP_BANDGAP_REG_BGR_TRIM_Pos  (0UL)                     /*!< BGR_TRIM (Bit 0)                                      */
#define CRG_TOP_BANDGAP_REG_BGR_TRIM_Msk  (0x1fUL)                  /*!< BGR_TRIM (Bitfield-Mask: 0x1f)                        */
/* ===================================================  BIAS_VREF_SEL_REG  =================================================== */
#define CRG_TOP_BIAS_VREF_SEL_REG_BIAS_VREF_RF2_SEL_Pos (4UL)       /*!< BIAS_VREF_RF2_SEL (Bit 4)                             */
#define CRG_TOP_BIAS_VREF_SEL_REG_BIAS_VREF_RF2_SEL_Msk (0xf0UL)    /*!< BIAS_VREF_RF2_SEL (Bitfield-Mask: 0x0f)               */
#define CRG_TOP_BIAS_VREF_SEL_REG_BIAS_VREF_RF1_SEL_Pos (0UL)       /*!< BIAS_VREF_RF1_SEL (Bit 0)                             */
#define CRG_TOP_BIAS_VREF_SEL_REG_BIAS_VREF_RF1_SEL_Msk (0xfUL)     /*!< BIAS_VREF_RF1_SEL (Bitfield-Mask: 0x0f)               */
/* =====================================================  BOD_CTRL_REG  ====================================================== */
#define CRG_TOP_BOD_CTRL_REG_BOD_VDDIO_MASK_Pos (8UL)               /*!< BOD_VDDIO_MASK (Bit 8)                                */
#define CRG_TOP_BOD_CTRL_REG_BOD_VDDIO_MASK_Msk (0x100UL)           /*!< BOD_VDDIO_MASK (Bitfield-Mask: 0x01)                  */
#define CRG_TOP_BOD_CTRL_REG_BOD_VDCDC_MASK_Pos (7UL)               /*!< BOD_VDCDC_MASK (Bit 7)                                */
#define CRG_TOP_BOD_CTRL_REG_BOD_VDCDC_MASK_Msk (0x80UL)            /*!< BOD_VDCDC_MASK (Bitfield-Mask: 0x01)                  */
#define CRG_TOP_BOD_CTRL_REG_BOD_VDD_MASK_Pos (6UL)                 /*!< BOD_VDD_MASK (Bit 6)                                  */
#define CRG_TOP_BOD_CTRL_REG_BOD_VDD_MASK_Msk (0x40UL)              /*!< BOD_VDD_MASK (Bitfield-Mask: 0x01)                    */
#define CRG_TOP_BOD_CTRL_REG_BOD_DIS_VDDIO_COMP_Pos (4UL)           /*!< BOD_DIS_VDDIO_COMP (Bit 4)                            */
#define CRG_TOP_BOD_CTRL_REG_BOD_DIS_VDDIO_COMP_Msk (0x10UL)        /*!< BOD_DIS_VDDIO_COMP (Bitfield-Mask: 0x01)              */
#define CRG_TOP_BOD_CTRL_REG_BOD_DIS_VDCDC_COMP_Pos (3UL)           /*!< BOD_DIS_VDCDC_COMP (Bit 3)                            */
#define CRG_TOP_BOD_CTRL_REG_BOD_DIS_VDCDC_COMP_Msk (0x8UL)         /*!< BOD_DIS_VDCDC_COMP (Bitfield-Mask: 0x01)              */
#define CRG_TOP_BOD_CTRL_REG_BOD_DIS_VDD_COMP_Pos (2UL)             /*!< BOD_DIS_VDD_COMP (Bit 2)                              */
#define CRG_TOP_BOD_CTRL_REG_BOD_DIS_VDD_COMP_Msk (0x4UL)           /*!< BOD_DIS_VDD_COMP (Bitfield-Mask: 0x01)                */
#define CRG_TOP_BOD_CTRL_REG_BOD_SEL_VDD_LVL_Pos (0UL)              /*!< BOD_SEL_VDD_LVL (Bit 0)                               */
#define CRG_TOP_BOD_CTRL_REG_BOD_SEL_VDD_LVL_Msk (0x3UL)            /*!< BOD_SEL_VDD_LVL (Bitfield-Mask: 0x03)                 */
/* =====================================================  CLK_AMBA_REG  ====================================================== */
#define CRG_TOP_CLK_AMBA_REG_QSPI_ENABLE_Pos (12UL)                 /*!< QSPI_ENABLE (Bit 12)                                  */
#define CRG_TOP_CLK_AMBA_REG_QSPI_ENABLE_Msk (0x1000UL)             /*!< QSPI_ENABLE (Bitfield-Mask: 0x01)                     */
#define CRG_TOP_CLK_AMBA_REG_QSPI_DIV_Pos (10UL)                    /*!< QSPI_DIV (Bit 10)                                     */
#define CRG_TOP_CLK_AMBA_REG_QSPI_DIV_Msk (0xc00UL)                 /*!< QSPI_DIV (Bitfield-Mask: 0x03)                        */
#define CRG_TOP_CLK_AMBA_REG_QDEC_CLK_ENABLE_Pos (7UL)              /*!< QDEC_CLK_ENABLE (Bit 7)                               */
#define CRG_TOP_CLK_AMBA_REG_QDEC_CLK_ENABLE_Msk (0x80UL)           /*!< QDEC_CLK_ENABLE (Bitfield-Mask: 0x01)                 */
#define CRG_TOP_CLK_AMBA_REG_AES_CLK_ENABLE_Pos (6UL)               /*!< AES_CLK_ENABLE (Bit 6)                                */
#define CRG_TOP_CLK_AMBA_REG_AES_CLK_ENABLE_Msk (0x40UL)            /*!< AES_CLK_ENABLE (Bitfield-Mask: 0x01)                  */
#define CRG_TOP_CLK_AMBA_REG_PCLK_DIV_Pos (4UL)                     /*!< PCLK_DIV (Bit 4)                                      */
#define CRG_TOP_CLK_AMBA_REG_PCLK_DIV_Msk (0x30UL)                  /*!< PCLK_DIV (Bitfield-Mask: 0x03)                        */
#define CRG_TOP_CLK_AMBA_REG_HCLK_DIV_Pos (0UL)                     /*!< HCLK_DIV (Bit 0)                                      */
#define CRG_TOP_CLK_AMBA_REG_HCLK_DIV_Msk (0x7UL)                   /*!< HCLK_DIV (Bitfield-Mask: 0x07)                        */
/* =====================================================  CLK_CTRL_REG  ====================================================== */
#define CRG_TOP_CLK_CTRL_REG_RUNNING_AT_DBLR64M_Pos (15UL)          /*!< RUNNING_AT_DBLR64M (Bit 15)                           */
#define CRG_TOP_CLK_CTRL_REG_RUNNING_AT_DBLR64M_Msk (0x8000UL)      /*!< RUNNING_AT_DBLR64M (Bitfield-Mask: 0x01)              */
#define CRG_TOP_CLK_CTRL_REG_RUNNING_AT_XTAL32M_Pos (14UL)          /*!< RUNNING_AT_XTAL32M (Bit 14)                           */
#define CRG_TOP_CLK_CTRL_REG_RUNNING_AT_XTAL32M_Msk (0x4000UL)      /*!< RUNNING_AT_XTAL32M (Bitfield-Mask: 0x01)              */
#define CRG_TOP_CLK_CTRL_REG_RUNNING_AT_RC32M_Pos (13UL)            /*!< RUNNING_AT_RC32M (Bit 13)                             */
#define CRG_TOP_CLK_CTRL_REG_RUNNING_AT_RC32M_Msk (0x2000UL)        /*!< RUNNING_AT_RC32M (Bitfield-Mask: 0x01)                */
#define CRG_TOP_CLK_CTRL_REG_RUNNING_AT_LP_CLK_Pos (12UL)           /*!< RUNNING_AT_LP_CLK (Bit 12)                            */
#define CRG_TOP_CLK_CTRL_REG_RUNNING_AT_LP_CLK_Msk (0x1000UL)       /*!< RUNNING_AT_LP_CLK (Bitfield-Mask: 0x01)               */
#define CRG_TOP_CLK_CTRL_REG_XTAL32M_DISABLE_Pos (5UL)              /*!< XTAL32M_DISABLE (Bit 5)                               */
#define CRG_TOP_CLK_CTRL_REG_XTAL32M_DISABLE_Msk (0x20UL)           /*!< XTAL32M_DISABLE (Bitfield-Mask: 0x01)                 */
#define CRG_TOP_CLK_CTRL_REG_LP_CLK_SEL_Pos (2UL)                   /*!< LP_CLK_SEL (Bit 2)                                    */
#define CRG_TOP_CLK_CTRL_REG_LP_CLK_SEL_Msk (0xcUL)                 /*!< LP_CLK_SEL (Bitfield-Mask: 0x03)                      */
#define CRG_TOP_CLK_CTRL_REG_SYS_CLK_SEL_Pos (0UL)                  /*!< SYS_CLK_SEL (Bit 0)                                   */
#define CRG_TOP_CLK_CTRL_REG_SYS_CLK_SEL_Msk (0x3UL)                /*!< SYS_CLK_SEL (Bitfield-Mask: 0x03)                     */
/* =====================================================  CLK_RADIO_REG  ===================================================== */
#define CRG_TOP_CLK_RADIO_REG_RFCU_ENABLE_Pos (3UL)                 /*!< RFCU_ENABLE (Bit 3)                                   */
#define CRG_TOP_CLK_RADIO_REG_RFCU_ENABLE_Msk (0x8UL)               /*!< RFCU_ENABLE (Bitfield-Mask: 0x01)                     */
#define CRG_TOP_CLK_RADIO_REG_CMAC_SYNCH_RESET_Pos (2UL)            /*!< CMAC_SYNCH_RESET (Bit 2)                              */
#define CRG_TOP_CLK_RADIO_REG_CMAC_SYNCH_RESET_Msk (0x4UL)          /*!< CMAC_SYNCH_RESET (Bitfield-Mask: 0x01)                */
#define CRG_TOP_CLK_RADIO_REG_CMAC_CLK_SEL_Pos (1UL)                /*!< CMAC_CLK_SEL (Bit 1)                                  */
#define CRG_TOP_CLK_RADIO_REG_CMAC_CLK_SEL_Msk (0x2UL)              /*!< CMAC_CLK_SEL (Bitfield-Mask: 0x01)                    */
#define CRG_TOP_CLK_RADIO_REG_CMAC_CLK_ENABLE_Pos (0UL)             /*!< CMAC_CLK_ENABLE (Bit 0)                               */
#define CRG_TOP_CLK_RADIO_REG_CMAC_CLK_ENABLE_Msk (0x1UL)           /*!< CMAC_CLK_ENABLE (Bitfield-Mask: 0x01)                 */
/* =====================================================  CLK_RC32M_REG  ===================================================== */
#define CRG_TOP_CLK_RC32M_REG_RC32M_COSC_Pos (7UL)                  /*!< RC32M_COSC (Bit 7)                                    */
#define CRG_TOP_CLK_RC32M_REG_RC32M_COSC_Msk (0x780UL)              /*!< RC32M_COSC (Bitfield-Mask: 0x0f)                      */
#define CRG_TOP_CLK_RC32M_REG_RC32M_RANGE_Pos (5UL)                 /*!< RC32M_RANGE (Bit 5)                                   */
#define CRG_TOP_CLK_RC32M_REG_RC32M_RANGE_Msk (0x60UL)              /*!< RC32M_RANGE (Bitfield-Mask: 0x03)                     */
#define CRG_TOP_CLK_RC32M_REG_RC32M_BIAS_Pos (1UL)                  /*!< RC32M_BIAS (Bit 1)                                    */
#define CRG_TOP_CLK_RC32M_REG_RC32M_BIAS_Msk (0x1eUL)               /*!< RC32M_BIAS (Bitfield-Mask: 0x0f)                      */
#define CRG_TOP_CLK_RC32M_REG_RC32M_ENABLE_Pos (0UL)                /*!< RC32M_ENABLE (Bit 0)                                  */
#define CRG_TOP_CLK_RC32M_REG_RC32M_ENABLE_Msk (0x1UL)              /*!< RC32M_ENABLE (Bitfield-Mask: 0x01)                    */
/* =====================================================  CLK_RCLP_REG  ====================================================== */
#define CRG_TOP_CLK_RCLP_REG_RCLP_TRIM_Pos (3UL)                    /*!< RCLP_TRIM (Bit 3)                                     */
#define CRG_TOP_CLK_RCLP_REG_RCLP_TRIM_Msk (0x78UL)                 /*!< RCLP_TRIM (Bitfield-Mask: 0x0f)                       */
#define CRG_TOP_CLK_RCLP_REG_RCLP_LOW_SPEED_FORCE_Pos (2UL)         /*!< RCLP_LOW_SPEED_FORCE (Bit 2)                          */
#define CRG_TOP_CLK_RCLP_REG_RCLP_LOW_SPEED_FORCE_Msk (0x4UL)       /*!< RCLP_LOW_SPEED_FORCE (Bitfield-Mask: 0x01)            */
#define CRG_TOP_CLK_RCLP_REG_RCLP_HIGH_SPEED_FORCE_Pos (1UL)        /*!< RCLP_HIGH_SPEED_FORCE (Bit 1)                         */
#define CRG_TOP_CLK_RCLP_REG_RCLP_HIGH_SPEED_FORCE_Msk (0x2UL)      /*!< RCLP_HIGH_SPEED_FORCE (Bitfield-Mask: 0x01)           */
#define CRG_TOP_CLK_RCLP_REG_RCLP_DISABLE_Pos (0UL)                 /*!< RCLP_DISABLE (Bit 0)                                  */
#define CRG_TOP_CLK_RCLP_REG_RCLP_DISABLE_Msk (0x1UL)               /*!< RCLP_DISABLE (Bitfield-Mask: 0x01)                    */
/* ======================================================  CLK_RCX_REG  ====================================================== */
#define CRG_TOP_CLK_RCX_REG_RCX_BIAS_Pos  (7UL)                     /*!< RCX_BIAS (Bit 7)                                      */
#define CRG_TOP_CLK_RCX_REG_RCX_BIAS_Msk  (0x780UL)                 /*!< RCX_BIAS (Bitfield-Mask: 0x0f)                        */
#define CRG_TOP_CLK_RCX_REG_RCX_C0_Pos    (6UL)                     /*!< RCX_C0 (Bit 6)                                        */
#define CRG_TOP_CLK_RCX_REG_RCX_C0_Msk    (0x40UL)                  /*!< RCX_C0 (Bitfield-Mask: 0x01)                          */
#define CRG_TOP_CLK_RCX_REG_RCX_CADJUST_Pos (1UL)                   /*!< RCX_CADJUST (Bit 1)                                   */
#define CRG_TOP_CLK_RCX_REG_RCX_CADJUST_Msk (0x3eUL)                /*!< RCX_CADJUST (Bitfield-Mask: 0x1f)                     */
#define CRG_TOP_CLK_RCX_REG_RCX_ENABLE_Pos (0UL)                    /*!< RCX_ENABLE (Bit 0)                                    */
#define CRG_TOP_CLK_RCX_REG_RCX_ENABLE_Msk (0x1UL)                  /*!< RCX_ENABLE (Bitfield-Mask: 0x01)                      */
/* ====================================================  CLK_RTCDIV_REG  ===================================================== */
#define CRG_TOP_CLK_RTCDIV_REG_RTC_RESET_REQ_Pos (21UL)             /*!< RTC_RESET_REQ (Bit 21)                                */
#define CRG_TOP_CLK_RTCDIV_REG_RTC_RESET_REQ_Msk (0x200000UL)       /*!< RTC_RESET_REQ (Bitfield-Mask: 0x01)                   */
#define CRG_TOP_CLK_RTCDIV_REG_RTC_DIV_ENABLE_Pos (20UL)            /*!< RTC_DIV_ENABLE (Bit 20)                               */
#define CRG_TOP_CLK_RTCDIV_REG_RTC_DIV_ENABLE_Msk (0x100000UL)      /*!< RTC_DIV_ENABLE (Bitfield-Mask: 0x01)                  */
#define CRG_TOP_CLK_RTCDIV_REG_RTC_DIV_DENOM_Pos (19UL)             /*!< RTC_DIV_DENOM (Bit 19)                                */
#define CRG_TOP_CLK_RTCDIV_REG_RTC_DIV_DENOM_Msk (0x80000UL)        /*!< RTC_DIV_DENOM (Bitfield-Mask: 0x01)                   */
#define CRG_TOP_CLK_RTCDIV_REG_RTC_DIV_INT_Pos (10UL)               /*!< RTC_DIV_INT (Bit 10)                                  */
#define CRG_TOP_CLK_RTCDIV_REG_RTC_DIV_INT_Msk (0x7fc00UL)          /*!< RTC_DIV_INT (Bitfield-Mask: 0x1ff)                    */
#define CRG_TOP_CLK_RTCDIV_REG_RTC_DIV_FRAC_Pos (0UL)               /*!< RTC_DIV_FRAC (Bit 0)                                  */
#define CRG_TOP_CLK_RTCDIV_REG_RTC_DIV_FRAC_Msk (0x3ffUL)           /*!< RTC_DIV_FRAC (Bitfield-Mask: 0x3ff)                   */
/* ==================================================  CLK_SWITCH2XTAL_REG  ================================================== */
#define CRG_TOP_CLK_SWITCH2XTAL_REG_SWITCH2XTAL_Pos (0UL)           /*!< SWITCH2XTAL (Bit 0)                                   */
#define CRG_TOP_CLK_SWITCH2XTAL_REG_SWITCH2XTAL_Msk (0x1UL)         /*!< SWITCH2XTAL (Bitfield-Mask: 0x01)                     */
/* ======================================================  CLK_TMR_REG  ====================================================== */
#define CRG_TOP_CLK_TMR_REG_TMR2_PWM_AON_MODE_Pos (2UL)             /*!< TMR2_PWM_AON_MODE (Bit 2)                             */
#define CRG_TOP_CLK_TMR_REG_TMR2_PWM_AON_MODE_Msk (0x4UL)           /*!< TMR2_PWM_AON_MODE (Bitfield-Mask: 0x01)               */
#define CRG_TOP_CLK_TMR_REG_TMR_PWM_AON_MODE_Pos (1UL)              /*!< TMR_PWM_AON_MODE (Bit 1)                              */
#define CRG_TOP_CLK_TMR_REG_TMR_PWM_AON_MODE_Msk (0x2UL)            /*!< TMR_PWM_AON_MODE (Bitfield-Mask: 0x01)                */
#define CRG_TOP_CLK_TMR_REG_WAKEUPCT_ENABLE_Pos (0UL)               /*!< WAKEUPCT_ENABLE (Bit 0)                               */
#define CRG_TOP_CLK_TMR_REG_WAKEUPCT_ENABLE_Msk (0x1UL)             /*!< WAKEUPCT_ENABLE (Bitfield-Mask: 0x01)                 */
/* ====================================================  CLK_XTAL32K_REG  ==================================================== */
#define CRG_TOP_CLK_XTAL32K_REG_XTAL32K_VDDX_TRIM_Pos (9UL)         /*!< XTAL32K_VDDX_TRIM (Bit 9)                             */
#define CRG_TOP_CLK_XTAL32K_REG_XTAL32K_VDDX_TRIM_Msk (0x1e00UL)    /*!< XTAL32K_VDDX_TRIM (Bitfield-Mask: 0x0f)               */
#define CRG_TOP_CLK_XTAL32K_REG_XTAL32K_DISABLE_AMPREG_Pos (7UL)    /*!< XTAL32K_DISABLE_AMPREG (Bit 7)                        */
#define CRG_TOP_CLK_XTAL32K_REG_XTAL32K_DISABLE_AMPREG_Msk (0x80UL) /*!< XTAL32K_DISABLE_AMPREG (Bitfield-Mask: 0x01)          */
#define CRG_TOP_CLK_XTAL32K_REG_XTAL32K_CUR_Pos (3UL)               /*!< XTAL32K_CUR (Bit 3)                                   */
#define CRG_TOP_CLK_XTAL32K_REG_XTAL32K_CUR_Msk (0x78UL)            /*!< XTAL32K_CUR (Bitfield-Mask: 0x0f)                     */
#define CRG_TOP_CLK_XTAL32K_REG_XTAL32K_RBIAS_Pos (1UL)             /*!< XTAL32K_RBIAS (Bit 1)                                 */
#define CRG_TOP_CLK_XTAL32K_REG_XTAL32K_RBIAS_Msk (0x6UL)           /*!< XTAL32K_RBIAS (Bitfield-Mask: 0x03)                   */
#define CRG_TOP_CLK_XTAL32K_REG_XTAL32K_ENABLE_Pos (0UL)            /*!< XTAL32K_ENABLE (Bit 0)                                */
#define CRG_TOP_CLK_XTAL32K_REG_XTAL32K_ENABLE_Msk (0x1UL)          /*!< XTAL32K_ENABLE (Bitfield-Mask: 0x01)                  */
/* ==================================================  DISCHARGE_RAIL_REG  =================================================== */
#define CRG_TOP_DISCHARGE_RAIL_REG_RESET_VDD_Pos (2UL)              /*!< RESET_VDD (Bit 2)                                     */
#define CRG_TOP_DISCHARGE_RAIL_REG_RESET_VDD_Msk (0x4UL)            /*!< RESET_VDD (Bitfield-Mask: 0x01)                       */
#define CRG_TOP_DISCHARGE_RAIL_REG_RESET_VDCDC_Pos (1UL)            /*!< RESET_VDCDC (Bit 1)                                   */
#define CRG_TOP_DISCHARGE_RAIL_REG_RESET_VDCDC_Msk (0x2UL)          /*!< RESET_VDCDC (Bitfield-Mask: 0x01)                     */
#define CRG_TOP_DISCHARGE_RAIL_REG_RESET_VIO_Pos (0UL)              /*!< RESET_VIO (Bit 0)                                     */
#define CRG_TOP_DISCHARGE_RAIL_REG_RESET_VIO_Msk (0x1UL)            /*!< RESET_VIO (Bitfield-Mask: 0x01)                       */
/* ====================================================  HIBERN_CTRL_REG  ==================================================== */
#define CRG_TOP_HIBERN_CTRL_REG_HIBERN_WKUP_MASK_Pos (4UL)          /*!< HIBERN_WKUP_MASK (Bit 4)                              */
#define CRG_TOP_HIBERN_CTRL_REG_HIBERN_WKUP_MASK_Msk (0x30UL)       /*!< HIBERN_WKUP_MASK (Bitfield-Mask: 0x03)                */
#define CRG_TOP_HIBERN_CTRL_REG_HIBERN_WKUP_POLARITY_Pos (2UL)      /*!< HIBERN_WKUP_POLARITY (Bit 2)                          */
#define CRG_TOP_HIBERN_CTRL_REG_HIBERN_WKUP_POLARITY_Msk (0xcUL)    /*!< HIBERN_WKUP_POLARITY (Bitfield-Mask: 0x03)            */
#define CRG_TOP_HIBERN_CTRL_REG_HIBERNATION_ENABLE_Pos (0UL)        /*!< HIBERNATION_ENABLE (Bit 0)                            */
#define CRG_TOP_HIBERN_CTRL_REG_HIBERNATION_ENABLE_Msk (0x1UL)      /*!< HIBERNATION_ENABLE (Bitfield-Mask: 0x01)              */
/* ===================================================  P0_PAD_LATCH_REG  ==================================================== */
#define CRG_TOP_P0_PAD_LATCH_REG_P0_LATCH_EN_Pos (0UL)              /*!< P0_LATCH_EN (Bit 0)                                   */
#define CRG_TOP_P0_PAD_LATCH_REG_P0_LATCH_EN_Msk (0xffffUL)         /*!< P0_LATCH_EN (Bitfield-Mask: 0xffff)                   */
/* ================================================  P0_RESET_PAD_LATCH_REG  ================================================= */
#define CRG_TOP_P0_RESET_PAD_LATCH_REG_P0_RESET_LATCH_EN_Pos (0UL)  /*!< P0_RESET_LATCH_EN (Bit 0)                             */
#define CRG_TOP_P0_RESET_PAD_LATCH_REG_P0_RESET_LATCH_EN_Msk (0xffffUL) /*!< P0_RESET_LATCH_EN (Bitfield-Mask: 0xffff)         */
/* =================================================  P0_SET_PAD_LATCH_REG  ================================================== */
#define CRG_TOP_P0_SET_PAD_LATCH_REG_P0_SET_LATCH_EN_Pos (0UL)      /*!< P0_SET_LATCH_EN (Bit 0)                               */
#define CRG_TOP_P0_SET_PAD_LATCH_REG_P0_SET_LATCH_EN_Msk (0xffffUL) /*!< P0_SET_LATCH_EN (Bitfield-Mask: 0xffff)               */
/* ===================================================  P1_PAD_LATCH_REG  ==================================================== */
#define CRG_TOP_P1_PAD_LATCH_REG_P1_LATCH_EN_Pos (0UL)              /*!< P1_LATCH_EN (Bit 0)                                   */
#define CRG_TOP_P1_PAD_LATCH_REG_P1_LATCH_EN_Msk (0xffffUL)         /*!< P1_LATCH_EN (Bitfield-Mask: 0xffff)                   */
/* ================================================  P1_RESET_PAD_LATCH_REG  ================================================= */
#define CRG_TOP_P1_RESET_PAD_LATCH_REG_P1_RESET_LATCH_EN_Pos (0UL)  /*!< P1_RESET_LATCH_EN (Bit 0)                             */
#define CRG_TOP_P1_RESET_PAD_LATCH_REG_P1_RESET_LATCH_EN_Msk (0xffffUL) /*!< P1_RESET_LATCH_EN (Bitfield-Mask: 0xffff)         */
/* =================================================  P1_SET_PAD_LATCH_REG  ================================================== */
#define CRG_TOP_P1_SET_PAD_LATCH_REG_P1_SET_LATCH_EN_Pos (0UL)      /*!< P1_SET_LATCH_EN (Bit 0)                               */
#define CRG_TOP_P1_SET_PAD_LATCH_REG_P1_SET_LATCH_EN_Msk (0xffffUL) /*!< P1_SET_LATCH_EN (Bitfield-Mask: 0xffff)               */
/* =====================================================  PMU_CTRL_REG  ====================================================== */
#define CRG_TOP_PMU_CTRL_REG_RETAIN_CMAC_CACHE_Pos (11UL)           /*!< RETAIN_CMAC_CACHE (Bit 11)                            */
#define CRG_TOP_PMU_CTRL_REG_RETAIN_CMAC_CACHE_Msk (0x800UL)        /*!< RETAIN_CMAC_CACHE (Bitfield-Mask: 0x01)               */
#define CRG_TOP_PMU_CTRL_REG_AUD_SLEEP_Pos (10UL)                   /*!< AUD_SLEEP (Bit 10)                                    */
#define CRG_TOP_PMU_CTRL_REG_AUD_SLEEP_Msk (0x400UL)                /*!< AUD_SLEEP (Bitfield-Mask: 0x01)                       */
#define CRG_TOP_PMU_CTRL_REG_LP_CLK_OUTPUT_EN_Pos (9UL)             /*!< LP_CLK_OUTPUT_EN (Bit 9)                              */
#define CRG_TOP_PMU_CTRL_REG_LP_CLK_OUTPUT_EN_Msk (0x200UL)         /*!< LP_CLK_OUTPUT_EN (Bitfield-Mask: 0x01)                */
#define CRG_TOP_PMU_CTRL_REG_RETAIN_CACHE_Pos (7UL)                 /*!< RETAIN_CACHE (Bit 7)                                  */
#define CRG_TOP_PMU_CTRL_REG_RETAIN_CACHE_Msk (0x80UL)              /*!< RETAIN_CACHE (Bitfield-Mask: 0x01)                    */
#define CRG_TOP_PMU_CTRL_REG_SYS_SLEEP_Pos (6UL)                    /*!< SYS_SLEEP (Bit 6)                                     */
#define CRG_TOP_PMU_CTRL_REG_SYS_SLEEP_Msk (0x40UL)                 /*!< SYS_SLEEP (Bitfield-Mask: 0x01)                       */
#define CRG_TOP_PMU_CTRL_REG_RESET_ON_WAKEUP_Pos (5UL)              /*!< RESET_ON_WAKEUP (Bit 5)                               */
