dianyundou/DA14592BLE_CSL/CSL-59x_10.679.2.17/sdk/bsp/include/DA1459x-00.h
#define CRG_TOP_PMU_CTRL_REG_RESET_ON_WAKEUP_Msk (0x20UL)           /*!< RESET_ON_WAKEUP (Bitfield-Mask: 0x01)                 */
#define CRG_TOP_PMU_CTRL_REG_MAP_BANDGAP_EN_Pos (4UL)               /*!< MAP_BANDGAP_EN (Bit 4)                                */
#define CRG_TOP_PMU_CTRL_REG_MAP_BANDGAP_EN_Msk (0x10UL)            /*!< MAP_BANDGAP_EN (Bitfield-Mask: 0x01)                  */
#define CRG_TOP_PMU_CTRL_REG_COM_SLEEP_Pos (3UL)                    /*!< COM_SLEEP (Bit 3)                                     */
#define CRG_TOP_PMU_CTRL_REG_COM_SLEEP_Msk (0x8UL)                  /*!< COM_SLEEP (Bitfield-Mask: 0x01)                       */
#define CRG_TOP_PMU_CTRL_REG_TIM_SLEEP_Pos (2UL)                    /*!< TIM_SLEEP (Bit 2)                                     */
#define CRG_TOP_PMU_CTRL_REG_TIM_SLEEP_Msk (0x4UL)                  /*!< TIM_SLEEP (Bitfield-Mask: 0x01)                       */
#define CRG_TOP_PMU_CTRL_REG_RADIO_SLEEP_Pos (1UL)                  /*!< RADIO_SLEEP (Bit 1)                                   */
#define CRG_TOP_PMU_CTRL_REG_RADIO_SLEEP_Msk (0x2UL)                /*!< RADIO_SLEEP (Bitfield-Mask: 0x01)                     */
#define CRG_TOP_PMU_CTRL_REG_PERIPH_SLEEP_Pos (0UL)                 /*!< PERIPH_SLEEP (Bit 0)                                  */
#define CRG_TOP_PMU_CTRL_REG_PERIPH_SLEEP_Msk (0x1UL)               /*!< PERIPH_SLEEP (Bitfield-Mask: 0x01)                    */
/* =====================================================  PMU_SLEEP_REG  ===================================================== */
#define CRG_TOP_PMU_SLEEP_REG_FAST_WAKEUP_Pos (16UL)                /*!< FAST_WAKEUP (Bit 16)                                  */
#define CRG_TOP_PMU_SLEEP_REG_FAST_WAKEUP_Msk (0x10000UL)           /*!< FAST_WAKEUP (Bitfield-Mask: 0x01)                     */
#define CRG_TOP_PMU_SLEEP_REG_LDO_OK_BYPASS_Pos (15UL)              /*!< LDO_OK_BYPASS (Bit 15)                                */
#define CRG_TOP_PMU_SLEEP_REG_LDO_OK_BYPASS_Msk (0x8000UL)          /*!< LDO_OK_BYPASS (Bitfield-Mask: 0x01)                   */
#define CRG_TOP_PMU_SLEEP_REG_FAST_WAKEUP_SKIP_BGR_OK_Pos (14UL)    /*!< FAST_WAKEUP_SKIP_BGR_OK (Bit 14)                      */
#define CRG_TOP_PMU_SLEEP_REG_FAST_WAKEUP_SKIP_BGR_OK_Msk (0x4000UL) /*!< FAST_WAKEUP_SKIP_BGR_OK (Bitfield-Mask: 0x01)        */
#define CRG_TOP_PMU_SLEEP_REG_BOD_MASK_BGR_OK_Pos (13UL)            /*!< BOD_MASK_BGR_OK (Bit 13)                              */
#define CRG_TOP_PMU_SLEEP_REG_BOD_MASK_BGR_OK_Msk (0x2000UL)        /*!< BOD_MASK_BGR_OK (Bitfield-Mask: 0x01)                 */
#define CRG_TOP_PMU_SLEEP_REG_BG_ENABLE_SLEEP_Pos (12UL)            /*!< BG_ENABLE_SLEEP (Bit 12)                              */
#define CRG_TOP_PMU_SLEEP_REG_BG_ENABLE_SLEEP_Msk (0x1000UL)        /*!< BG_ENABLE_SLEEP (Bitfield-Mask: 0x01)                 */
#define CRG_TOP_PMU_SLEEP_REG_BG_REFRESH_INTERVAL_Pos (0UL)         /*!< BG_REFRESH_INTERVAL (Bit 0)                           */
#define CRG_TOP_PMU_SLEEP_REG_BG_REFRESH_INTERVAL_Msk (0xfffUL)     /*!< BG_REFRESH_INTERVAL (Bitfield-Mask: 0xfff)            */
/* ======================================================  POR_PIN_REG  ====================================================== */
#define CRG_TOP_POR_PIN_REG_POR_PIN_POLARITY_Pos (7UL)              /*!< POR_PIN_POLARITY (Bit 7)                              */
#define CRG_TOP_POR_PIN_REG_POR_PIN_POLARITY_Msk (0x80UL)           /*!< POR_PIN_POLARITY (Bitfield-Mask: 0x01)                */
#define CRG_TOP_POR_PIN_REG_POR_PIN_SELECT_Pos (0UL)                /*!< POR_PIN_SELECT (Bit 0)                                */
#define CRG_TOP_POR_PIN_REG_POR_PIN_SELECT_Msk (0x3fUL)             /*!< POR_PIN_SELECT (Bitfield-Mask: 0x3f)                  */
/* =====================================================  POR_TIMER_REG  ===================================================== */
#define CRG_TOP_POR_TIMER_REG_POR_TIME_Pos (0UL)                    /*!< POR_TIME (Bit 0)                                      */
#define CRG_TOP_POR_TIMER_REG_POR_TIME_Msk (0x7fUL)                 /*!< POR_TIME (Bitfield-Mask: 0x7f)                        */
/* ====================================================  POWER_CTRL_REG  ===================================================== */
#define CRG_TOP_POWER_CTRL_REG_LDO_CORE_RET_VREF_ENABLE_Pos (14UL)  /*!< LDO_CORE_RET_VREF_ENABLE (Bit 14)                     */
#define CRG_TOP_POWER_CTRL_REG_LDO_CORE_RET_VREF_ENABLE_Msk (0x4000UL) /*!< LDO_CORE_RET_VREF_ENABLE (Bitfield-Mask: 0x01)     */
#define CRG_TOP_POWER_CTRL_REG_LDO_IO_RET_VREF_ENABLE_Pos (13UL)    /*!< LDO_IO_RET_VREF_ENABLE (Bit 13)                       */
#define CRG_TOP_POWER_CTRL_REG_LDO_IO_RET_VREF_ENABLE_Msk (0x2000UL) /*!< LDO_IO_RET_VREF_ENABLE (Bitfield-Mask: 0x01)         */
#define CRG_TOP_POWER_CTRL_REG_LDO_VREF_HOLD_FORCE_Pos (12UL)       /*!< LDO_VREF_HOLD_FORCE (Bit 12)                          */
#define CRG_TOP_POWER_CTRL_REG_LDO_VREF_HOLD_FORCE_Msk (0x1000UL)   /*!< LDO_VREF_HOLD_FORCE (Bitfield-Mask: 0x01)             */
#define CRG_TOP_POWER_CTRL_REG_DCDC_ENABLE_SLEEP_Pos (11UL)         /*!< DCDC_ENABLE_SLEEP (Bit 11)                            */
#define CRG_TOP_POWER_CTRL_REG_DCDC_ENABLE_SLEEP_Msk (0x800UL)      /*!< DCDC_ENABLE_SLEEP (Bitfield-Mask: 0x01)               */
#define CRG_TOP_POWER_CTRL_REG_LDO_CORE_RET_ENABLE_SLEEP_Pos (10UL) /*!< LDO_CORE_RET_ENABLE_SLEEP (Bit 10)                    */
#define CRG_TOP_POWER_CTRL_REG_LDO_CORE_RET_ENABLE_SLEEP_Msk (0x400UL) /*!< LDO_CORE_RET_ENABLE_SLEEP (Bitfield-Mask: 0x01)    */
#define CRG_TOP_POWER_CTRL_REG_LDO_CORE_RET_ENABLE_ACTIVE_Pos (9UL) /*!< LDO_CORE_RET_ENABLE_ACTIVE (Bit 9)                    */
#define CRG_TOP_POWER_CTRL_REG_LDO_CORE_RET_ENABLE_ACTIVE_Msk (0x200UL) /*!< LDO_CORE_RET_ENABLE_ACTIVE (Bitfield-Mask: 0x01)  */
#define CRG_TOP_POWER_CTRL_REG_LDO_LOW_ENABLE_SLEEP_Pos (8UL)       /*!< LDO_LOW_ENABLE_SLEEP (Bit 8)                          */
#define CRG_TOP_POWER_CTRL_REG_LDO_LOW_ENABLE_SLEEP_Msk (0x100UL)   /*!< LDO_LOW_ENABLE_SLEEP (Bitfield-Mask: 0x01)            */
#define CRG_TOP_POWER_CTRL_REG_LDO_LOW_HIGH_CURRENT_Pos (7UL)       /*!< LDO_LOW_HIGH_CURRENT (Bit 7)                          */
#define CRG_TOP_POWER_CTRL_REG_LDO_LOW_HIGH_CURRENT_Msk (0x80UL)    /*!< LDO_LOW_HIGH_CURRENT (Bitfield-Mask: 0x01)            */
#define CRG_TOP_POWER_CTRL_REG_LDO_IO_BYPASS_SLEEP_Pos (6UL)        /*!< LDO_IO_BYPASS_SLEEP (Bit 6)                           */
#define CRG_TOP_POWER_CTRL_REG_LDO_IO_BYPASS_SLEEP_Msk (0x40UL)     /*!< LDO_IO_BYPASS_SLEEP (Bitfield-Mask: 0x01)             */
#define CRG_TOP_POWER_CTRL_REG_LDO_IO_BYPASS_ACTIVE_Pos (5UL)       /*!< LDO_IO_BYPASS_ACTIVE (Bit 5)                          */
#define CRG_TOP_POWER_CTRL_REG_LDO_IO_BYPASS_ACTIVE_Msk (0x20UL)    /*!< LDO_IO_BYPASS_ACTIVE (Bitfield-Mask: 0x01)            */
#define CRG_TOP_POWER_CTRL_REG_LDO_IO_RET_ENABLE_SLEEP_Pos (4UL)    /*!< LDO_IO_RET_ENABLE_SLEEP (Bit 4)                       */
#define CRG_TOP_POWER_CTRL_REG_LDO_IO_RET_ENABLE_SLEEP_Msk (0x10UL) /*!< LDO_IO_RET_ENABLE_SLEEP (Bitfield-Mask: 0x01)         */
#define CRG_TOP_POWER_CTRL_REG_LDO_IO_RET_ENABLE_ACTIVE_Pos (3UL)   /*!< LDO_IO_RET_ENABLE_ACTIVE (Bit 3)                      */
#define CRG_TOP_POWER_CTRL_REG_LDO_IO_RET_ENABLE_ACTIVE_Msk (0x8UL) /*!< LDO_IO_RET_ENABLE_ACTIVE (Bitfield-Mask: 0x01)        */
#define CRG_TOP_POWER_CTRL_REG_LDO_CORE_ENABLE_Pos (2UL)            /*!< LDO_CORE_ENABLE (Bit 2)                               */
#define CRG_TOP_POWER_CTRL_REG_LDO_CORE_ENABLE_Msk (0x4UL)          /*!< LDO_CORE_ENABLE (Bitfield-Mask: 0x01)                 */
#define CRG_TOP_POWER_CTRL_REG_LDO_LOW_ENABLE_ACTIVE_Pos (1UL)      /*!< LDO_LOW_ENABLE_ACTIVE (Bit 1)                         */
#define CRG_TOP_POWER_CTRL_REG_LDO_LOW_ENABLE_ACTIVE_Msk (0x2UL)    /*!< LDO_LOW_ENABLE_ACTIVE (Bitfield-Mask: 0x01)           */
#define CRG_TOP_POWER_CTRL_REG_LDO_IO_ENABLE_Pos (0UL)              /*!< LDO_IO_ENABLE (Bit 0)                                 */
#define CRG_TOP_POWER_CTRL_REG_LDO_IO_ENABLE_Msk (0x1UL)            /*!< LDO_IO_ENABLE (Bitfield-Mask: 0x01)                   */
/* ====================================================  POWER_LEVEL_REG  ==================================================== */
#define CRG_TOP_POWER_LEVEL_REG_XTAL32M_LDO_LEVEL_Pos (11UL)        /*!< XTAL32M_LDO_LEVEL (Bit 11)                            */
#define CRG_TOP_POWER_LEVEL_REG_XTAL32M_LDO_LEVEL_Msk (0x3800UL)    /*!< XTAL32M_LDO_LEVEL (Bitfield-Mask: 0x07)               */
#define CRG_TOP_POWER_LEVEL_REG_VDDIO_TRIM_Pos (7UL)                /*!< VDDIO_TRIM (Bit 7)                                    */
#define CRG_TOP_POWER_LEVEL_REG_VDDIO_TRIM_Msk (0x780UL)            /*!< VDDIO_TRIM (Bitfield-Mask: 0x0f)                      */
#define CRG_TOP_POWER_LEVEL_REG_VDCDC_LEVEL_Pos (4UL)               /*!< VDCDC_LEVEL (Bit 4)                                   */
#define CRG_TOP_POWER_LEVEL_REG_VDCDC_LEVEL_Msk (0x70UL)            /*!< VDCDC_LEVEL (Bitfield-Mask: 0x07)                     */
#define CRG_TOP_POWER_LEVEL_REG_VDD_LEVEL_SLEEP_Pos (3UL)           /*!< VDD_LEVEL_SLEEP (Bit 3)                               */
#define CRG_TOP_POWER_LEVEL_REG_VDD_LEVEL_SLEEP_Msk (0x8UL)         /*!< VDD_LEVEL_SLEEP (Bitfield-Mask: 0x01)                 */
#define CRG_TOP_POWER_LEVEL_REG_VDD_LEVEL_ACTIVE_Pos (0UL)          /*!< VDD_LEVEL_ACTIVE (Bit 0)                              */
#define CRG_TOP_POWER_LEVEL_REG_VDD_LEVEL_ACTIVE_Msk (0x7UL)        /*!< VDD_LEVEL_ACTIVE (Bitfield-Mask: 0x07)                */
/* ===================================================  RAM_PWR_CTRL_REG  ==================================================== */
#define CRG_TOP_RAM_PWR_CTRL_REG_RAM3_PWR_CTRL_Pos (4UL)            /*!< RAM3_PWR_CTRL (Bit 4)                                 */
#define CRG_TOP_RAM_PWR_CTRL_REG_RAM3_PWR_CTRL_Msk (0x30UL)         /*!< RAM3_PWR_CTRL (Bitfield-Mask: 0x03)                   */
#define CRG_TOP_RAM_PWR_CTRL_REG_RAM2_PWR_CTRL_Pos (2UL)            /*!< RAM2_PWR_CTRL (Bit 2)                                 */
#define CRG_TOP_RAM_PWR_CTRL_REG_RAM2_PWR_CTRL_Msk (0xcUL)          /*!< RAM2_PWR_CTRL (Bitfield-Mask: 0x03)                   */
#define CRG_TOP_RAM_PWR_CTRL_REG_RAM1_PWR_CTRL_Pos (0UL)            /*!< RAM1_PWR_CTRL (Bit 0)                                 */
#define CRG_TOP_RAM_PWR_CTRL_REG_RAM1_PWR_CTRL_Msk (0x3UL)          /*!< RAM1_PWR_CTRL (Bitfield-Mask: 0x03)                   */
/* ====================================================  RESET_STAT_REG  ===================================================== */
#define CRG_TOP_RESET_STAT_REG_CMAC_WDOGRESET_STAT_Pos (5UL)        /*!< CMAC_WDOGRESET_STAT (Bit 5)                           */
#define CRG_TOP_RESET_STAT_REG_CMAC_WDOGRESET_STAT_Msk (0x20UL)     /*!< CMAC_WDOGRESET_STAT (Bitfield-Mask: 0x01)             */
#define CRG_TOP_RESET_STAT_REG_SWD_HWRESET_STAT_Pos (4UL)           /*!< SWD_HWRESET_STAT (Bit 4)                              */
#define CRG_TOP_RESET_STAT_REG_SWD_HWRESET_STAT_Msk (0x10UL)        /*!< SWD_HWRESET_STAT (Bitfield-Mask: 0x01)                */
#define CRG_TOP_RESET_STAT_REG_WDOGRESET_STAT_Pos (3UL)             /*!< WDOGRESET_STAT (Bit 3)                                */
#define CRG_TOP_RESET_STAT_REG_WDOGRESET_STAT_Msk (0x8UL)           /*!< WDOGRESET_STAT (Bitfield-Mask: 0x01)                  */
#define CRG_TOP_RESET_STAT_REG_SWRESET_STAT_Pos (2UL)               /*!< SWRESET_STAT (Bit 2)                                  */
#define CRG_TOP_RESET_STAT_REG_SWRESET_STAT_Msk (0x4UL)             /*!< SWRESET_STAT (Bitfield-Mask: 0x01)                    */
#define CRG_TOP_RESET_STAT_REG_HWRESET_STAT_Pos (1UL)               /*!< HWRESET_STAT (Bit 1)                                  */
#define CRG_TOP_RESET_STAT_REG_HWRESET_STAT_Msk (0x2UL)             /*!< HWRESET_STAT (Bitfield-Mask: 0x01)                    */
#define CRG_TOP_RESET_STAT_REG_PORESET_STAT_Pos (0UL)               /*!< PORESET_STAT (Bit 0)                                  */
#define CRG_TOP_RESET_STAT_REG_PORESET_STAT_Msk (0x1UL)             /*!< PORESET_STAT (Bitfield-Mask: 0x01)                    */
/* =====================================================  RST_CTRL_REG  ====================================================== */
#define CRG_TOP_RST_CTRL_REG_CMAC_CACHE_FLUSH_WITH_SW_RESET_Pos (2UL) /*!< CMAC_CACHE_FLUSH_WITH_SW_RESET (Bit 2)              */
#define CRG_TOP_RST_CTRL_REG_CMAC_CACHE_FLUSH_WITH_SW_RESET_Msk (0x4UL) /*!< CMAC_CACHE_FLUSH_WITH_SW_RESET (Bitfield-Mask: 0x01) */
#define CRG_TOP_RST_CTRL_REG_SYS_CACHE_FLUSH_WITH_SW_RESET_Pos (1UL) /*!< SYS_CACHE_FLUSH_WITH_SW_RESET (Bit 1)                */
#define CRG_TOP_RST_CTRL_REG_SYS_CACHE_FLUSH_WITH_SW_RESET_Msk (0x2UL) /*!< SYS_CACHE_FLUSH_WITH_SW_RESET (Bitfield-Mask: 0x01) */
#define CRG_TOP_RST_CTRL_REG_GATE_RST_WITH_FCU_Pos (0UL)            /*!< GATE_RST_WITH_FCU (Bit 0)                             */
#define CRG_TOP_RST_CTRL_REG_GATE_RST_WITH_FCU_Msk (0x1UL)          /*!< GATE_RST_WITH_FCU (Bitfield-Mask: 0x01)               */
/* ====================================================  SECURE_BOOT_REG  ==================================================== */
#define CRG_TOP_SECURE_BOOT_REG_PROT_INFO_PAGE_Pos (8UL)            /*!< PROT_INFO_PAGE (Bit 8)                                */
#define CRG_TOP_SECURE_BOOT_REG_PROT_INFO_PAGE_Msk (0x100UL)        /*!< PROT_INFO_PAGE (Bitfield-Mask: 0x01)                  */
#define CRG_TOP_SECURE_BOOT_REG_SECURE_BOOT_Pos (6UL)               /*!< SECURE_BOOT (Bit 6)                                   */
#define CRG_TOP_SECURE_BOOT_REG_SECURE_BOOT_Msk (0x40UL)            /*!< SECURE_BOOT (Bitfield-Mask: 0x01)                     */
#define CRG_TOP_SECURE_BOOT_REG_FORCE_CMAC_DEBUGGER_OFF_Pos (5UL)   /*!< FORCE_CMAC_DEBUGGER_OFF (Bit 5)                       */
#define CRG_TOP_SECURE_BOOT_REG_FORCE_CMAC_DEBUGGER_OFF_Msk (0x20UL) /*!< FORCE_CMAC_DEBUGGER_OFF (Bitfield-Mask: 0x01)        */
#define CRG_TOP_SECURE_BOOT_REG_FORCE_M33_DEBUGGER_OFF_Pos (4UL)    /*!< FORCE_M33_DEBUGGER_OFF (Bit 4)                        */
#define CRG_TOP_SECURE_BOOT_REG_FORCE_M33_DEBUGGER_OFF_Msk (0x10UL) /*!< FORCE_M33_DEBUGGER_OFF (Bitfield-Mask: 0x01)          */
#define CRG_TOP_SECURE_BOOT_REG_PROT_USER_APP_CODE_Pos (3UL)        /*!< PROT_USER_APP_CODE (Bit 3)                            */
#define CRG_TOP_SECURE_BOOT_REG_PROT_USER_APP_CODE_Msk (0x8UL)      /*!< PROT_USER_APP_CODE (Bitfield-Mask: 0x01)              */
#define CRG_TOP_SECURE_BOOT_REG_PROT_VALID_KEY_Pos (2UL)            /*!< PROT_VALID_KEY (Bit 2)                                */
#define CRG_TOP_SECURE_BOOT_REG_PROT_VALID_KEY_Msk (0x4UL)          /*!< PROT_VALID_KEY (Bitfield-Mask: 0x01)                  */
#define CRG_TOP_SECURE_BOOT_REG_PROT_APP_KEY_Pos (1UL)              /*!< PROT_APP_KEY (Bit 1)                                  */
#define CRG_TOP_SECURE_BOOT_REG_PROT_APP_KEY_Msk (0x2UL)            /*!< PROT_APP_KEY (Bitfield-Mask: 0x01)                    */
#define CRG_TOP_SECURE_BOOT_REG_PROT_CONFIG_SCRIPT_Pos (0UL)        /*!< PROT_CONFIG_SCRIPT (Bit 0)                            */
#define CRG_TOP_SECURE_BOOT_REG_PROT_CONFIG_SCRIPT_Msk (0x1UL)      /*!< PROT_CONFIG_SCRIPT (Bitfield-Mask: 0x01)              */
/* ==================================================  STARTUP_STATUS_REG  =================================================== */
#define CRG_TOP_STARTUP_STATUS_REG_VEFLASH_LVL_RD_Pos (9UL)         /*!< VEFLASH_LVL_RD (Bit 9)                                */
#define CRG_TOP_STARTUP_STATUS_REG_VEFLASH_LVL_RD_Msk (0x200UL)     /*!< VEFLASH_LVL_RD (Bitfield-Mask: 0x01)                  */
#define CRG_TOP_STARTUP_STATUS_REG_BOD_VEFLASH_OK_SYNC_Pos (8UL)    /*!< BOD_VEFLASH_OK_SYNC (Bit 8)                           */
#define CRG_TOP_STARTUP_STATUS_REG_BOD_VEFLASH_OK_SYNC_Msk (0x100UL) /*!< BOD_VEFLASH_OK_SYNC (Bitfield-Mask: 0x01)            */
#define CRG_TOP_STARTUP_STATUS_REG_BOD_VDDIO_OK_SYNC_RD_Pos (7UL)   /*!< BOD_VDDIO_OK_SYNC_RD (Bit 7)                          */
#define CRG_TOP_STARTUP_STATUS_REG_BOD_VDDIO_OK_SYNC_RD_Msk (0x80UL) /*!< BOD_VDDIO_OK_SYNC_RD (Bitfield-Mask: 0x01)           */
#define CRG_TOP_STARTUP_STATUS_REG_BOD_VDDD_OK_SYNC_RD_Pos (6UL)    /*!< BOD_VDDD_OK_SYNC_RD (Bit 6)                           */
#define CRG_TOP_STARTUP_STATUS_REG_BOD_VDDD_OK_SYNC_RD_Msk (0x40UL) /*!< BOD_VDDD_OK_SYNC_RD (Bitfield-Mask: 0x01)             */
#define CRG_TOP_STARTUP_STATUS_REG_BOD_VDCDC_OK_SYNC_RD_Pos (5UL)   /*!< BOD_VDCDC_OK_SYNC_RD (Bit 5)                          */
#define CRG_TOP_STARTUP_STATUS_REG_BOD_VDCDC_OK_SYNC_RD_Msk (0x20UL) /*!< BOD_VDCDC_OK_SYNC_RD (Bitfield-Mask: 0x01)           */
#define CRG_TOP_STARTUP_STATUS_REG_BOD_VDDD_LVL_RD_Pos (3UL)        /*!< BOD_VDDD_LVL_RD (Bit 3)                               */
#define CRG_TOP_STARTUP_STATUS_REG_BOD_VDDD_LVL_RD_Msk (0x18UL)     /*!< BOD_VDDD_LVL_RD (Bitfield-Mask: 0x03)                 */
#define CRG_TOP_STARTUP_STATUS_REG_BOD_VDDIO_MASK_SYNC_RD_Pos (2UL) /*!< BOD_VDDIO_MASK_SYNC_RD (Bit 2)                        */
#define CRG_TOP_STARTUP_STATUS_REG_BOD_VDDIO_MASK_SYNC_RD_Msk (0x4UL) /*!< BOD_VDDIO_MASK_SYNC_RD (Bitfield-Mask: 0x01)        */
#define CRG_TOP_STARTUP_STATUS_REG_BOD_VDDD_MASK_SYNC_RD_Pos (1UL)  /*!< BOD_VDDD_MASK_SYNC_RD (Bit 1)                         */
#define CRG_TOP_STARTUP_STATUS_REG_BOD_VDDD_MASK_SYNC_RD_Msk (0x2UL) /*!< BOD_VDDD_MASK_SYNC_RD (Bitfield-Mask: 0x01)          */
#define CRG_TOP_STARTUP_STATUS_REG_BOD_VDCDC_MASK_SYNC_RD_Pos (0UL) /*!< BOD_VDCDC_MASK_SYNC_RD (Bit 0)                        */
#define CRG_TOP_STARTUP_STATUS_REG_BOD_VDCDC_MASK_SYNC_RD_Msk (0x1UL) /*!< BOD_VDCDC_MASK_SYNC_RD (Bitfield-Mask: 0x01)        */
/* =====================================================  SYS_CTRL_REG  ====================================================== */
#define CRG_TOP_SYS_CTRL_REG_SW_RESET_Pos (15UL)                    /*!< SW_RESET (Bit 15)                                     */
#define CRG_TOP_SYS_CTRL_REG_SW_RESET_Msk (0x8000UL)                /*!< SW_RESET (Bitfield-Mask: 0x01)                        */
#define CRG_TOP_SYS_CTRL_REG_CACHERAM_MUX_Pos (10UL)                /*!< CACHERAM_MUX (Bit 10)                                 */
#define CRG_TOP_SYS_CTRL_REG_CACHERAM_MUX_Msk (0x400UL)             /*!< CACHERAM_MUX (Bitfield-Mask: 0x01)                    */
#define CRG_TOP_SYS_CTRL_REG_DEBUGGER_ENABLE_Pos (7UL)              /*!< DEBUGGER_ENABLE (Bit 7)                               */
#define CRG_TOP_SYS_CTRL_REG_DEBUGGER_ENABLE_Msk (0x80UL)           /*!< DEBUGGER_ENABLE (Bitfield-Mask: 0x01)                 */
#define CRG_TOP_SYS_CTRL_REG_REMAP_INTVECT_Pos (3UL)                /*!< REMAP_INTVECT (Bit 3)                                 */
#define CRG_TOP_SYS_CTRL_REG_REMAP_INTVECT_Msk (0x8UL)              /*!< REMAP_INTVECT (Bitfield-Mask: 0x01)                   */
#define CRG_TOP_SYS_CTRL_REG_REMAP_ADR0_Pos (0UL)                   /*!< REMAP_ADR0 (Bit 0)                                    */
#define CRG_TOP_SYS_CTRL_REG_REMAP_ADR0_Msk (0x7UL)                 /*!< REMAP_ADR0 (Bitfield-Mask: 0x07)                      */
/* =====================================================  SYS_STAT_REG  ====================================================== */
#define CRG_TOP_SYS_STAT_REG_POWER_IS_UP_Pos (15UL)                 /*!< POWER_IS_UP (Bit 15)                                  */
#define CRG_TOP_SYS_STAT_REG_POWER_IS_UP_Msk (0x8000UL)             /*!< POWER_IS_UP (Bitfield-Mask: 0x01)                     */
#define CRG_TOP_SYS_STAT_REG_DBG_IS_ACTIVE_Pos (14UL)               /*!< DBG_IS_ACTIVE (Bit 14)                                */
#define CRG_TOP_SYS_STAT_REG_DBG_IS_ACTIVE_Msk (0x4000UL)           /*!< DBG_IS_ACTIVE (Bitfield-Mask: 0x01)                   */
#define CRG_TOP_SYS_STAT_REG_AUD_IS_UP_Pos (13UL)                   /*!< AUD_IS_UP (Bit 13)                                    */
#define CRG_TOP_SYS_STAT_REG_AUD_IS_UP_Msk (0x2000UL)               /*!< AUD_IS_UP (Bitfield-Mask: 0x01)                       */
#define CRG_TOP_SYS_STAT_REG_AUD_IS_DOWN_Pos (12UL)                 /*!< AUD_IS_DOWN (Bit 12)                                  */
#define CRG_TOP_SYS_STAT_REG_AUD_IS_DOWN_Msk (0x1000UL)             /*!< AUD_IS_DOWN (Bitfield-Mask: 0x01)                     */
#define CRG_TOP_SYS_STAT_REG_COM_IS_UP_Pos (11UL)                   /*!< COM_IS_UP (Bit 11)                                    */
#define CRG_TOP_SYS_STAT_REG_COM_IS_UP_Msk (0x800UL)                /*!< COM_IS_UP (Bitfield-Mask: 0x01)                       */
#define CRG_TOP_SYS_STAT_REG_COM_IS_DOWN_Pos (10UL)                 /*!< COM_IS_DOWN (Bit 10)                                  */
#define CRG_TOP_SYS_STAT_REG_COM_IS_DOWN_Msk (0x400UL)              /*!< COM_IS_DOWN (Bitfield-Mask: 0x01)                     */
#define CRG_TOP_SYS_STAT_REG_TIM_IS_UP_Pos (9UL)                    /*!< TIM_IS_UP (Bit 9)                                     */
#define CRG_TOP_SYS_STAT_REG_TIM_IS_UP_Msk (0x200UL)                /*!< TIM_IS_UP (Bitfield-Mask: 0x01)                       */
#define CRG_TOP_SYS_STAT_REG_TIM_IS_DOWN_Pos (8UL)                  /*!< TIM_IS_DOWN (Bit 8)                                   */
#define CRG_TOP_SYS_STAT_REG_TIM_IS_DOWN_Msk (0x100UL)              /*!< TIM_IS_DOWN (Bitfield-Mask: 0x01)                     */
#define CRG_TOP_SYS_STAT_REG_MEM_IS_UP_Pos (7UL)                    /*!< MEM_IS_UP (Bit 7)                                     */
#define CRG_TOP_SYS_STAT_REG_MEM_IS_UP_Msk (0x80UL)                 /*!< MEM_IS_UP (Bitfield-Mask: 0x01)                       */
#define CRG_TOP_SYS_STAT_REG_MEM_IS_DOWN_Pos (6UL)                  /*!< MEM_IS_DOWN (Bit 6)                                   */
#define CRG_TOP_SYS_STAT_REG_MEM_IS_DOWN_Msk (0x40UL)               /*!< MEM_IS_DOWN (Bitfield-Mask: 0x01)                     */
#define CRG_TOP_SYS_STAT_REG_SYS_IS_UP_Pos (5UL)                    /*!< SYS_IS_UP (Bit 5)                                     */
#define CRG_TOP_SYS_STAT_REG_SYS_IS_UP_Msk (0x20UL)                 /*!< SYS_IS_UP (Bitfield-Mask: 0x01)                       */
#define CRG_TOP_SYS_STAT_REG_SYS_IS_DOWN_Pos (4UL)                  /*!< SYS_IS_DOWN (Bit 4)                                   */
#define CRG_TOP_SYS_STAT_REG_SYS_IS_DOWN_Msk (0x10UL)               /*!< SYS_IS_DOWN (Bitfield-Mask: 0x01)                     */
#define CRG_TOP_SYS_STAT_REG_PER_IS_UP_Pos (3UL)                    /*!< PER_IS_UP (Bit 3)                                     */
#define CRG_TOP_SYS_STAT_REG_PER_IS_UP_Msk (0x8UL)                  /*!< PER_IS_UP (Bitfield-Mask: 0x01)                       */
#define CRG_TOP_SYS_STAT_REG_PER_IS_DOWN_Pos (2UL)                  /*!< PER_IS_DOWN (Bit 2)                                   */
#define CRG_TOP_SYS_STAT_REG_PER_IS_DOWN_Msk (0x4UL)                /*!< PER_IS_DOWN (Bitfield-Mask: 0x01)                     */
#define CRG_TOP_SYS_STAT_REG_RAD_IS_UP_Pos (1UL)                    /*!< RAD_IS_UP (Bit 1)                                     */
#define CRG_TOP_SYS_STAT_REG_RAD_IS_UP_Msk (0x2UL)                  /*!< RAD_IS_UP (Bitfield-Mask: 0x01)                       */
#define CRG_TOP_SYS_STAT_REG_RAD_IS_DOWN_Pos (0UL)                  /*!< RAD_IS_DOWN (Bit 0)                                   */
#define CRG_TOP_SYS_STAT_REG_RAD_IS_DOWN_Msk (0x1UL)                /*!< RAD_IS_DOWN (Bitfield-Mask: 0x01)                     */


/* =========================================================================================================================== */
/* ================                                         CRG_XTAL                                          ================ */
/* =========================================================================================================================== */

