dianyundou/DA14592BLE_CSL/CSL-59x_10.679.2.17/sdk/bsp/include/DA1459x-00.h
/* ===================================================  CLKDBLR_CTRL1_REG  =================================================== */
#define CRG_XTAL_CLKDBLR_CTRL1_REG_DELAY_TDC_OVR_Pos (17UL)         /*!< DELAY_TDC_OVR (Bit 17)                                */
#define CRG_XTAL_CLKDBLR_CTRL1_REG_DELAY_TDC_OVR_Msk (0x7e0000UL)   /*!< DELAY_TDC_OVR (Bitfield-Mask: 0x3f)                   */
#define CRG_XTAL_CLKDBLR_CTRL1_REG_DELAY_64M_PRE_OVR_Pos (12UL)     /*!< DELAY_64M_PRE_OVR (Bit 12)                            */
#define CRG_XTAL_CLKDBLR_CTRL1_REG_DELAY_64M_PRE_OVR_Msk (0x1f000UL) /*!< DELAY_64M_PRE_OVR (Bitfield-Mask: 0x1f)              */
#define CRG_XTAL_CLKDBLR_CTRL1_REG_DELAY_64M_OVR_Pos (8UL)          /*!< DELAY_64M_OVR (Bit 8)                                 */
#define CRG_XTAL_CLKDBLR_CTRL1_REG_DELAY_64M_OVR_Msk (0xf00UL)      /*!< DELAY_64M_OVR (Bitfield-Mask: 0x0f)                   */
#define CRG_XTAL_CLKDBLR_CTRL1_REG_DELAY_32M_OVR_Pos (3UL)          /*!< DELAY_32M_OVR (Bit 3)                                 */
#define CRG_XTAL_CLKDBLR_CTRL1_REG_DELAY_32M_OVR_Msk (0xf8UL)       /*!< DELAY_32M_OVR (Bitfield-Mask: 0x1f)                   */
#define CRG_XTAL_CLKDBLR_CTRL1_REG_OVERRIDE_Pos (2UL)               /*!< OVERRIDE (Bit 2)                                      */
#define CRG_XTAL_CLKDBLR_CTRL1_REG_OVERRIDE_Msk (0x4UL)             /*!< OVERRIDE (Bitfield-Mask: 0x01)                        */
#define CRG_XTAL_CLKDBLR_CTRL1_REG_ENABLE_Pos (1UL)                 /*!< ENABLE (Bit 1)                                        */
#define CRG_XTAL_CLKDBLR_CTRL1_REG_ENABLE_Msk (0x2UL)               /*!< ENABLE (Bitfield-Mask: 0x01)                          */
#define CRG_XTAL_CLKDBLR_CTRL1_REG_RESET_N_Pos (0UL)                /*!< RESET_N (Bit 0)                                       */
#define CRG_XTAL_CLKDBLR_CTRL1_REG_RESET_N_Msk (0x1UL)              /*!< RESET_N (Bitfield-Mask: 0x01)                         */
/* ===================================================  CLKDBLR_CTRL2_REG  =================================================== */
#define CRG_XTAL_CLKDBLR_CTRL2_REG_DELAY_64M_PRE_OFFSET_Pos (14UL)  /*!< DELAY_64M_PRE_OFFSET (Bit 14)                         */
#define CRG_XTAL_CLKDBLR_CTRL2_REG_DELAY_64M_PRE_OFFSET_Msk (0xc000UL) /*!< DELAY_64M_PRE_OFFSET (Bitfield-Mask: 0x03)         */
#define CRG_XTAL_CLKDBLR_CTRL2_REG_PRELOAD_Pos (13UL)               /*!< PRELOAD (Bit 13)                                      */
#define CRG_XTAL_CLKDBLR_CTRL2_REG_PRELOAD_Msk (0x2000UL)           /*!< PRELOAD (Bitfield-Mask: 0x01)                         */
#define CRG_XTAL_CLKDBLR_CTRL2_REG_INV_CLK_Pos (12UL)               /*!< INV_CLK (Bit 12)                                      */
#define CRG_XTAL_CLKDBLR_CTRL2_REG_INV_CLK_Msk (0x1000UL)           /*!< INV_CLK (Bitfield-Mask: 0x01)                         */
#define CRG_XTAL_CLKDBLR_CTRL2_REG_DUTY_CYCLE_CORR_COUNT_Pos (8UL)  /*!< DUTY_CYCLE_CORR_COUNT (Bit 8)                         */
#define CRG_XTAL_CLKDBLR_CTRL2_REG_DUTY_CYCLE_CORR_COUNT_Msk (0xf00UL) /*!< DUTY_CYCLE_CORR_COUNT (Bitfield-Mask: 0x0f)        */
#define CRG_XTAL_CLKDBLR_CTRL2_REG_LOW_POWER_OVR_Pos (7UL)          /*!< LOW_POWER_OVR (Bit 7)                                 */
#define CRG_XTAL_CLKDBLR_CTRL2_REG_LOW_POWER_OVR_Msk (0x80UL)       /*!< LOW_POWER_OVR (Bitfield-Mask: 0x01)                   */
#define CRG_XTAL_CLKDBLR_CTRL2_REG_EN_ADJ_32M_OVR_Pos (6UL)         /*!< EN_ADJ_32M_OVR (Bit 6)                                */
#define CRG_XTAL_CLKDBLR_CTRL2_REG_EN_ADJ_32M_OVR_Msk (0x40UL)      /*!< EN_ADJ_32M_OVR (Bitfield-Mask: 0x01)                  */
#define CRG_XTAL_CLKDBLR_CTRL2_REG_EN_ADJ_64M_OVR_Pos (5UL)         /*!< EN_ADJ_64M_OVR (Bit 5)                                */
#define CRG_XTAL_CLKDBLR_CTRL2_REG_EN_ADJ_64M_OVR_Msk (0x20UL)      /*!< EN_ADJ_64M_OVR (Bitfield-Mask: 0x01)                  */
#define CRG_XTAL_CLKDBLR_CTRL2_REG_EN_TDC_OVR_Pos (4UL)             /*!< EN_TDC_OVR (Bit 4)                                    */
#define CRG_XTAL_CLKDBLR_CTRL2_REG_EN_TDC_OVR_Msk (0x10UL)          /*!< EN_TDC_OVR (Bitfield-Mask: 0x01)                      */
#define CRG_XTAL_CLKDBLR_CTRL2_REG_PHASE_INV_32M_OVR_Pos (3UL)      /*!< PHASE_INV_32M_OVR (Bit 3)                             */
#define CRG_XTAL_CLKDBLR_CTRL2_REG_PHASE_INV_32M_OVR_Msk (0x8UL)    /*!< PHASE_INV_32M_OVR (Bitfield-Mask: 0x01)               */
#define CRG_XTAL_CLKDBLR_CTRL2_REG_SEL_32M_64M_CLK_OVR_Pos (2UL)    /*!< SEL_32M_64M_CLK_OVR (Bit 2)                           */
#define CRG_XTAL_CLKDBLR_CTRL2_REG_SEL_32M_64M_CLK_OVR_Msk (0x4UL)  /*!< SEL_32M_64M_CLK_OVR (Bitfield-Mask: 0x01)             */
#define CRG_XTAL_CLKDBLR_CTRL2_REG_TDC_CLK_INV_OVR_Pos (1UL)        /*!< TDC_CLK_INV_OVR (Bit 1)                               */
#define CRG_XTAL_CLKDBLR_CTRL2_REG_TDC_CLK_INV_OVR_Msk (0x2UL)      /*!< TDC_CLK_INV_OVR (Bitfield-Mask: 0x01)                 */
#define CRG_XTAL_CLKDBLR_CTRL2_REG_OUTPUT_ENABLE_OVR_Pos (0UL)      /*!< OUTPUT_ENABLE_OVR (Bit 0)                             */
#define CRG_XTAL_CLKDBLR_CTRL2_REG_OUTPUT_ENABLE_OVR_Msk (0x1UL)    /*!< OUTPUT_ENABLE_OVR (Bitfield-Mask: 0x01)               */
/* ==================================================  CLKDBLR_STATUS_REG  =================================================== */
#define CRG_XTAL_CLKDBLR_STATUS_REG_PHASE_INV_32M_Pos (31UL)        /*!< PHASE_INV_32M (Bit 31)                                */
#define CRG_XTAL_CLKDBLR_STATUS_REG_PHASE_INV_32M_Msk (0x80000000UL) /*!< PHASE_INV_32M (Bitfield-Mask: 0x01)                  */
#define CRG_XTAL_CLKDBLR_STATUS_REG_CLKDBLR_STATE_Pos (26UL)        /*!< CLKDBLR_STATE (Bit 26)                                */
#define CRG_XTAL_CLKDBLR_STATUS_REG_CLKDBLR_STATE_Msk (0x7c000000UL) /*!< CLKDBLR_STATE (Bitfield-Mask: 0x1f)                  */
#define CRG_XTAL_CLKDBLR_STATUS_REG_OUTPUT_READY_Pos (25UL)         /*!< OUTPUT_READY (Bit 25)                                 */
#define CRG_XTAL_CLKDBLR_STATUS_REG_OUTPUT_READY_Msk (0x2000000UL)  /*!< OUTPUT_READY (Bitfield-Mask: 0x01)                    */
#define CRG_XTAL_CLKDBLR_STATUS_REG_TDC_BIN_OUT_Pos (20UL)          /*!< TDC_BIN_OUT (Bit 20)                                  */
#define CRG_XTAL_CLKDBLR_STATUS_REG_TDC_BIN_OUT_Msk (0x1f00000UL)   /*!< TDC_BIN_OUT (Bitfield-Mask: 0x1f)                     */
#define CRG_XTAL_CLKDBLR_STATUS_REG_DELAY_TDC_OUT_Pos (14UL)        /*!< DELAY_TDC_OUT (Bit 14)                                */
#define CRG_XTAL_CLKDBLR_STATUS_REG_DELAY_TDC_OUT_Msk (0xfc000UL)   /*!< DELAY_TDC_OUT (Bitfield-Mask: 0x3f)                   */
#define CRG_XTAL_CLKDBLR_STATUS_REG_DELAY_64M_PRE_OUT_Pos (9UL)     /*!< DELAY_64M_PRE_OUT (Bit 9)                             */
#define CRG_XTAL_CLKDBLR_STATUS_REG_DELAY_64M_PRE_OUT_Msk (0x3e00UL) /*!< DELAY_64M_PRE_OUT (Bitfield-Mask: 0x1f)              */
#define CRG_XTAL_CLKDBLR_STATUS_REG_DELAY_64M_OUT_Pos (5UL)         /*!< DELAY_64M_OUT (Bit 5)                                 */
#define CRG_XTAL_CLKDBLR_STATUS_REG_DELAY_64M_OUT_Msk (0x1e0UL)     /*!< DELAY_64M_OUT (Bitfield-Mask: 0x0f)                   */
#define CRG_XTAL_CLKDBLR_STATUS_REG_DELAY_32M_OUT_Pos (0UL)         /*!< DELAY_32M_OUT (Bit 0)                                 */
#define CRG_XTAL_CLKDBLR_STATUS_REG_DELAY_32M_OUT_Msk (0x1fUL)      /*!< DELAY_32M_OUT (Bitfield-Mask: 0x1f)                   */
/* =================================================  XTAL32M_CAP_MEAS_REG  ================================================== */
#define CRG_XTAL_XTAL32M_CAP_MEAS_REG_XTAL32M_MEAS_TIME_Pos (6UL)   /*!< XTAL32M_MEAS_TIME (Bit 6)                             */
#define CRG_XTAL_XTAL32M_CAP_MEAS_REG_XTAL32M_MEAS_TIME_Msk (0x1c0UL) /*!< XTAL32M_MEAS_TIME (Bitfield-Mask: 0x07)             */
#define CRG_XTAL_XTAL32M_CAP_MEAS_REG_XTAL32M_MEAS_START_Pos (5UL)  /*!< XTAL32M_MEAS_START (Bit 5)                            */
#define CRG_XTAL_XTAL32M_CAP_MEAS_REG_XTAL32M_MEAS_START_Msk (0x20UL) /*!< XTAL32M_MEAS_START (Bitfield-Mask: 0x01)            */
#define CRG_XTAL_XTAL32M_CAP_MEAS_REG_XTAL32M_MEAS_CUR_Pos (3UL)    /*!< XTAL32M_MEAS_CUR (Bit 3)                              */
#define CRG_XTAL_XTAL32M_CAP_MEAS_REG_XTAL32M_MEAS_CUR_Msk (0x18UL) /*!< XTAL32M_MEAS_CUR (Bitfield-Mask: 0x03)                */
#define CRG_XTAL_XTAL32M_CAP_MEAS_REG_XTAL32M_CAP_SELECT_Pos (0UL)  /*!< XTAL32M_CAP_SELECT (Bit 0)                            */
#define CRG_XTAL_XTAL32M_CAP_MEAS_REG_XTAL32M_CAP_SELECT_Msk (0x7UL) /*!< XTAL32M_CAP_SELECT (Bitfield-Mask: 0x07)             */
/* ===================================================  XTAL32M_CTRL_REG  ==================================================== */
#define CRG_XTAL_XTAL32M_CTRL_REG_XTAL32M_ENABLE_Pos (8UL)          /*!< XTAL32M_ENABLE (Bit 8)                                */
#define CRG_XTAL_XTAL32M_CTRL_REG_XTAL32M_ENABLE_Msk (0x100UL)      /*!< XTAL32M_ENABLE (Bitfield-Mask: 0x01)                  */
#define CRG_XTAL_XTAL32M_CTRL_REG_XTAL32M_BIASPROT_Pos (6UL)        /*!< XTAL32M_BIASPROT (Bit 6)                              */
#define CRG_XTAL_XTAL32M_CTRL_REG_XTAL32M_BIASPROT_Msk (0xc0UL)     /*!< XTAL32M_BIASPROT (Bitfield-Mask: 0x03)                */
#define CRG_XTAL_XTAL32M_CTRL_REG_XTAL32M_LDO_SAH_Pos (4UL)         /*!< XTAL32M_LDO_SAH (Bit 4)                               */
#define CRG_XTAL_XTAL32M_CTRL_REG_XTAL32M_LDO_SAH_Msk (0x30UL)      /*!< XTAL32M_LDO_SAH (Bitfield-Mask: 0x03)                 */
#define CRG_XTAL_XTAL32M_CTRL_REG_XTAL32M_AMPREG_SAH_Pos (2UL)      /*!< XTAL32M_AMPREG_SAH (Bit 2)                            */
#define CRG_XTAL_XTAL32M_CTRL_REG_XTAL32M_AMPREG_SAH_Msk (0xcUL)    /*!< XTAL32M_AMPREG_SAH (Bitfield-Mask: 0x03)              */
#define CRG_XTAL_XTAL32M_CTRL_REG_XTAL32M_BIAS_SAH_Pos (0UL)        /*!< XTAL32M_BIAS_SAH (Bit 0)                              */
#define CRG_XTAL_XTAL32M_CTRL_REG_XTAL32M_BIAS_SAH_Msk (0x3UL)      /*!< XTAL32M_BIAS_SAH (Bitfield-Mask: 0x03)                */
/* ====================================================  XTAL32M_FSM_REG  ==================================================== */
#define CRG_XTAL_XTAL32M_FSM_REG_XTAL32M_FSM_APPLY_CONFIG_Pos (4UL) /*!< XTAL32M_FSM_APPLY_CONFIG (Bit 4)                      */
#define CRG_XTAL_XTAL32M_FSM_REG_XTAL32M_FSM_APPLY_CONFIG_Msk (0x10UL) /*!< XTAL32M_FSM_APPLY_CONFIG (Bitfield-Mask: 0x01)     */
#define CRG_XTAL_XTAL32M_FSM_REG_XTAL32M_FSM_FORCE_IDLE_Pos (3UL)   /*!< XTAL32M_FSM_FORCE_IDLE (Bit 3)                        */
#define CRG_XTAL_XTAL32M_FSM_REG_XTAL32M_FSM_FORCE_IDLE_Msk (0x8UL) /*!< XTAL32M_FSM_FORCE_IDLE (Bitfield-Mask: 0x01)          */
#define CRG_XTAL_XTAL32M_FSM_REG_XTAL32M_CMP_MODE_Pos (2UL)         /*!< XTAL32M_CMP_MODE (Bit 2)                              */
#define CRG_XTAL_XTAL32M_FSM_REG_XTAL32M_CMP_MODE_Msk (0x4UL)       /*!< XTAL32M_CMP_MODE (Bitfield-Mask: 0x01)                */
#define CRG_XTAL_XTAL32M_FSM_REG_XTAL32M_TRIM_MODE_Pos (1UL)        /*!< XTAL32M_TRIM_MODE (Bit 1)                             */
#define CRG_XTAL_XTAL32M_FSM_REG_XTAL32M_TRIM_MODE_Msk (0x2UL)      /*!< XTAL32M_TRIM_MODE (Bitfield-Mask: 0x01)               */
#define CRG_XTAL_XTAL32M_FSM_REG_XTAL32M_CUR_MODE_Pos (0UL)         /*!< XTAL32M_CUR_MODE (Bit 0)                              */
#define CRG_XTAL_XTAL32M_FSM_REG_XTAL32M_CUR_MODE_Msk (0x1UL)       /*!< XTAL32M_CUR_MODE (Bitfield-Mask: 0x01)                */
/* =================================================  XTAL32M_IRQ_CTRL_REG  ================================================== */
#define CRG_XTAL_XTAL32M_IRQ_CTRL_REG_XTAL32M_IRQ_CAP_CTRL_Pos (10UL) /*!< XTAL32M_IRQ_CAP_CTRL (Bit 10)                       */
#define CRG_XTAL_XTAL32M_IRQ_CTRL_REG_XTAL32M_IRQ_CAP_CTRL_Msk (0xc00UL) /*!< XTAL32M_IRQ_CAP_CTRL (Bitfield-Mask: 0x03)       */
#define CRG_XTAL_XTAL32M_IRQ_CTRL_REG_XTAL32M_IRQ_ENABLE_Pos (9UL)  /*!< XTAL32M_IRQ_ENABLE (Bit 9)                            */
#define CRG_XTAL_XTAL32M_IRQ_CTRL_REG_XTAL32M_IRQ_ENABLE_Msk (0x200UL) /*!< XTAL32M_IRQ_ENABLE (Bitfield-Mask: 0x01)           */
#define CRG_XTAL_XTAL32M_IRQ_CTRL_REG_XTAL32M_IRQ_CLK_Pos (8UL)     /*!< XTAL32M_IRQ_CLK (Bit 8)                               */
#define CRG_XTAL_XTAL32M_IRQ_CTRL_REG_XTAL32M_IRQ_CLK_Msk (0x100UL) /*!< XTAL32M_IRQ_CLK (Bitfield-Mask: 0x01)                 */
#define CRG_XTAL_XTAL32M_IRQ_CTRL_REG_XTAL32M_IRQ_CNT_Pos (0UL)     /*!< XTAL32M_IRQ_CNT (Bit 0)                               */
#define CRG_XTAL_XTAL32M_IRQ_CTRL_REG_XTAL32M_IRQ_CNT_Msk (0xffUL)  /*!< XTAL32M_IRQ_CNT (Bitfield-Mask: 0xff)                 */
/* =================================================  XTAL32M_IRQ_STAT_REG  ================================================== */
#define CRG_XTAL_XTAL32M_IRQ_STAT_REG_XTAL32M_IRQ_COUNT_CAP_Pos (8UL) /*!< XTAL32M_IRQ_COUNT_CAP (Bit 8)                       */
#define CRG_XTAL_XTAL32M_IRQ_STAT_REG_XTAL32M_IRQ_COUNT_CAP_Msk (0xff00UL) /*!< XTAL32M_IRQ_COUNT_CAP (Bitfield-Mask: 0xff)    */
#define CRG_XTAL_XTAL32M_IRQ_STAT_REG_XTAL32M_IRQ_COUNT_STAT_Pos (0UL) /*!< XTAL32M_IRQ_COUNT_STAT (Bit 0)                     */
#define CRG_XTAL_XTAL32M_IRQ_STAT_REG_XTAL32M_IRQ_COUNT_STAT_Msk (0xffUL) /*!< XTAL32M_IRQ_COUNT_STAT (Bitfield-Mask: 0xff)    */
/* ==================================================  XTAL32M_SETTLE_REG  =================================================== */
#define CRG_XTAL_XTAL32M_SETTLE_REG_XTAL32M_TIMEOUT_Pos (20UL)      /*!< XTAL32M_TIMEOUT (Bit 20)                              */
#define CRG_XTAL_XTAL32M_SETTLE_REG_XTAL32M_TIMEOUT_Msk (0x7f00000UL) /*!< XTAL32M_TIMEOUT (Bitfield-Mask: 0x7f)               */
#define CRG_XTAL_XTAL32M_SETTLE_REG_XTAL32M_CMP_BLANK_Pos (17UL)    /*!< XTAL32M_CMP_BLANK (Bit 17)                            */
#define CRG_XTAL_XTAL32M_SETTLE_REG_XTAL32M_CMP_BLANK_Msk (0xe0000UL) /*!< XTAL32M_CMP_BLANK (Bitfield-Mask: 0x07)             */
#define CRG_XTAL_XTAL32M_SETTLE_REG_XTAL32M_CMP_LVL_Pos (15UL)      /*!< XTAL32M_CMP_LVL (Bit 15)                              */
#define CRG_XTAL_XTAL32M_SETTLE_REG_XTAL32M_CMP_LVL_Msk (0x18000UL) /*!< XTAL32M_CMP_LVL (Bitfield-Mask: 0x03)                 */
#define CRG_XTAL_XTAL32M_SETTLE_REG_XTAL32M_AMPL_SET_Pos (12UL)     /*!< XTAL32M_AMPL_SET (Bit 12)                             */
#define CRG_XTAL_XTAL32M_SETTLE_REG_XTAL32M_AMPL_SET_Msk (0x7000UL) /*!< XTAL32M_AMPL_SET (Bitfield-Mask: 0x07)                */
#define CRG_XTAL_XTAL32M_SETTLE_REG_XTAL32M_CUR_SET_Pos (8UL)       /*!< XTAL32M_CUR_SET (Bit 8)                               */
#define CRG_XTAL_XTAL32M_SETTLE_REG_XTAL32M_CUR_SET_Msk (0xf00UL)   /*!< XTAL32M_CUR_SET (Bitfield-Mask: 0x0f)                 */
#define CRG_XTAL_XTAL32M_SETTLE_REG_XTAL32M_TRIM_Pos (0UL)          /*!< XTAL32M_TRIM (Bit 0)                                  */
#define CRG_XTAL_XTAL32M_SETTLE_REG_XTAL32M_TRIM_Msk (0xffUL)       /*!< XTAL32M_TRIM (Bitfield-Mask: 0xff)                    */
/* ===================================================  XTAL32M_START_REG  =================================================== */
#define CRG_XTAL_XTAL32M_START_REG_XTAL32M_TIMEOUT_Pos (20UL)       /*!< XTAL32M_TIMEOUT (Bit 20)                              */
#define CRG_XTAL_XTAL32M_START_REG_XTAL32M_TIMEOUT_Msk (0x7f00000UL) /*!< XTAL32M_TIMEOUT (Bitfield-Mask: 0x7f)                */
#define CRG_XTAL_XTAL32M_START_REG_XTAL32M_CMP_BLANK_Pos (17UL)     /*!< XTAL32M_CMP_BLANK (Bit 17)                            */
#define CRG_XTAL_XTAL32M_START_REG_XTAL32M_CMP_BLANK_Msk (0xe0000UL) /*!< XTAL32M_CMP_BLANK (Bitfield-Mask: 0x07)              */
#define CRG_XTAL_XTAL32M_START_REG_XTAL32M_CMP_LVL_Pos (15UL)       /*!< XTAL32M_CMP_LVL (Bit 15)                              */
#define CRG_XTAL_XTAL32M_START_REG_XTAL32M_CMP_LVL_Msk (0x18000UL)  /*!< XTAL32M_CMP_LVL (Bitfield-Mask: 0x03)                 */
#define CRG_XTAL_XTAL32M_START_REG_XTAL32M_AMPL_SET_Pos (12UL)      /*!< XTAL32M_AMPL_SET (Bit 12)                             */
#define CRG_XTAL_XTAL32M_START_REG_XTAL32M_AMPL_SET_Msk (0x7000UL)  /*!< XTAL32M_AMPL_SET (Bitfield-Mask: 0x07)                */
#define CRG_XTAL_XTAL32M_START_REG_XTAL32M_CUR_SET_Pos (8UL)        /*!< XTAL32M_CUR_SET (Bit 8)                               */
#define CRG_XTAL_XTAL32M_START_REG_XTAL32M_CUR_SET_Msk (0xf00UL)    /*!< XTAL32M_CUR_SET (Bitfield-Mask: 0x0f)                 */
#define CRG_XTAL_XTAL32M_START_REG_XTAL32M_TRIM_Pos (0UL)           /*!< XTAL32M_TRIM (Bit 0)                                  */
#define CRG_XTAL_XTAL32M_START_REG_XTAL32M_TRIM_Msk (0xffUL)        /*!< XTAL32M_TRIM (Bitfield-Mask: 0xff)                    */
/* ===================================================  XTAL32M_STAT0_REG  =================================================== */
#define CRG_XTAL_XTAL32M_STAT0_REG_XTAL32M_TRIM_VAL_Pos (11UL)      /*!< XTAL32M_TRIM_VAL (Bit 11)                             */
#define CRG_XTAL_XTAL32M_STAT0_REG_XTAL32M_TRIM_VAL_Msk (0x7f800UL) /*!< XTAL32M_TRIM_VAL (Bitfield-Mask: 0xff)                */
#define CRG_XTAL_XTAL32M_STAT0_REG_XTAL32M_CUR_SET_STAT_Pos (7UL)   /*!< XTAL32M_CUR_SET_STAT (Bit 7)                          */
#define CRG_XTAL_XTAL32M_STAT0_REG_XTAL32M_CUR_SET_STAT_Msk (0x780UL) /*!< XTAL32M_CUR_SET_STAT (Bitfield-Mask: 0x0f)          */
#define CRG_XTAL_XTAL32M_STAT0_REG_XTAL32M_LDO_OK_Pos (6UL)         /*!< XTAL32M_LDO_OK (Bit 6)                                */
#define CRG_XTAL_XTAL32M_STAT0_REG_XTAL32M_LDO_OK_Msk (0x40UL)      /*!< XTAL32M_LDO_OK (Bitfield-Mask: 0x01)                  */
#define CRG_XTAL_XTAL32M_STAT0_REG_XTAL32M_CMP_OUT_Pos (5UL)        /*!< XTAL32M_CMP_OUT (Bit 5)                               */
#define CRG_XTAL_XTAL32M_STAT0_REG_XTAL32M_CMP_OUT_Msk (0x20UL)     /*!< XTAL32M_CMP_OUT (Bitfield-Mask: 0x01)                 */
#define CRG_XTAL_XTAL32M_STAT0_REG_XTAL32M_STATE_Pos (1UL)          /*!< XTAL32M_STATE (Bit 1)                                 */
#define CRG_XTAL_XTAL32M_STAT0_REG_XTAL32M_STATE_Msk (0x1eUL)       /*!< XTAL32M_STATE (Bitfield-Mask: 0x0f)                   */
#define CRG_XTAL_XTAL32M_STAT0_REG_XTAL32M_READY_Pos (0UL)          /*!< XTAL32M_READY (Bit 0)                                 */
#define CRG_XTAL_XTAL32M_STAT0_REG_XTAL32M_READY_Msk (0x1UL)        /*!< XTAL32M_READY (Bitfield-Mask: 0x01)                   */
/* ===================================================  XTAL32M_TRIM_REG  ==================================================== */
#define CRG_XTAL_XTAL32M_TRIM_REG_XTAL32M_CMP_LVL_Pos (15UL)        /*!< XTAL32M_CMP_LVL (Bit 15)                              */
#define CRG_XTAL_XTAL32M_TRIM_REG_XTAL32M_CMP_LVL_Msk (0x18000UL)   /*!< XTAL32M_CMP_LVL (Bitfield-Mask: 0x03)                 */
#define CRG_XTAL_XTAL32M_TRIM_REG_XTAL32M_AMPL_SET_Pos (12UL)       /*!< XTAL32M_AMPL_SET (Bit 12)                             */
#define CRG_XTAL_XTAL32M_TRIM_REG_XTAL32M_AMPL_SET_Msk (0x7000UL)   /*!< XTAL32M_AMPL_SET (Bitfield-Mask: 0x07)                */
#define CRG_XTAL_XTAL32M_TRIM_REG_XTAL32M_CUR_SET_Pos (8UL)         /*!< XTAL32M_CUR_SET (Bit 8)                               */
#define CRG_XTAL_XTAL32M_TRIM_REG_XTAL32M_CUR_SET_Msk (0xf00UL)     /*!< XTAL32M_CUR_SET (Bitfield-Mask: 0x0f)                 */
#define CRG_XTAL_XTAL32M_TRIM_REG_XTAL32M_TRIM_Pos (0UL)            /*!< XTAL32M_TRIM (Bit 0)                                  */
#define CRG_XTAL_XTAL32M_TRIM_REG_XTAL32M_TRIM_Msk (0xffUL)         /*!< XTAL32M_TRIM (Bitfield-Mask: 0xff)                    */


/* =========================================================================================================================== */
/* ================                                           DCDC                                            ================ */
/* =========================================================================================================================== */

