dianyundou/DA14592BLE_CSL/CSL-59x_10.679.2.17/sdk/bsp/include/DA1459x-00.h
/* ===================================================  AHB_DMA_CCLM1_REG  =================================================== */
#define DW_AHB_DMA_CCLM1_REG_AHB_DMA_CCLM_Pos (0UL)                 /*!< AHB_DMA_CCLM (Bit 0)                                  */
#define DW_AHB_DMA_CCLM1_REG_AHB_DMA_CCLM_Msk (0xffffUL)            /*!< AHB_DMA_CCLM (Bitfield-Mask: 0xffff)                  */
/* ===================================================  AHB_DMA_CCLM2_REG  =================================================== */
#define DW_AHB_DMA_CCLM2_REG_AHB_DMA_CCLM_Pos (0UL)                 /*!< AHB_DMA_CCLM (Bit 0)                                  */
#define DW_AHB_DMA_CCLM2_REG_AHB_DMA_CCLM_Msk (0xffffUL)            /*!< AHB_DMA_CCLM (Bitfield-Mask: 0xffff)                  */
/* ===================================================  AHB_DMA_CCLM3_REG  =================================================== */
#define DW_AHB_DMA_CCLM3_REG_AHB_DMA_CCLM_Pos (0UL)                 /*!< AHB_DMA_CCLM (Bit 0)                                  */
#define DW_AHB_DMA_CCLM3_REG_AHB_DMA_CCLM_Msk (0xffffUL)            /*!< AHB_DMA_CCLM (Bitfield-Mask: 0xffff)                  */
/* ===================================================  AHB_DMA_CCLM4_REG  =================================================== */
#define DW_AHB_DMA_CCLM4_REG_AHB_DMA_CCLM_Pos (0UL)                 /*!< AHB_DMA_CCLM (Bit 0)                                  */
#define DW_AHB_DMA_CCLM4_REG_AHB_DMA_CCLM_Msk (0xffffUL)            /*!< AHB_DMA_CCLM (Bitfield-Mask: 0xffff)                  */
/* ================================================  AHB_DMA_DFLT_MASTER_REG  ================================================ */
#define DW_AHB_DMA_DFLT_MASTER_REG_AHB_DMA_DFLT_MASTER_Pos (0UL)    /*!< AHB_DMA_DFLT_MASTER (Bit 0)                           */
#define DW_AHB_DMA_DFLT_MASTER_REG_AHB_DMA_DFLT_MASTER_Msk (0xfUL)  /*!< AHB_DMA_DFLT_MASTER (Bitfield-Mask: 0x0f)             */
/* ====================================================  AHB_DMA_PL1_REG  ==================================================== */
#define DW_AHB_DMA_PL1_REG_AHB_DMA_PL1_Pos (0UL)                    /*!< AHB_DMA_PL1 (Bit 0)                                   */
#define DW_AHB_DMA_PL1_REG_AHB_DMA_PL1_Msk (0xfUL)                  /*!< AHB_DMA_PL1 (Bitfield-Mask: 0x0f)                     */
/* ====================================================  AHB_DMA_PL2_REG  ==================================================== */
#define DW_AHB_DMA_PL2_REG_AHB_DMA_PL2_Pos (0UL)                    /*!< AHB_DMA_PL2 (Bit 0)                                   */
#define DW_AHB_DMA_PL2_REG_AHB_DMA_PL2_Msk (0xfUL)                  /*!< AHB_DMA_PL2 (Bitfield-Mask: 0x0f)                     */
/* ====================================================  AHB_DMA_PL3_REG  ==================================================== */
#define DW_AHB_DMA_PL3_REG_AHB_DMA_PL3_Pos (0UL)                    /*!< AHB_DMA_PL3 (Bit 0)                                   */
#define DW_AHB_DMA_PL3_REG_AHB_DMA_PL3_Msk (0xfUL)                  /*!< AHB_DMA_PL3 (Bitfield-Mask: 0x0f)                     */
/* ====================================================  AHB_DMA_PL4_REG  ==================================================== */
#define DW_AHB_DMA_PL4_REG_AHB_DMA_PL4_Pos (0UL)                    /*!< AHB_DMA_PL4 (Bit 0)                                   */
#define DW_AHB_DMA_PL4_REG_AHB_DMA_PL4_Msk (0xfUL)                  /*!< AHB_DMA_PL4 (Bitfield-Mask: 0x0f)                     */
/* ====================================================  AHB_DMA_TCL_REG  ==================================================== */
#define DW_AHB_DMA_TCL_REG_AHB_DMA_TCL_Pos (0UL)                    /*!< AHB_DMA_TCL (Bit 0)                                   */
#define DW_AHB_DMA_TCL_REG_AHB_DMA_TCL_Msk (0xffffUL)               /*!< AHB_DMA_TCL (Bitfield-Mask: 0xffff)                   */
/* ==================================================  AHB_DMA_VERSION_REG  ================================================== */
#define DW_AHB_DMA_VERSION_REG_AHB_DMA_VERSION_Pos (0UL)            /*!< AHB_DMA_VERSION (Bit 0)                               */
#define DW_AHB_DMA_VERSION_REG_AHB_DMA_VERSION_Msk (0xffffffffUL)   /*!< AHB_DMA_VERSION (Bitfield-Mask: 0xffffffff)           */
/* ===================================================  AHB_DMA_WTEN_REG  ==================================================== */
#define DW_AHB_DMA_WTEN_REG_AHB_DMA_WTEN_Pos (0UL)                  /*!< AHB_DMA_WTEN (Bit 0)                                  */
#define DW_AHB_DMA_WTEN_REG_AHB_DMA_WTEN_Msk (0x1UL)                /*!< AHB_DMA_WTEN (Bitfield-Mask: 0x01)                    */


/* =========================================================================================================================== */
/* ================                                            FCU                                            ================ */
/* =========================================================================================================================== */

/* ====================================================  FLASH_CTRL_REG  ===================================================== */
#define FCU_FLASH_CTRL_REG_DISCHARGE_STAT_Pos (25UL)                /*!< DISCHARGE_STAT (Bit 25)                               */
#define FCU_FLASH_CTRL_REG_DISCHARGE_STAT_Msk (0x2000000UL)         /*!< DISCHARGE_STAT (Bitfield-Mask: 0x01)                  */
#define FCU_FLASH_CTRL_REG_DFT_EN_Pos     (24UL)                    /*!< DFT_EN (Bit 24)                                       */
#define FCU_FLASH_CTRL_REG_DFT_EN_Msk     (0x1000000UL)             /*!< DFT_EN (Bitfield-Mask: 0x01)                          */
#define FCU_FLASH_CTRL_REG_VDD_LEVEL_VALUE_Pos (23UL)               /*!< VDD_LEVEL_VALUE (Bit 23)                              */
#define FCU_FLASH_CTRL_REG_VDD_LEVEL_VALUE_Msk (0x800000UL)         /*!< VDD_LEVEL_VALUE (Bitfield-Mask: 0x01)                 */
#define FCU_FLASH_CTRL_REG_VDD_LEVEL_FORCE_Pos (22UL)               /*!< VDD_LEVEL_FORCE (Bit 22)                              */
#define FCU_FLASH_CTRL_REG_VDD_LEVEL_FORCE_Msk (0x400000UL)         /*!< VDD_LEVEL_FORCE (Bitfield-Mask: 0x01)                 */
#define FCU_FLASH_CTRL_REG_ERASE_RESUME_Pos (21UL)                  /*!< ERASE_RESUME (Bit 21)                                 */
#define FCU_FLASH_CTRL_REG_ERASE_RESUME_Msk (0x200000UL)            /*!< ERASE_RESUME (Bitfield-Mask: 0x01)                    */
#define FCU_FLASH_CTRL_REG_ERASE_SUSPEND_STAT_Pos (20UL)            /*!< ERASE_SUSPEND_STAT (Bit 20)                           */
#define FCU_FLASH_CTRL_REG_ERASE_SUSPEND_STAT_Msk (0x100000UL)      /*!< ERASE_SUSPEND_STAT (Bitfield-Mask: 0x01)              */
#define FCU_FLASH_CTRL_REG_ERASE_SUSPEND_MODE_Pos (19UL)            /*!< ERASE_SUSPEND_MODE (Bit 19)                           */
#define FCU_FLASH_CTRL_REG_ERASE_SUSPEND_MODE_Msk (0x80000UL)       /*!< ERASE_SUSPEND_MODE (Bitfield-Mask: 0x01)              */
#define FCU_FLASH_CTRL_REG_ERASE_SUSPEND_EN_Pos (18UL)              /*!< ERASE_SUSPEND_EN (Bit 18)                             */
#define FCU_FLASH_CTRL_REG_ERASE_SUSPEND_EN_Msk (0x40000UL)         /*!< ERASE_SUSPEND_EN (Bitfield-Mask: 0x01)                */
#define FCU_FLASH_CTRL_REG_SLEEP_Pos      (17UL)                    /*!< SLEEP (Bit 17)                                        */
#define FCU_FLASH_CTRL_REG_SLEEP_Msk      (0x20000UL)               /*!< SLEEP (Bitfield-Mask: 0x01)                           */
#define FCU_FLASH_CTRL_REG_DMA_EN_Pos     (16UL)                    /*!< DMA_EN (Bit 16)                                       */
#define FCU_FLASH_CTRL_REG_DMA_EN_Msk     (0x10000UL)               /*!< DMA_EN (Bitfield-Mask: 0x01)                          */
#define FCU_FLASH_CTRL_REG_BUS_ERROR_EN_Pos (15UL)                  /*!< BUS_ERROR_EN (Bit 15)                                 */
#define FCU_FLASH_CTRL_REG_BUS_ERROR_EN_Msk (0x8000UL)              /*!< BUS_ERROR_EN (Bitfield-Mask: 0x01)                    */
#define FCU_FLASH_CTRL_REG_BUS_ERROR_Pos  (14UL)                    /*!< BUS_ERROR (Bit 14)                                    */
#define FCU_FLASH_CTRL_REG_BUS_ERROR_Msk  (0x4000UL)                /*!< BUS_ERROR (Bitfield-Mask: 0x01)                       */
#define FCU_FLASH_CTRL_REG_IRQ_CLEAR_Pos  (13UL)                    /*!< IRQ_CLEAR (Bit 13)                                    */
#define FCU_FLASH_CTRL_REG_IRQ_CLEAR_Msk  (0x2000UL)                /*!< IRQ_CLEAR (Bitfield-Mask: 0x01)                       */
#define FCU_FLASH_CTRL_REG_WAIT_CYCLES_Pos (10UL)                   /*!< WAIT_CYCLES (Bit 10)                                  */
#define FCU_FLASH_CTRL_REG_WAIT_CYCLES_Msk (0x1c00UL)               /*!< WAIT_CYCLES (Bitfield-Mask: 0x07)                     */
#define FCU_FLASH_CTRL_REG_FLASH_RPROT_Pos (9UL)                    /*!< FLASH_RPROT (Bit 9)                                   */
#define FCU_FLASH_CTRL_REG_FLASH_RPROT_Msk (0x200UL)                /*!< FLASH_RPROT (Bitfield-Mask: 0x01)                     */
#define FCU_FLASH_CTRL_REG_FLASH_WPROT_Pos (8UL)                    /*!< FLASH_WPROT (Bit 8)                                   */
#define FCU_FLASH_CTRL_REG_FLASH_WPROT_Msk (0x100UL)                /*!< FLASH_WPROT (Bitfield-Mask: 0x01)                     */
#define FCU_FLASH_CTRL_REG_FLASH_PROT_Pos (7UL)                     /*!< FLASH_PROT (Bit 7)                                    */
#define FCU_FLASH_CTRL_REG_FLASH_PROT_Msk (0x80UL)                  /*!< FLASH_PROT (Bitfield-Mask: 0x01)                      */
#define FCU_FLASH_CTRL_REG_PROG_RMIN_Pos  (6UL)                     /*!< PROG_RMIN (Bit 6)                                     */
#define FCU_FLASH_CTRL_REG_PROG_RMIN_Msk  (0x40UL)                  /*!< PROG_RMIN (Bitfield-Mask: 0x01)                       */
#define FCU_FLASH_CTRL_REG_PROG_ERS_Pos   (5UL)                     /*!< PROG_ERS (Bit 5)                                      */
#define FCU_FLASH_CTRL_REG_PROG_ERS_Msk   (0x20UL)                  /*!< PROG_ERS (Bitfield-Mask: 0x01)                        */
#define FCU_FLASH_CTRL_REG_PROG_WRS_Pos   (4UL)                     /*!< PROG_WRS (Bit 4)                                      */
#define FCU_FLASH_CTRL_REG_PROG_WRS_Msk   (0x10UL)                  /*!< PROG_WRS (Bitfield-Mask: 0x01)                        */
#define FCU_FLASH_CTRL_REG_PROG_SEL_Pos   (3UL)                     /*!< PROG_SEL (Bit 3)                                      */
#define FCU_FLASH_CTRL_REG_PROG_SEL_Msk   (0x8UL)                   /*!< PROG_SEL (Bitfield-Mask: 0x01)                        */
#define FCU_FLASH_CTRL_REG_SLEEP_MODE_Pos (2UL)                     /*!< SLEEP_MODE (Bit 2)                                    */
#define FCU_FLASH_CTRL_REG_SLEEP_MODE_Msk (0x4UL)                   /*!< SLEEP_MODE (Bitfield-Mask: 0x01)                      */
#define FCU_FLASH_CTRL_REG_PROG_MODE_Pos  (0UL)                     /*!< PROG_MODE (Bit 0)                                     */
#define FCU_FLASH_CTRL_REG_PROG_MODE_Msk  (0x3UL)                   /*!< PROG_MODE (Bitfield-Mask: 0x03)                       */
/* ===================================================  FLASH_PTERASE_REG  =================================================== */
#define FCU_FLASH_PTERASE_REG_PTERASE_Pos (0UL)                     /*!< PTERASE (Bit 0)                                       */
#define FCU_FLASH_PTERASE_REG_PTERASE_Msk (0xffffffUL)              /*!< PTERASE (Bitfield-Mask: 0xffffff)                     */
/* =================================================  FLASH_PTERASE_SEG_REG  ================================================= */
#define FCU_FLASH_PTERASE_SEG_REG_PTERASE_SEG_Pos (0UL)             /*!< PTERASE_SEG (Bit 0)                                   */
#define FCU_FLASH_PTERASE_SEG_REG_PTERASE_SEG_Msk (0xffffffUL)      /*!< PTERASE_SEG (Bitfield-Mask: 0xffffff)                 */
/* ====================================================  FLASH_PTME_REG  ===================================================== */
#define FCU_FLASH_PTME_REG_PTME_Pos       (0UL)                     /*!< PTME (Bit 0)                                          */
#define FCU_FLASH_PTME_REG_PTME_Msk       (0xffffffUL)              /*!< PTME (Bitfield-Mask: 0xffffff)                        */
/* ===================================================  FLASH_PTNVH1_REG  ==================================================== */
#define FCU_FLASH_PTNVH1_REG_PTNVH1_Pos   (0UL)                     /*!< PTNVH1 (Bit 0)                                        */
#define FCU_FLASH_PTNVH1_REG_PTNVH1_Msk   (0xffffUL)                /*!< PTNVH1 (Bitfield-Mask: 0xffff)                        */
/* ===================================================  FLASH_PTPROG_REG  ==================================================== */
#define FCU_FLASH_PTPROG_REG_PTPROG_Pos   (0UL)                     /*!< PTPROG (Bit 0)                                        */
#define FCU_FLASH_PTPROG_REG_PTPROG_Msk   (0xffffUL)                /*!< PTPROG (Bitfield-Mask: 0xffff)                        */
/* ===================================================  FLASH_PTWK_SP_REG  =================================================== */
#define FCU_FLASH_PTWK_SP_REG_PTWK_SP_Pos (0UL)                     /*!< PTWK_SP (Bit 0)                                       */
#define FCU_FLASH_PTWK_SP_REG_PTWK_SP_Msk (0xffUL)                  /*!< PTWK_SP (Bitfield-Mask: 0xff)                         */
/* ===============================================  FLASH_RTERASE_SEG_CNT_REG  =============================================== */
#define FCU_FLASH_RTERASE_SEG_CNT_REG_RTERASE_SEG_CNT_Pos (0UL)     /*!< RTERASE_SEG_CNT (Bit 0)                               */
#define FCU_FLASH_RTERASE_SEG_CNT_REG_RTERASE_SEG_CNT_Msk (0xffffffUL) /*!< RTERASE_SEG_CNT (Bitfield-Mask: 0xffffff)          */
/* ===============================================  FLASH_RTERASE_TOT_CNT_REG  =============================================== */
#define FCU_FLASH_RTERASE_TOT_CNT_REG_RTERASE_TOT_CNT_Pos (0UL)     /*!< RTERASE_TOT_CNT (Bit 0)                               */
#define FCU_FLASH_RTERASE_TOT_CNT_REG_RTERASE_TOT_CNT_Msk (0xffffffUL) /*!< RTERASE_TOT_CNT (Bitfield-Mask: 0xffffff)          */


/* =========================================================================================================================== */
/* ================                                           GPADC                                           ================ */
/* =========================================================================================================================== */

