dianyundou/DA14592BLE_CSL/CSL-59x_10.679.2.17/sdk/bsp/include/DA1459x-00.h
/* =====================================================  MDCT_CTRL_REG  ===================================================== */
#define MDCT_MDCT_CTRL_REG_DONE_Pos       (31UL)                    /*!< DONE (Bit 31)                                         */
#define MDCT_MDCT_CTRL_REG_DONE_Msk       (0x80000000UL)            /*!< DONE (Bitfield-Mask: 0x01)                            */
#define MDCT_MDCT_CTRL_REG_USE_CORDIC_Pos (29UL)                    /*!< USE_CORDIC (Bit 29)                                   */
#define MDCT_MDCT_CTRL_REG_USE_CORDIC_Msk (0x20000000UL)            /*!< USE_CORDIC (Bitfield-Mask: 0x01)                      */
#define MDCT_MDCT_CTRL_REG_IRQ_CLR_Pos    (28UL)                    /*!< IRQ_CLR (Bit 28)                                      */
#define MDCT_MDCT_CTRL_REG_IRQ_CLR_Msk    (0x10000000UL)            /*!< IRQ_CLR (Bitfield-Mask: 0x01)                         */
#define MDCT_MDCT_CTRL_REG_CLK_DIV_Pos    (26UL)                    /*!< CLK_DIV (Bit 26)                                      */
#define MDCT_MDCT_CTRL_REG_CLK_DIV_Msk    (0xc000000UL)             /*!< CLK_DIV (Bitfield-Mask: 0x03)                         */
#define MDCT_MDCT_CTRL_REG_XFORM_SIZE_Pos (16UL)                    /*!< XFORM_SIZE (Bit 16)                                   */
#define MDCT_MDCT_CTRL_REG_XFORM_SIZE_Msk (0x3ff0000UL)             /*!< XFORM_SIZE (Bitfield-Mask: 0x3ff)                     */
#define MDCT_MDCT_CTRL_REG_Y_STRIDE_Pos   (8UL)                     /*!< Y_STRIDE (Bit 8)                                      */
#define MDCT_MDCT_CTRL_REG_Y_STRIDE_Msk   (0xff00UL)                /*!< Y_STRIDE (Bitfield-Mask: 0xff)                        */
#define MDCT_MDCT_CTRL_REG_WORD_SIZE_Pos  (7UL)                     /*!< WORD_SIZE (Bit 7)                                     */
#define MDCT_MDCT_CTRL_REG_WORD_SIZE_Msk  (0x80UL)                  /*!< WORD_SIZE (Bitfield-Mask: 0x01)                       */
#define MDCT_MDCT_CTRL_REG_INVERSE_Pos    (6UL)                     /*!< INVERSE (Bit 6)                                       */
#define MDCT_MDCT_CTRL_REG_INVERSE_Msk    (0x40UL)                  /*!< INVERSE (Bitfield-Mask: 0x01)                         */
#define MDCT_MDCT_CTRL_REG_N_STAGES_Pos   (2UL)                     /*!< N_STAGES (Bit 2)                                      */
#define MDCT_MDCT_CTRL_REG_N_STAGES_Msk   (0x3cUL)                  /*!< N_STAGES (Bitfield-Mask: 0x0f)                        */
#define MDCT_MDCT_CTRL_REG_IRQ_EN_Pos     (1UL)                     /*!< IRQ_EN (Bit 1)                                        */
#define MDCT_MDCT_CTRL_REG_IRQ_EN_Msk     (0x2UL)                   /*!< IRQ_EN (Bitfield-Mask: 0x01)                          */
#define MDCT_MDCT_CTRL_REG_EN_Pos         (0UL)                     /*!< EN (Bit 0)                                            */
#define MDCT_MDCT_CTRL_REG_EN_Msk         (0x1UL)                   /*!< EN (Bitfield-Mask: 0x01)                              */
/* ==================================================  MDCT_PHASE_INC_REG  =================================================== */
#define MDCT_MDCT_PHASE_INC_REG_PHASE_INC_Pos (0UL)                 /*!< PHASE_INC (Bit 0)                                     */
#define MDCT_MDCT_PHASE_INC_REG_PHASE_INC_Msk (0xffffffffUL)        /*!< PHASE_INC (Bitfield-Mask: 0xffffffff)                 */
/* ====================================================  MDCT_STAGE0_REG  ==================================================== */
#define MDCT_MDCT_STAGE0_REG_STRIDE_Pos   (22UL)                    /*!< STRIDE (Bit 22)                                       */
#define MDCT_MDCT_STAGE0_REG_STRIDE_Msk   (0xffc00000UL)            /*!< STRIDE (Bitfield-Mask: 0x3ff)                         */
#define MDCT_MDCT_STAGE0_REG_M_Pos        (12UL)                    /*!< M (Bit 12)                                            */
#define MDCT_MDCT_STAGE0_REG_M_Msk        (0x3ff000UL)              /*!< M (Bitfield-Mask: 0x3ff)                              */
#define MDCT_MDCT_STAGE0_REG_RADIX_Pos    (8UL)                     /*!< RADIX (Bit 8)                                         */
#define MDCT_MDCT_STAGE0_REG_RADIX_Msk    (0x700UL)                 /*!< RADIX (Bitfield-Mask: 0x07)                           */
#define MDCT_MDCT_STAGE0_REG_IN_ADDR_MODE_Pos (6UL)                 /*!< IN_ADDR_MODE (Bit 6)                                  */
#define MDCT_MDCT_STAGE0_REG_IN_ADDR_MODE_Msk (0x40UL)              /*!< IN_ADDR_MODE (Bitfield-Mask: 0x01)                    */
#define MDCT_MDCT_STAGE0_REG_OUT_BUFFER_Pos (5UL)                   /*!< OUT_BUFFER (Bit 5)                                    */
#define MDCT_MDCT_STAGE0_REG_OUT_BUFFER_Msk (0x20UL)                /*!< OUT_BUFFER (Bitfield-Mask: 0x01)                      */
#define MDCT_MDCT_STAGE0_REG_IN_BUFFER_Pos (4UL)                    /*!< IN_BUFFER (Bit 4)                                     */
#define MDCT_MDCT_STAGE0_REG_IN_BUFFER_Msk (0x10UL)                 /*!< IN_BUFFER (Bitfield-Mask: 0x01)                       */
#define MDCT_MDCT_STAGE0_REG_MODE_Pos     (0UL)                     /*!< MODE (Bit 0)                                          */
#define MDCT_MDCT_STAGE0_REG_MODE_Msk     (0x7UL)                   /*!< MODE (Bitfield-Mask: 0x07)                            */
/* ====================================================  MDCT_STAGE1_REG  ==================================================== */
#define MDCT_MDCT_STAGE1_REG_STRIDE_Pos   (22UL)                    /*!< STRIDE (Bit 22)                                       */
#define MDCT_MDCT_STAGE1_REG_STRIDE_Msk   (0xffc00000UL)            /*!< STRIDE (Bitfield-Mask: 0x3ff)                         */
#define MDCT_MDCT_STAGE1_REG_M_Pos        (12UL)                    /*!< M (Bit 12)                                            */
#define MDCT_MDCT_STAGE1_REG_M_Msk        (0x3ff000UL)              /*!< M (Bitfield-Mask: 0x3ff)                              */
#define MDCT_MDCT_STAGE1_REG_RADIX_Pos    (8UL)                     /*!< RADIX (Bit 8)                                         */
#define MDCT_MDCT_STAGE1_REG_RADIX_Msk    (0x700UL)                 /*!< RADIX (Bitfield-Mask: 0x07)                           */
#define MDCT_MDCT_STAGE1_REG_IN_ADDR_MODE_Pos (6UL)                 /*!< IN_ADDR_MODE (Bit 6)                                  */
#define MDCT_MDCT_STAGE1_REG_IN_ADDR_MODE_Msk (0x40UL)              /*!< IN_ADDR_MODE (Bitfield-Mask: 0x01)                    */
#define MDCT_MDCT_STAGE1_REG_OUT_BUFFER_Pos (5UL)                   /*!< OUT_BUFFER (Bit 5)                                    */
#define MDCT_MDCT_STAGE1_REG_OUT_BUFFER_Msk (0x20UL)                /*!< OUT_BUFFER (Bitfield-Mask: 0x01)                      */
#define MDCT_MDCT_STAGE1_REG_IN_BUFFER_Pos (4UL)                    /*!< IN_BUFFER (Bit 4)                                     */
#define MDCT_MDCT_STAGE1_REG_IN_BUFFER_Msk (0x10UL)                 /*!< IN_BUFFER (Bitfield-Mask: 0x01)                       */
#define MDCT_MDCT_STAGE1_REG_MODE_Pos     (0UL)                     /*!< MODE (Bit 0)                                          */
#define MDCT_MDCT_STAGE1_REG_MODE_Msk     (0x7UL)                   /*!< MODE (Bitfield-Mask: 0x07)                            */
/* ====================================================  MDCT_STAGE2_REG  ==================================================== */
#define MDCT_MDCT_STAGE2_REG_STRIDE_Pos   (22UL)                    /*!< STRIDE (Bit 22)                                       */
#define MDCT_MDCT_STAGE2_REG_STRIDE_Msk   (0xffc00000UL)            /*!< STRIDE (Bitfield-Mask: 0x3ff)                         */
#define MDCT_MDCT_STAGE2_REG_M_Pos        (12UL)                    /*!< M (Bit 12)                                            */
#define MDCT_MDCT_STAGE2_REG_M_Msk        (0x3ff000UL)              /*!< M (Bitfield-Mask: 0x3ff)                              */
#define MDCT_MDCT_STAGE2_REG_RADIX_Pos    (8UL)                     /*!< RADIX (Bit 8)                                         */
#define MDCT_MDCT_STAGE2_REG_RADIX_Msk    (0x700UL)                 /*!< RADIX (Bitfield-Mask: 0x07)                           */
#define MDCT_MDCT_STAGE2_REG_IN_ADDR_MODE_Pos (6UL)                 /*!< IN_ADDR_MODE (Bit 6)                                  */
#define MDCT_MDCT_STAGE2_REG_IN_ADDR_MODE_Msk (0x40UL)              /*!< IN_ADDR_MODE (Bitfield-Mask: 0x01)                    */
#define MDCT_MDCT_STAGE2_REG_OUT_BUFFER_Pos (5UL)                   /*!< OUT_BUFFER (Bit 5)                                    */
#define MDCT_MDCT_STAGE2_REG_OUT_BUFFER_Msk (0x20UL)                /*!< OUT_BUFFER (Bitfield-Mask: 0x01)                      */
#define MDCT_MDCT_STAGE2_REG_IN_BUFFER_Pos (4UL)                    /*!< IN_BUFFER (Bit 4)                                     */
#define MDCT_MDCT_STAGE2_REG_IN_BUFFER_Msk (0x10UL)                 /*!< IN_BUFFER (Bitfield-Mask: 0x01)                       */
#define MDCT_MDCT_STAGE2_REG_MODE_Pos     (0UL)                     /*!< MODE (Bit 0)                                          */
#define MDCT_MDCT_STAGE2_REG_MODE_Msk     (0x7UL)                   /*!< MODE (Bitfield-Mask: 0x07)                            */
/* ====================================================  MDCT_STAGE3_REG  ==================================================== */
#define MDCT_MDCT_STAGE3_REG_STRIDE_Pos   (22UL)                    /*!< STRIDE (Bit 22)                                       */
#define MDCT_MDCT_STAGE3_REG_STRIDE_Msk   (0xffc00000UL)            /*!< STRIDE (Bitfield-Mask: 0x3ff)                         */
#define MDCT_MDCT_STAGE3_REG_M_Pos        (12UL)                    /*!< M (Bit 12)                                            */
#define MDCT_MDCT_STAGE3_REG_M_Msk        (0x3ff000UL)              /*!< M (Bitfield-Mask: 0x3ff)                              */
#define MDCT_MDCT_STAGE3_REG_RADIX_Pos    (8UL)                     /*!< RADIX (Bit 8)                                         */
#define MDCT_MDCT_STAGE3_REG_RADIX_Msk    (0x700UL)                 /*!< RADIX (Bitfield-Mask: 0x07)                           */
#define MDCT_MDCT_STAGE3_REG_IN_ADDR_MODE_Pos (6UL)                 /*!< IN_ADDR_MODE (Bit 6)                                  */
#define MDCT_MDCT_STAGE3_REG_IN_ADDR_MODE_Msk (0x40UL)              /*!< IN_ADDR_MODE (Bitfield-Mask: 0x01)                    */
#define MDCT_MDCT_STAGE3_REG_OUT_BUFFER_Pos (5UL)                   /*!< OUT_BUFFER (Bit 5)                                    */
#define MDCT_MDCT_STAGE3_REG_OUT_BUFFER_Msk (0x20UL)                /*!< OUT_BUFFER (Bitfield-Mask: 0x01)                      */
#define MDCT_MDCT_STAGE3_REG_IN_BUFFER_Pos (4UL)                    /*!< IN_BUFFER (Bit 4)                                     */
#define MDCT_MDCT_STAGE3_REG_IN_BUFFER_Msk (0x10UL)                 /*!< IN_BUFFER (Bitfield-Mask: 0x01)                       */
#define MDCT_MDCT_STAGE3_REG_MODE_Pos     (0UL)                     /*!< MODE (Bit 0)                                          */
#define MDCT_MDCT_STAGE3_REG_MODE_Msk     (0x7UL)                   /*!< MODE (Bitfield-Mask: 0x07)                            */
/* ====================================================  MDCT_STAGE4_REG  ==================================================== */
#define MDCT_MDCT_STAGE4_REG_STRIDE_Pos   (22UL)                    /*!< STRIDE (Bit 22)                                       */
#define MDCT_MDCT_STAGE4_REG_STRIDE_Msk   (0xffc00000UL)            /*!< STRIDE (Bitfield-Mask: 0x3ff)                         */
#define MDCT_MDCT_STAGE4_REG_M_Pos        (12UL)                    /*!< M (Bit 12)                                            */
#define MDCT_MDCT_STAGE4_REG_M_Msk        (0x3ff000UL)              /*!< M (Bitfield-Mask: 0x3ff)                              */
#define MDCT_MDCT_STAGE4_REG_RADIX_Pos    (8UL)                     /*!< RADIX (Bit 8)                                         */
#define MDCT_MDCT_STAGE4_REG_RADIX_Msk    (0x700UL)                 /*!< RADIX (Bitfield-Mask: 0x07)                           */
#define MDCT_MDCT_STAGE4_REG_IN_ADDR_MODE_Pos (6UL)                 /*!< IN_ADDR_MODE (Bit 6)                                  */
#define MDCT_MDCT_STAGE4_REG_IN_ADDR_MODE_Msk (0x40UL)              /*!< IN_ADDR_MODE (Bitfield-Mask: 0x01)                    */
#define MDCT_MDCT_STAGE4_REG_OUT_BUFFER_Pos (5UL)                   /*!< OUT_BUFFER (Bit 5)                                    */
#define MDCT_MDCT_STAGE4_REG_OUT_BUFFER_Msk (0x20UL)                /*!< OUT_BUFFER (Bitfield-Mask: 0x01)                      */
#define MDCT_MDCT_STAGE4_REG_IN_BUFFER_Pos (4UL)                    /*!< IN_BUFFER (Bit 4)                                     */
#define MDCT_MDCT_STAGE4_REG_IN_BUFFER_Msk (0x10UL)                 /*!< IN_BUFFER (Bitfield-Mask: 0x01)                       */
#define MDCT_MDCT_STAGE4_REG_MODE_Pos     (0UL)                     /*!< MODE (Bit 0)                                          */
#define MDCT_MDCT_STAGE4_REG_MODE_Msk     (0x7UL)                   /*!< MODE (Bitfield-Mask: 0x07)                            */
/* ====================================================  MDCT_STAGE5_REG  ==================================================== */
#define MDCT_MDCT_STAGE5_REG_STRIDE_Pos   (22UL)                    /*!< STRIDE (Bit 22)                                       */
#define MDCT_MDCT_STAGE5_REG_STRIDE_Msk   (0xffc00000UL)            /*!< STRIDE (Bitfield-Mask: 0x3ff)                         */
#define MDCT_MDCT_STAGE5_REG_M_Pos        (12UL)                    /*!< M (Bit 12)                                            */
#define MDCT_MDCT_STAGE5_REG_M_Msk        (0x3ff000UL)              /*!< M (Bitfield-Mask: 0x3ff)                              */
#define MDCT_MDCT_STAGE5_REG_RADIX_Pos    (8UL)                     /*!< RADIX (Bit 8)                                         */
#define MDCT_MDCT_STAGE5_REG_RADIX_Msk    (0x700UL)                 /*!< RADIX (Bitfield-Mask: 0x07)                           */
#define MDCT_MDCT_STAGE5_REG_IN_ADDR_MODE_Pos (6UL)                 /*!< IN_ADDR_MODE (Bit 6)                                  */
#define MDCT_MDCT_STAGE5_REG_IN_ADDR_MODE_Msk (0x40UL)              /*!< IN_ADDR_MODE (Bitfield-Mask: 0x01)                    */
#define MDCT_MDCT_STAGE5_REG_OUT_BUFFER_Pos (5UL)                   /*!< OUT_BUFFER (Bit 5)                                    */
#define MDCT_MDCT_STAGE5_REG_OUT_BUFFER_Msk (0x20UL)                /*!< OUT_BUFFER (Bitfield-Mask: 0x01)                      */
#define MDCT_MDCT_STAGE5_REG_IN_BUFFER_Pos (4UL)                    /*!< IN_BUFFER (Bit 4)                                     */
#define MDCT_MDCT_STAGE5_REG_IN_BUFFER_Msk (0x10UL)                 /*!< IN_BUFFER (Bitfield-Mask: 0x01)                       */
#define MDCT_MDCT_STAGE5_REG_MODE_Pos     (0UL)                     /*!< MODE (Bit 0)                                          */
#define MDCT_MDCT_STAGE5_REG_MODE_Msk     (0x7UL)                   /*!< MODE (Bitfield-Mask: 0x07)                            */
/* ====================================================  MDCT_STAGE6_REG  ==================================================== */
#define MDCT_MDCT_STAGE6_REG_STRIDE_Pos   (22UL)                    /*!< STRIDE (Bit 22)                                       */
#define MDCT_MDCT_STAGE6_REG_STRIDE_Msk   (0xffc00000UL)            /*!< STRIDE (Bitfield-Mask: 0x3ff)                         */
#define MDCT_MDCT_STAGE6_REG_M_Pos        (12UL)                    /*!< M (Bit 12)                                            */
#define MDCT_MDCT_STAGE6_REG_M_Msk        (0x3ff000UL)              /*!< M (Bitfield-Mask: 0x3ff)                              */
#define MDCT_MDCT_STAGE6_REG_RADIX_Pos    (8UL)                     /*!< RADIX (Bit 8)                                         */
#define MDCT_MDCT_STAGE6_REG_RADIX_Msk    (0x700UL)                 /*!< RADIX (Bitfield-Mask: 0x07)                           */
#define MDCT_MDCT_STAGE6_REG_IN_ADDR_MODE_Pos (6UL)                 /*!< IN_ADDR_MODE (Bit 6)                                  */
#define MDCT_MDCT_STAGE6_REG_IN_ADDR_MODE_Msk (0x40UL)              /*!< IN_ADDR_MODE (Bitfield-Mask: 0x01)                    */
#define MDCT_MDCT_STAGE6_REG_OUT_BUFFER_Pos (5UL)                   /*!< OUT_BUFFER (Bit 5)                                    */
#define MDCT_MDCT_STAGE6_REG_OUT_BUFFER_Msk (0x20UL)                /*!< OUT_BUFFER (Bitfield-Mask: 0x01)                      */
#define MDCT_MDCT_STAGE6_REG_IN_BUFFER_Pos (4UL)                    /*!< IN_BUFFER (Bit 4)                                     */
#define MDCT_MDCT_STAGE6_REG_IN_BUFFER_Msk (0x10UL)                 /*!< IN_BUFFER (Bitfield-Mask: 0x01)                       */
#define MDCT_MDCT_STAGE6_REG_MODE_Pos     (0UL)                     /*!< MODE (Bit 0)                                          */
#define MDCT_MDCT_STAGE6_REG_MODE_Msk     (0x7UL)                   /*!< MODE (Bitfield-Mask: 0x07)                            */
/* ====================================================  MDCT_STAGE7_REG  ==================================================== */
#define MDCT_MDCT_STAGE7_REG_STRIDE_Pos   (22UL)                    /*!< STRIDE (Bit 22)                                       */
#define MDCT_MDCT_STAGE7_REG_STRIDE_Msk   (0xffc00000UL)            /*!< STRIDE (Bitfield-Mask: 0x3ff)                         */
#define MDCT_MDCT_STAGE7_REG_M_Pos        (12UL)                    /*!< M (Bit 12)                                            */
#define MDCT_MDCT_STAGE7_REG_M_Msk        (0x3ff000UL)              /*!< M (Bitfield-Mask: 0x3ff)                              */
#define MDCT_MDCT_STAGE7_REG_RADIX_Pos    (8UL)                     /*!< RADIX (Bit 8)                                         */
#define MDCT_MDCT_STAGE7_REG_RADIX_Msk    (0x700UL)                 /*!< RADIX (Bitfield-Mask: 0x07)                           */
#define MDCT_MDCT_STAGE7_REG_IN_ADDR_MODE_Pos (6UL)                 /*!< IN_ADDR_MODE (Bit 6)                                  */
#define MDCT_MDCT_STAGE7_REG_IN_ADDR_MODE_Msk (0x40UL)              /*!< IN_ADDR_MODE (Bitfield-Mask: 0x01)                    */
#define MDCT_MDCT_STAGE7_REG_OUT_BUFFER_Pos (5UL)                   /*!< OUT_BUFFER (Bit 5)                                    */
#define MDCT_MDCT_STAGE7_REG_OUT_BUFFER_Msk (0x20UL)                /*!< OUT_BUFFER (Bitfield-Mask: 0x01)                      */
#define MDCT_MDCT_STAGE7_REG_IN_BUFFER_Pos (4UL)                    /*!< IN_BUFFER (Bit 4)                                     */
#define MDCT_MDCT_STAGE7_REG_IN_BUFFER_Msk (0x10UL)                 /*!< IN_BUFFER (Bitfield-Mask: 0x01)                       */
#define MDCT_MDCT_STAGE7_REG_MODE_Pos     (0UL)                     /*!< MODE (Bit 0)                                          */
#define MDCT_MDCT_STAGE7_REG_MODE_Msk     (0x7UL)                   /*!< MODE (Bitfield-Mask: 0x07)                            */
/* ==================================================  MDCT_XBASE_ADDR_REG  ================================================== */
#define MDCT_MDCT_XBASE_ADDR_REG_XBASE_ADDR_Pos (0UL)               /*!< XBASE_ADDR (Bit 0)                                    */
#define MDCT_MDCT_XBASE_ADDR_REG_XBASE_ADDR_Msk (0xffffffffUL)      /*!< XBASE_ADDR (Bitfield-Mask: 0xffffffff)                */
/* ==================================================  MDCT_YBASE_ADDR_REG  ================================================== */
#define MDCT_MDCT_YBASE_ADDR_REG_YBASE_ADDR_Pos (0UL)               /*!< YBASE_ADDR (Bit 0)                                    */
#define MDCT_MDCT_YBASE_ADDR_REG_YBASE_ADDR_Msk (0xffffffffUL)      /*!< YBASE_ADDR (Bitfield-Mask: 0xffffffff)                */
/* ==================================================  MDCT_ZBASE_ADDR_REG  ================================================== */
#define MDCT_MDCT_ZBASE_ADDR_REG_ZBASE_ADDR_Pos (0UL)               /*!< ZBASE_ADDR (Bit 0)                                    */
#define MDCT_MDCT_ZBASE_ADDR_REG_ZBASE_ADDR_Msk (0xffffffffUL)      /*!< ZBASE_ADDR (Bitfield-Mask: 0xffffffff)                */


/* =========================================================================================================================== */
/* ================                                          MEMCTRL                                          ================ */
/* =========================================================================================================================== */

