dianyundou/DA14592BLE_CSL/CSL-59x_10.679.2.17/sdk/bsp/include/DA1459x-00.h
/* ====================================================  BUSY_RESET_REG  ===================================================== */
#define MEMCTRL_BUSY_RESET_REG_BUSY_SPARE_Pos (30UL)                /*!< BUSY_SPARE (Bit 30)                                   */
#define MEMCTRL_BUSY_RESET_REG_BUSY_SPARE_Msk (0xc0000000UL)        /*!< BUSY_SPARE (Bitfield-Mask: 0x03)                      */
#define MEMCTRL_BUSY_RESET_REG_BUSY_SPARE1_Pos (28UL)               /*!< BUSY_SPARE1 (Bit 28)                                  */
#define MEMCTRL_BUSY_RESET_REG_BUSY_SPARE1_Msk (0x30000000UL)       /*!< BUSY_SPARE1 (Bitfield-Mask: 0x03)                     */
#define MEMCTRL_BUSY_RESET_REG_BUSY_TIMER4_Pos (26UL)               /*!< BUSY_TIMER4 (Bit 26)                                  */
#define MEMCTRL_BUSY_RESET_REG_BUSY_TIMER4_Msk (0xc000000UL)        /*!< BUSY_TIMER4 (Bitfield-Mask: 0x03)                     */
#define MEMCTRL_BUSY_RESET_REG_BUSY_TIMER3_Pos (24UL)               /*!< BUSY_TIMER3 (Bit 24)                                  */
#define MEMCTRL_BUSY_RESET_REG_BUSY_TIMER3_Msk (0x3000000UL)        /*!< BUSY_TIMER3 (Bitfield-Mask: 0x03)                     */
#define MEMCTRL_BUSY_RESET_REG_BUSY_TIMER2_Pos (22UL)               /*!< BUSY_TIMER2 (Bit 22)                                  */
#define MEMCTRL_BUSY_RESET_REG_BUSY_TIMER2_Msk (0xc00000UL)         /*!< BUSY_TIMER2 (Bitfield-Mask: 0x03)                     */
#define MEMCTRL_BUSY_RESET_REG_BUSY_TIMER_Pos (20UL)                /*!< BUSY_TIMER (Bit 20)                                   */
#define MEMCTRL_BUSY_RESET_REG_BUSY_TIMER_Msk (0x300000UL)          /*!< BUSY_TIMER (Bitfield-Mask: 0x03)                      */
#define MEMCTRL_BUSY_RESET_REG_BUSY_PDM_Pos (18UL)                  /*!< BUSY_PDM (Bit 18)                                     */
#define MEMCTRL_BUSY_RESET_REG_BUSY_PDM_Msk (0xc0000UL)             /*!< BUSY_PDM (Bitfield-Mask: 0x03)                        */
#define MEMCTRL_BUSY_RESET_REG_BUSY_PCM_Pos (16UL)                  /*!< BUSY_PCM (Bit 16)                                     */
#define MEMCTRL_BUSY_RESET_REG_BUSY_PCM_Msk (0x30000UL)             /*!< BUSY_PCM (Bitfield-Mask: 0x03)                        */
#define MEMCTRL_BUSY_RESET_REG_BUSY_SRC2_Pos (14UL)                 /*!< BUSY_SRC2 (Bit 14)                                    */
#define MEMCTRL_BUSY_RESET_REG_BUSY_SRC2_Msk (0xc000UL)             /*!< BUSY_SRC2 (Bitfield-Mask: 0x03)                       */
#define MEMCTRL_BUSY_RESET_REG_BUSY_SRC_Pos (12UL)                  /*!< BUSY_SRC (Bit 12)                                     */
#define MEMCTRL_BUSY_RESET_REG_BUSY_SRC_Msk (0x3000UL)              /*!< BUSY_SRC (Bitfield-Mask: 0x03)                        */
#define MEMCTRL_BUSY_RESET_REG_BUSY_SDADC_Pos (10UL)                /*!< BUSY_SDADC (Bit 10)                                   */
#define MEMCTRL_BUSY_RESET_REG_BUSY_SDADC_Msk (0xc00UL)             /*!< BUSY_SDADC (Bitfield-Mask: 0x03)                      */
#define MEMCTRL_BUSY_RESET_REG_BUSY_GPADC_Pos (8UL)                 /*!< BUSY_GPADC (Bit 8)                                    */
#define MEMCTRL_BUSY_RESET_REG_BUSY_GPADC_Msk (0x300UL)             /*!< BUSY_GPADC (Bitfield-Mask: 0x03)                      */
#define MEMCTRL_BUSY_RESET_REG_BUSY_I2C_Pos (6UL)                   /*!< BUSY_I2C (Bit 6)                                      */
#define MEMCTRL_BUSY_RESET_REG_BUSY_I2C_Msk (0xc0UL)                /*!< BUSY_I2C (Bitfield-Mask: 0x03)                        */
#define MEMCTRL_BUSY_RESET_REG_BUSY_SPI_Pos (4UL)                   /*!< BUSY_SPI (Bit 4)                                      */
#define MEMCTRL_BUSY_RESET_REG_BUSY_SPI_Msk (0x30UL)                /*!< BUSY_SPI (Bitfield-Mask: 0x03)                        */
#define MEMCTRL_BUSY_RESET_REG_BUSY_UART2_Pos (2UL)                 /*!< BUSY_UART2 (Bit 2)                                    */
#define MEMCTRL_BUSY_RESET_REG_BUSY_UART2_Msk (0xcUL)               /*!< BUSY_UART2 (Bitfield-Mask: 0x03)                      */
#define MEMCTRL_BUSY_RESET_REG_BUSY_UART_Pos (0UL)                  /*!< BUSY_UART (Bit 0)                                     */
#define MEMCTRL_BUSY_RESET_REG_BUSY_UART_Msk (0x3UL)                /*!< BUSY_UART (Bitfield-Mask: 0x03)                       */
/* =====================================================  BUSY_SET_REG  ====================================================== */
#define MEMCTRL_BUSY_SET_REG_BUSY_SPARE_Pos (30UL)                  /*!< BUSY_SPARE (Bit 30)                                   */
#define MEMCTRL_BUSY_SET_REG_BUSY_SPARE_Msk (0xc0000000UL)          /*!< BUSY_SPARE (Bitfield-Mask: 0x03)                      */
#define MEMCTRL_BUSY_SET_REG_BUSY_SPARE1_Pos (28UL)                 /*!< BUSY_SPARE1 (Bit 28)                                  */
#define MEMCTRL_BUSY_SET_REG_BUSY_SPARE1_Msk (0x30000000UL)         /*!< BUSY_SPARE1 (Bitfield-Mask: 0x03)                     */
#define MEMCTRL_BUSY_SET_REG_BUSY_TIMER4_Pos (26UL)                 /*!< BUSY_TIMER4 (Bit 26)                                  */
#define MEMCTRL_BUSY_SET_REG_BUSY_TIMER4_Msk (0xc000000UL)          /*!< BUSY_TIMER4 (Bitfield-Mask: 0x03)                     */
#define MEMCTRL_BUSY_SET_REG_BUSY_TIMER3_Pos (24UL)                 /*!< BUSY_TIMER3 (Bit 24)                                  */
#define MEMCTRL_BUSY_SET_REG_BUSY_TIMER3_Msk (0x3000000UL)          /*!< BUSY_TIMER3 (Bitfield-Mask: 0x03)                     */
#define MEMCTRL_BUSY_SET_REG_BUSY_TIMER2_Pos (22UL)                 /*!< BUSY_TIMER2 (Bit 22)                                  */
#define MEMCTRL_BUSY_SET_REG_BUSY_TIMER2_Msk (0xc00000UL)           /*!< BUSY_TIMER2 (Bitfield-Mask: 0x03)                     */
#define MEMCTRL_BUSY_SET_REG_BUSY_TIMER_Pos (20UL)                  /*!< BUSY_TIMER (Bit 20)                                   */
#define MEMCTRL_BUSY_SET_REG_BUSY_TIMER_Msk (0x300000UL)            /*!< BUSY_TIMER (Bitfield-Mask: 0x03)                      */
#define MEMCTRL_BUSY_SET_REG_BUSY_PDM_Pos (18UL)                    /*!< BUSY_PDM (Bit 18)                                     */
#define MEMCTRL_BUSY_SET_REG_BUSY_PDM_Msk (0xc0000UL)               /*!< BUSY_PDM (Bitfield-Mask: 0x03)                        */
#define MEMCTRL_BUSY_SET_REG_BUSY_PCM_Pos (16UL)                    /*!< BUSY_PCM (Bit 16)                                     */
#define MEMCTRL_BUSY_SET_REG_BUSY_PCM_Msk (0x30000UL)               /*!< BUSY_PCM (Bitfield-Mask: 0x03)                        */
#define MEMCTRL_BUSY_SET_REG_BUSY_SRC2_Pos (14UL)                   /*!< BUSY_SRC2 (Bit 14)                                    */
#define MEMCTRL_BUSY_SET_REG_BUSY_SRC2_Msk (0xc000UL)               /*!< BUSY_SRC2 (Bitfield-Mask: 0x03)                       */
#define MEMCTRL_BUSY_SET_REG_BUSY_SRC_Pos (12UL)                    /*!< BUSY_SRC (Bit 12)                                     */
#define MEMCTRL_BUSY_SET_REG_BUSY_SRC_Msk (0x3000UL)                /*!< BUSY_SRC (Bitfield-Mask: 0x03)                        */
#define MEMCTRL_BUSY_SET_REG_BUSY_SDADC_Pos (10UL)                  /*!< BUSY_SDADC (Bit 10)                                   */
#define MEMCTRL_BUSY_SET_REG_BUSY_SDADC_Msk (0xc00UL)               /*!< BUSY_SDADC (Bitfield-Mask: 0x03)                      */
#define MEMCTRL_BUSY_SET_REG_BUSY_GPADC_Pos (8UL)                   /*!< BUSY_GPADC (Bit 8)                                    */
#define MEMCTRL_BUSY_SET_REG_BUSY_GPADC_Msk (0x300UL)               /*!< BUSY_GPADC (Bitfield-Mask: 0x03)                      */
#define MEMCTRL_BUSY_SET_REG_BUSY_I2C_Pos (6UL)                     /*!< BUSY_I2C (Bit 6)                                      */
#define MEMCTRL_BUSY_SET_REG_BUSY_I2C_Msk (0xc0UL)                  /*!< BUSY_I2C (Bitfield-Mask: 0x03)                        */
#define MEMCTRL_BUSY_SET_REG_BUSY_SPI_Pos (4UL)                     /*!< BUSY_SPI (Bit 4)                                      */
#define MEMCTRL_BUSY_SET_REG_BUSY_SPI_Msk (0x30UL)                  /*!< BUSY_SPI (Bitfield-Mask: 0x03)                        */
#define MEMCTRL_BUSY_SET_REG_BUSY_UART2_Pos (2UL)                   /*!< BUSY_UART2 (Bit 2)                                    */
#define MEMCTRL_BUSY_SET_REG_BUSY_UART2_Msk (0xcUL)                 /*!< BUSY_UART2 (Bitfield-Mask: 0x03)                      */
#define MEMCTRL_BUSY_SET_REG_BUSY_UART_Pos (0UL)                    /*!< BUSY_UART (Bit 0)                                     */
#define MEMCTRL_BUSY_SET_REG_BUSY_UART_Msk (0x3UL)                  /*!< BUSY_UART (Bitfield-Mask: 0x03)                       */
/* =====================================================  BUSY_STAT_REG  ===================================================== */
#define MEMCTRL_BUSY_STAT_REG_BUSY_SPARE_Pos (30UL)                 /*!< BUSY_SPARE (Bit 30)                                   */
#define MEMCTRL_BUSY_STAT_REG_BUSY_SPARE_Msk (0xc0000000UL)         /*!< BUSY_SPARE (Bitfield-Mask: 0x03)                      */
#define MEMCTRL_BUSY_STAT_REG_BUSY_SPARE1_Pos (28UL)                /*!< BUSY_SPARE1 (Bit 28)                                  */
#define MEMCTRL_BUSY_STAT_REG_BUSY_SPARE1_Msk (0x30000000UL)        /*!< BUSY_SPARE1 (Bitfield-Mask: 0x03)                     */
#define MEMCTRL_BUSY_STAT_REG_BUSY_TIMER4_Pos (26UL)                /*!< BUSY_TIMER4 (Bit 26)                                  */
#define MEMCTRL_BUSY_STAT_REG_BUSY_TIMER4_Msk (0xc000000UL)         /*!< BUSY_TIMER4 (Bitfield-Mask: 0x03)                     */
#define MEMCTRL_BUSY_STAT_REG_BUSY_TIMER3_Pos (24UL)                /*!< BUSY_TIMER3 (Bit 24)                                  */
#define MEMCTRL_BUSY_STAT_REG_BUSY_TIMER3_Msk (0x3000000UL)         /*!< BUSY_TIMER3 (Bitfield-Mask: 0x03)                     */
#define MEMCTRL_BUSY_STAT_REG_BUSY_TIMER2_Pos (22UL)                /*!< BUSY_TIMER2 (Bit 22)                                  */
#define MEMCTRL_BUSY_STAT_REG_BUSY_TIMER2_Msk (0xc00000UL)          /*!< BUSY_TIMER2 (Bitfield-Mask: 0x03)                     */
#define MEMCTRL_BUSY_STAT_REG_BUSY_TIMER_Pos (20UL)                 /*!< BUSY_TIMER (Bit 20)                                   */
#define MEMCTRL_BUSY_STAT_REG_BUSY_TIMER_Msk (0x300000UL)           /*!< BUSY_TIMER (Bitfield-Mask: 0x03)                      */
#define MEMCTRL_BUSY_STAT_REG_BUSY_PDM_Pos (18UL)                   /*!< BUSY_PDM (Bit 18)                                     */
#define MEMCTRL_BUSY_STAT_REG_BUSY_PDM_Msk (0xc0000UL)              /*!< BUSY_PDM (Bitfield-Mask: 0x03)                        */
#define MEMCTRL_BUSY_STAT_REG_BUSY_PCM_Pos (16UL)                   /*!< BUSY_PCM (Bit 16)                                     */
#define MEMCTRL_BUSY_STAT_REG_BUSY_PCM_Msk (0x30000UL)              /*!< BUSY_PCM (Bitfield-Mask: 0x03)                        */
#define MEMCTRL_BUSY_STAT_REG_BUSY_SRC2_Pos (14UL)                  /*!< BUSY_SRC2 (Bit 14)                                    */
#define MEMCTRL_BUSY_STAT_REG_BUSY_SRC2_Msk (0xc000UL)              /*!< BUSY_SRC2 (Bitfield-Mask: 0x03)                       */
#define MEMCTRL_BUSY_STAT_REG_BUSY_SRC_Pos (12UL)                   /*!< BUSY_SRC (Bit 12)                                     */
#define MEMCTRL_BUSY_STAT_REG_BUSY_SRC_Msk (0x3000UL)               /*!< BUSY_SRC (Bitfield-Mask: 0x03)                        */
#define MEMCTRL_BUSY_STAT_REG_BUSY_SDADC_Pos (10UL)                 /*!< BUSY_SDADC (Bit 10)                                   */
#define MEMCTRL_BUSY_STAT_REG_BUSY_SDADC_Msk (0xc00UL)              /*!< BUSY_SDADC (Bitfield-Mask: 0x03)                      */
#define MEMCTRL_BUSY_STAT_REG_BUSY_GPADC_Pos (8UL)                  /*!< BUSY_GPADC (Bit 8)                                    */
#define MEMCTRL_BUSY_STAT_REG_BUSY_GPADC_Msk (0x300UL)              /*!< BUSY_GPADC (Bitfield-Mask: 0x03)                      */
#define MEMCTRL_BUSY_STAT_REG_BUSY_I2C_Pos (6UL)                    /*!< BUSY_I2C (Bit 6)                                      */
#define MEMCTRL_BUSY_STAT_REG_BUSY_I2C_Msk (0xc0UL)                 /*!< BUSY_I2C (Bitfield-Mask: 0x03)                        */
#define MEMCTRL_BUSY_STAT_REG_BUSY_SPI_Pos (4UL)                    /*!< BUSY_SPI (Bit 4)                                      */
#define MEMCTRL_BUSY_STAT_REG_BUSY_SPI_Msk (0x30UL)                 /*!< BUSY_SPI (Bitfield-Mask: 0x03)                        */
#define MEMCTRL_BUSY_STAT_REG_BUSY_UART2_Pos (2UL)                  /*!< BUSY_UART2 (Bit 2)                                    */
#define MEMCTRL_BUSY_STAT_REG_BUSY_UART2_Msk (0xcUL)                /*!< BUSY_UART2 (Bitfield-Mask: 0x03)                      */
#define MEMCTRL_BUSY_STAT_REG_BUSY_UART_Pos (0UL)                   /*!< BUSY_UART (Bit 0)                                     */
#define MEMCTRL_BUSY_STAT_REG_BUSY_UART_Msk (0x3UL)                 /*!< BUSY_UART (Bitfield-Mask: 0x03)                       */
/* ===================================================  CMI_CODE_BASE_REG  =================================================== */
#define MEMCTRL_CMI_CODE_BASE_REG_CMI_CODE_BASE_ADDR_Pos (8UL)      /*!< CMI_CODE_BASE_ADDR (Bit 8)                            */
#define MEMCTRL_CMI_CODE_BASE_REG_CMI_CODE_BASE_ADDR_Msk (0x7ff00UL) /*!< CMI_CODE_BASE_ADDR (Bitfield-Mask: 0x7ff)            */
/* ===================================================  CMI_DATA_BASE_REG  =================================================== */
#define MEMCTRL_CMI_DATA_BASE_REG_CMI_DATA_BASE_ADDR_Pos (2UL)      /*!< CMI_DATA_BASE_ADDR (Bit 2)                            */
#define MEMCTRL_CMI_DATA_BASE_REG_CMI_DATA_BASE_ADDR_Msk (0x7fffcUL) /*!< CMI_DATA_BASE_ADDR (Bitfield-Mask: 0x1ffff)          */
/* ==================================================  CMI_SHARED_BASE_REG  ================================================== */
#define MEMCTRL_CMI_SHARED_BASE_REG_CMI_SHARED_BASE_ADDR_Pos (2UL)  /*!< CMI_SHARED_BASE_ADDR (Bit 2)                          */
#define MEMCTRL_CMI_SHARED_BASE_REG_CMI_SHARED_BASE_ADDR_Msk (0x7fffcUL) /*!< CMI_SHARED_BASE_ADDR (Bitfield-Mask: 0x1ffff)    */
/* =====================================================  MEM_PRIO_REG  ====================================================== */
#define MEMCTRL_MEM_PRIO_REG_AHB3_PRIO_Pos (6UL)                    /*!< AHB3_PRIO (Bit 6)                                     */
#define MEMCTRL_MEM_PRIO_REG_AHB3_PRIO_Msk (0x1c0UL)                /*!< AHB3_PRIO (Bitfield-Mask: 0x07)                       */
#define MEMCTRL_MEM_PRIO_REG_AHB2_PRIO_Pos (3UL)                    /*!< AHB2_PRIO (Bit 3)                                     */
#define MEMCTRL_MEM_PRIO_REG_AHB2_PRIO_Msk (0x38UL)                 /*!< AHB2_PRIO (Bitfield-Mask: 0x07)                       */
#define MEMCTRL_MEM_PRIO_REG_AHB_PRIO_Pos (0UL)                     /*!< AHB_PRIO (Bit 0)                                      */
#define MEMCTRL_MEM_PRIO_REG_AHB_PRIO_Msk (0x7UL)                   /*!< AHB_PRIO (Bitfield-Mask: 0x07)                        */
/* =====================================================  MEM_STALL_REG  ===================================================== */
#define MEMCTRL_MEM_STALL_REG_AHB3_MAX_STALL_Pos (8UL)              /*!< AHB3_MAX_STALL (Bit 8)                                */
#define MEMCTRL_MEM_STALL_REG_AHB3_MAX_STALL_Msk (0xf00UL)          /*!< AHB3_MAX_STALL (Bitfield-Mask: 0x0f)                  */
#define MEMCTRL_MEM_STALL_REG_AHB2_MAX_STALL_Pos (4UL)              /*!< AHB2_MAX_STALL (Bit 4)                                */
#define MEMCTRL_MEM_STALL_REG_AHB2_MAX_STALL_Msk (0xf0UL)           /*!< AHB2_MAX_STALL (Bitfield-Mask: 0x0f)                  */
#define MEMCTRL_MEM_STALL_REG_AHB_MAX_STALL_Pos (0UL)               /*!< AHB_MAX_STALL (Bit 0)                                 */
#define MEMCTRL_MEM_STALL_REG_AHB_MAX_STALL_Msk (0xfUL)             /*!< AHB_MAX_STALL (Bitfield-Mask: 0x0f)                   */
/* ====================================================  MEM_STATUS2_REG  ==================================================== */
#define MEMCTRL_MEM_STATUS2_REG_RAM3_OFF_BUT_ACCESS_Pos (2UL)       /*!< RAM3_OFF_BUT_ACCESS (Bit 2)                           */
#define MEMCTRL_MEM_STATUS2_REG_RAM3_OFF_BUT_ACCESS_Msk (0x4UL)     /*!< RAM3_OFF_BUT_ACCESS (Bitfield-Mask: 0x01)             */
#define MEMCTRL_MEM_STATUS2_REG_RAM2_OFF_BUT_ACCESS_Pos (1UL)       /*!< RAM2_OFF_BUT_ACCESS (Bit 1)                           */
#define MEMCTRL_MEM_STATUS2_REG_RAM2_OFF_BUT_ACCESS_Msk (0x2UL)     /*!< RAM2_OFF_BUT_ACCESS (Bitfield-Mask: 0x01)             */
#define MEMCTRL_MEM_STATUS2_REG_RAM1_OFF_BUT_ACCESS_Pos (0UL)       /*!< RAM1_OFF_BUT_ACCESS (Bit 0)                           */
#define MEMCTRL_MEM_STATUS2_REG_RAM1_OFF_BUT_ACCESS_Msk (0x1UL)     /*!< RAM1_OFF_BUT_ACCESS (Bitfield-Mask: 0x01)             */
/* ====================================================  MEM_STATUS_REG  ===================================================== */
#define MEMCTRL_MEM_STATUS_REG_MTB_CLEAR_READY_Pos (21UL)           /*!< MTB_CLEAR_READY (Bit 21)                              */
#define MEMCTRL_MEM_STATUS_REG_MTB_CLEAR_READY_Msk (0x200000UL)     /*!< MTB_CLEAR_READY (Bitfield-Mask: 0x01)                 */
#define MEMCTRL_MEM_STATUS_REG_MTB_NOT_READY_Pos (20UL)             /*!< MTB_NOT_READY (Bit 20)                                */
#define MEMCTRL_MEM_STATUS_REG_MTB_NOT_READY_Msk (0x100000UL)       /*!< MTB_NOT_READY (Bitfield-Mask: 0x01)                   */
#define MEMCTRL_MEM_STATUS_REG_AHB3_WR_BUFF_CNT_Pos (16UL)          /*!< AHB3_WR_BUFF_CNT (Bit 16)                             */
#define MEMCTRL_MEM_STATUS_REG_AHB3_WR_BUFF_CNT_Msk (0xf0000UL)     /*!< AHB3_WR_BUFF_CNT (Bitfield-Mask: 0x0f)                */
#define MEMCTRL_MEM_STATUS_REG_AHB2_WR_BUFF_CNT_Pos (12UL)          /*!< AHB2_WR_BUFF_CNT (Bit 12)                             */
#define MEMCTRL_MEM_STATUS_REG_AHB2_WR_BUFF_CNT_Msk (0xf000UL)      /*!< AHB2_WR_BUFF_CNT (Bitfield-Mask: 0x0f)                */
#define MEMCTRL_MEM_STATUS_REG_AHB_WR_BUFF_CNT_Pos (8UL)            /*!< AHB_WR_BUFF_CNT (Bit 8)                               */
#define MEMCTRL_MEM_STATUS_REG_AHB_WR_BUFF_CNT_Msk (0xf00UL)        /*!< AHB_WR_BUFF_CNT (Bitfield-Mask: 0x0f)                 */
#define MEMCTRL_MEM_STATUS_REG_AHB3_CLR_WR_BUFF_Pos (6UL)           /*!< AHB3_CLR_WR_BUFF (Bit 6)                              */
#define MEMCTRL_MEM_STATUS_REG_AHB3_CLR_WR_BUFF_Msk (0x40UL)        /*!< AHB3_CLR_WR_BUFF (Bitfield-Mask: 0x01)                */
#define MEMCTRL_MEM_STATUS_REG_AHB2_CLR_WR_BUFF_Pos (5UL)           /*!< AHB2_CLR_WR_BUFF (Bit 5)                              */
#define MEMCTRL_MEM_STATUS_REG_AHB2_CLR_WR_BUFF_Msk (0x20UL)        /*!< AHB2_CLR_WR_BUFF (Bitfield-Mask: 0x01)                */
#define MEMCTRL_MEM_STATUS_REG_AHB_CLR_WR_BUFF_Pos (4UL)            /*!< AHB_CLR_WR_BUFF (Bit 4)                               */
#define MEMCTRL_MEM_STATUS_REG_AHB_CLR_WR_BUFF_Msk (0x10UL)         /*!< AHB_CLR_WR_BUFF (Bitfield-Mask: 0x01)                 */
#define MEMCTRL_MEM_STATUS_REG_AHB3_WRITE_BUFF_Pos (2UL)            /*!< AHB3_WRITE_BUFF (Bit 2)                               */
#define MEMCTRL_MEM_STATUS_REG_AHB3_WRITE_BUFF_Msk (0x4UL)          /*!< AHB3_WRITE_BUFF (Bitfield-Mask: 0x01)                 */
#define MEMCTRL_MEM_STATUS_REG_AHB2_WRITE_BUFF_Pos (1UL)            /*!< AHB2_WRITE_BUFF (Bit 1)                               */
#define MEMCTRL_MEM_STATUS_REG_AHB2_WRITE_BUFF_Msk (0x2UL)          /*!< AHB2_WRITE_BUFF (Bitfield-Mask: 0x01)                 */
#define MEMCTRL_MEM_STATUS_REG_AHB_WRITE_BUFF_Pos (0UL)             /*!< AHB_WRITE_BUFF (Bit 0)                                */
#define MEMCTRL_MEM_STATUS_REG_AHB_WRITE_BUFF_Msk (0x1UL)           /*!< AHB_WRITE_BUFF (Bitfield-Mask: 0x01)                  */


/* =========================================================================================================================== */
/* ================                                           PCM1                                            ================ */
/* =========================================================================================================================== */

