dianyundou/DA14592BLE_CSL/CSL-59x_10.679.2.17/sdk/bsp/include/DA1459x-00.h
/* =====================================================  SPI_CLOCK_REG  ===================================================== */
#define SPI_SPI_CLOCK_REG_SPI_CLK_DIV_Pos (0UL)                     /*!< SPI_CLK_DIV (Bit 0)                                   */
#define SPI_SPI_CLOCK_REG_SPI_CLK_DIV_Msk (0x7fUL)                  /*!< SPI_CLK_DIV (Bitfield-Mask: 0x7f)                     */
/* ====================================================  SPI_CONFIG_REG  ===================================================== */
#define SPI_SPI_CONFIG_REG_SPI_SLAVE_EN_Pos (7UL)                   /*!< SPI_SLAVE_EN (Bit 7)                                  */
#define SPI_SPI_CONFIG_REG_SPI_SLAVE_EN_Msk (0x80UL)                /*!< SPI_SLAVE_EN (Bitfield-Mask: 0x01)                    */
#define SPI_SPI_CONFIG_REG_SPI_WORD_LENGTH_Pos (2UL)                /*!< SPI_WORD_LENGTH (Bit 2)                               */
#define SPI_SPI_CONFIG_REG_SPI_WORD_LENGTH_Msk (0x7cUL)             /*!< SPI_WORD_LENGTH (Bitfield-Mask: 0x1f)                 */
#define SPI_SPI_CONFIG_REG_SPI_MODE_Pos   (0UL)                     /*!< SPI_MODE (Bit 0)                                      */
#define SPI_SPI_CONFIG_REG_SPI_MODE_Msk   (0x3UL)                   /*!< SPI_MODE (Bitfield-Mask: 0x03)                        */
/* ===================================================  SPI_CS_CONFIG_REG  =================================================== */
#define SPI_SPI_CS_CONFIG_REG_SPI_CS_SELECT_Pos (0UL)               /*!< SPI_CS_SELECT (Bit 0)                                 */
#define SPI_SPI_CS_CONFIG_REG_SPI_CS_SELECT_Msk (0x7UL)             /*!< SPI_CS_SELECT (Bitfield-Mask: 0x07)                   */
/* =====================================================  SPI_CTRL_REG  ====================================================== */
#define SPI_SPI_CTRL_REG_SPI_SWAP_BYTES_Pos (7UL)                   /*!< SPI_SWAP_BYTES (Bit 7)                                */
#define SPI_SPI_CTRL_REG_SPI_SWAP_BYTES_Msk (0x80UL)                /*!< SPI_SWAP_BYTES (Bitfield-Mask: 0x01)                  */
#define SPI_SPI_CTRL_REG_SPI_CAPTURE_AT_NEXT_EDGE_Pos (6UL)         /*!< SPI_CAPTURE_AT_NEXT_EDGE (Bit 6)                      */
#define SPI_SPI_CTRL_REG_SPI_CAPTURE_AT_NEXT_EDGE_Msk (0x40UL)      /*!< SPI_CAPTURE_AT_NEXT_EDGE (Bitfield-Mask: 0x01)        */
#define SPI_SPI_CTRL_REG_SPI_FIFO_RESET_Pos (5UL)                   /*!< SPI_FIFO_RESET (Bit 5)                                */
#define SPI_SPI_CTRL_REG_SPI_FIFO_RESET_Msk (0x20UL)                /*!< SPI_FIFO_RESET (Bitfield-Mask: 0x01)                  */
#define SPI_SPI_CTRL_REG_SPI_DMA_RX_EN_Pos (4UL)                    /*!< SPI_DMA_RX_EN (Bit 4)                                 */
#define SPI_SPI_CTRL_REG_SPI_DMA_RX_EN_Msk (0x10UL)                 /*!< SPI_DMA_RX_EN (Bitfield-Mask: 0x01)                   */
#define SPI_SPI_CTRL_REG_SPI_DMA_TX_EN_Pos (3UL)                    /*!< SPI_DMA_TX_EN (Bit 3)                                 */
#define SPI_SPI_CTRL_REG_SPI_DMA_TX_EN_Msk (0x8UL)                  /*!< SPI_DMA_TX_EN (Bitfield-Mask: 0x01)                   */
#define SPI_SPI_CTRL_REG_SPI_RX_EN_Pos    (2UL)                     /*!< SPI_RX_EN (Bit 2)                                     */
#define SPI_SPI_CTRL_REG_SPI_RX_EN_Msk    (0x4UL)                   /*!< SPI_RX_EN (Bitfield-Mask: 0x01)                       */
#define SPI_SPI_CTRL_REG_SPI_TX_EN_Pos    (1UL)                     /*!< SPI_TX_EN (Bit 1)                                     */
#define SPI_SPI_CTRL_REG_SPI_TX_EN_Msk    (0x2UL)                   /*!< SPI_TX_EN (Bitfield-Mask: 0x01)                       */
#define SPI_SPI_CTRL_REG_SPI_EN_Pos       (0UL)                     /*!< SPI_EN (Bit 0)                                        */
#define SPI_SPI_CTRL_REG_SPI_EN_Msk       (0x1UL)                   /*!< SPI_EN (Bitfield-Mask: 0x01)                          */
/* ==================================================  SPI_FIFO_CONFIG_REG  ================================================== */
#define SPI_SPI_FIFO_CONFIG_REG_SPI_RX_TL_Pos (4UL)                 /*!< SPI_RX_TL (Bit 4)                                     */
#define SPI_SPI_FIFO_CONFIG_REG_SPI_RX_TL_Msk (0xf0UL)              /*!< SPI_RX_TL (Bitfield-Mask: 0x0f)                       */
#define SPI_SPI_FIFO_CONFIG_REG_SPI_TX_TL_Pos (0UL)                 /*!< SPI_TX_TL (Bit 0)                                     */
#define SPI_SPI_FIFO_CONFIG_REG_SPI_TX_TL_Msk (0xfUL)               /*!< SPI_TX_TL (Bitfield-Mask: 0x0f)                       */
/* ===================================================  SPI_FIFO_READ_REG  =================================================== */
#define SPI_SPI_FIFO_READ_REG_SPI_FIFO_READ_Pos (0UL)               /*!< SPI_FIFO_READ (Bit 0)                                 */
#define SPI_SPI_FIFO_READ_REG_SPI_FIFO_READ_Msk (0xffffffffUL)      /*!< SPI_FIFO_READ (Bitfield-Mask: 0xffffffff)             */
/* ==================================================  SPI_FIFO_STATUS_REG  ================================================== */
#define SPI_SPI_FIFO_STATUS_REG_SPI_TRANSACTION_ACTIVE_Pos (15UL)   /*!< SPI_TRANSACTION_ACTIVE (Bit 15)                       */
#define SPI_SPI_FIFO_STATUS_REG_SPI_TRANSACTION_ACTIVE_Msk (0x8000UL) /*!< SPI_TRANSACTION_ACTIVE (Bitfield-Mask: 0x01)        */
#define SPI_SPI_FIFO_STATUS_REG_SPI_RX_FIFO_OVFL_Pos (14UL)         /*!< SPI_RX_FIFO_OVFL (Bit 14)                             */
#define SPI_SPI_FIFO_STATUS_REG_SPI_RX_FIFO_OVFL_Msk (0x4000UL)     /*!< SPI_RX_FIFO_OVFL (Bitfield-Mask: 0x01)                */
#define SPI_SPI_FIFO_STATUS_REG_SPI_STATUS_TX_FULL_Pos (13UL)       /*!< SPI_STATUS_TX_FULL (Bit 13)                           */
#define SPI_SPI_FIFO_STATUS_REG_SPI_STATUS_TX_FULL_Msk (0x2000UL)   /*!< SPI_STATUS_TX_FULL (Bitfield-Mask: 0x01)              */
#define SPI_SPI_FIFO_STATUS_REG_SPI_STATUS_RX_EMPTY_Pos (12UL)      /*!< SPI_STATUS_RX_EMPTY (Bit 12)                          */
#define SPI_SPI_FIFO_STATUS_REG_SPI_STATUS_RX_EMPTY_Msk (0x1000UL)  /*!< SPI_STATUS_RX_EMPTY (Bitfield-Mask: 0x01)             */
#define SPI_SPI_FIFO_STATUS_REG_SPI_TX_FIFO_LEVEL_Pos (6UL)         /*!< SPI_TX_FIFO_LEVEL (Bit 6)                             */
#define SPI_SPI_FIFO_STATUS_REG_SPI_TX_FIFO_LEVEL_Msk (0xfc0UL)     /*!< SPI_TX_FIFO_LEVEL (Bitfield-Mask: 0x3f)               */
#define SPI_SPI_FIFO_STATUS_REG_SPI_RX_FIFO_LEVEL_Pos (0UL)         /*!< SPI_RX_FIFO_LEVEL (Bit 0)                             */
#define SPI_SPI_FIFO_STATUS_REG_SPI_RX_FIFO_LEVEL_Msk (0x3fUL)      /*!< SPI_RX_FIFO_LEVEL (Bitfield-Mask: 0x3f)               */
/* ==================================================  SPI_FIFO_WRITE_REG  =================================================== */
#define SPI_SPI_FIFO_WRITE_REG_SPI_FIFO_WRITE_Pos (0UL)             /*!< SPI_FIFO_WRITE (Bit 0)                                */
#define SPI_SPI_FIFO_WRITE_REG_SPI_FIFO_WRITE_Msk (0xffffffffUL)    /*!< SPI_FIFO_WRITE (Bitfield-Mask: 0xffffffff)            */
/* ===================================================  SPI_IRQ_MASK_REG  ==================================================== */
#define SPI_SPI_IRQ_MASK_REG_SPI_IRQ_MASK_RX_FULL_Pos (1UL)         /*!< SPI_IRQ_MASK_RX_FULL (Bit 1)                          */
#define SPI_SPI_IRQ_MASK_REG_SPI_IRQ_MASK_RX_FULL_Msk (0x2UL)       /*!< SPI_IRQ_MASK_RX_FULL (Bitfield-Mask: 0x01)            */
#define SPI_SPI_IRQ_MASK_REG_SPI_IRQ_MASK_TX_EMPTY_Pos (0UL)        /*!< SPI_IRQ_MASK_TX_EMPTY (Bit 0)                         */
#define SPI_SPI_IRQ_MASK_REG_SPI_IRQ_MASK_TX_EMPTY_Msk (0x1UL)      /*!< SPI_IRQ_MASK_TX_EMPTY (Bitfield-Mask: 0x01)           */
/* ====================================================  SPI_STATUS_REG  ===================================================== */
#define SPI_SPI_STATUS_REG_SPI_STATUS_RX_FULL_Pos (1UL)             /*!< SPI_STATUS_RX_FULL (Bit 1)                            */
#define SPI_SPI_STATUS_REG_SPI_STATUS_RX_FULL_Msk (0x2UL)           /*!< SPI_STATUS_RX_FULL (Bitfield-Mask: 0x01)              */
#define SPI_SPI_STATUS_REG_SPI_STATUS_TX_EMPTY_Pos (0UL)            /*!< SPI_STATUS_TX_EMPTY (Bit 0)                           */
#define SPI_SPI_STATUS_REG_SPI_STATUS_TX_EMPTY_Msk (0x1UL)          /*!< SPI_STATUS_TX_EMPTY (Bitfield-Mask: 0x01)             */
/* ================================================  SPI_TXBUFFER_FORCE_REG  ================================================= */
#define SPI_SPI_TXBUFFER_FORCE_REG_SPI_TXBUFFER_FORCE_Pos (0UL)     /*!< SPI_TXBUFFER_FORCE (Bit 0)                            */
#define SPI_SPI_TXBUFFER_FORCE_REG_SPI_TXBUFFER_FORCE_Msk (0xffffffffUL) /*!< SPI_TXBUFFER_FORCE (Bitfield-Mask: 0xffffffff)   */


/* =========================================================================================================================== */
/* ================                                           SRC1                                            ================ */
/* =========================================================================================================================== */

