dianyundou/DA14592BLE_CSL/CSL-59x_10.679.2.17/sdk/bsp/include/DA1459x-00.h
/* =================================================  SRC1_COEF0A_SET1_REG  ================================================== */
#define SRC1_SRC1_COEF0A_SET1_REG_SRC_COEF10_Pos (0UL)              /*!< SRC_COEF10 (Bit 0)                                    */
#define SRC1_SRC1_COEF0A_SET1_REG_SRC_COEF10_Msk (0xffffUL)         /*!< SRC_COEF10 (Bitfield-Mask: 0xffff)                    */
/* =================================================  SRC1_COEF10_SET1_REG  ================================================== */
#define SRC1_SRC1_COEF10_SET1_REG_SRC_COEF1_Pos (16UL)              /*!< SRC_COEF1 (Bit 16)                                    */
#define SRC1_SRC1_COEF10_SET1_REG_SRC_COEF1_Msk (0xffff0000UL)      /*!< SRC_COEF1 (Bitfield-Mask: 0xffff)                     */
#define SRC1_SRC1_COEF10_SET1_REG_SRC_COEF0_Pos (0UL)               /*!< SRC_COEF0 (Bit 0)                                     */
#define SRC1_SRC1_COEF10_SET1_REG_SRC_COEF0_Msk (0xffffUL)          /*!< SRC_COEF0 (Bitfield-Mask: 0xffff)                     */
/* =================================================  SRC1_COEF32_SET1_REG  ================================================== */
#define SRC1_SRC1_COEF32_SET1_REG_SRC_COEF3_Pos (16UL)              /*!< SRC_COEF3 (Bit 16)                                    */
#define SRC1_SRC1_COEF32_SET1_REG_SRC_COEF3_Msk (0xffff0000UL)      /*!< SRC_COEF3 (Bitfield-Mask: 0xffff)                     */
#define SRC1_SRC1_COEF32_SET1_REG_SRC_COEF2_Pos (0UL)               /*!< SRC_COEF2 (Bit 0)                                     */
#define SRC1_SRC1_COEF32_SET1_REG_SRC_COEF2_Msk (0xffffUL)          /*!< SRC_COEF2 (Bitfield-Mask: 0xffff)                     */
/* =================================================  SRC1_COEF54_SET1_REG  ================================================== */
#define SRC1_SRC1_COEF54_SET1_REG_SRC_COEF5_Pos (16UL)              /*!< SRC_COEF5 (Bit 16)                                    */
#define SRC1_SRC1_COEF54_SET1_REG_SRC_COEF5_Msk (0xffff0000UL)      /*!< SRC_COEF5 (Bitfield-Mask: 0xffff)                     */
#define SRC1_SRC1_COEF54_SET1_REG_SRC_COEF4_Pos (0UL)               /*!< SRC_COEF4 (Bit 0)                                     */
#define SRC1_SRC1_COEF54_SET1_REG_SRC_COEF4_Msk (0xffffUL)          /*!< SRC_COEF4 (Bitfield-Mask: 0xffff)                     */
/* =================================================  SRC1_COEF76_SET1_REG  ================================================== */
#define SRC1_SRC1_COEF76_SET1_REG_SRC_COEF7_Pos (16UL)              /*!< SRC_COEF7 (Bit 16)                                    */
#define SRC1_SRC1_COEF76_SET1_REG_SRC_COEF7_Msk (0xffff0000UL)      /*!< SRC_COEF7 (Bitfield-Mask: 0xffff)                     */
#define SRC1_SRC1_COEF76_SET1_REG_SRC_COEF6_Pos (0UL)               /*!< SRC_COEF6 (Bit 0)                                     */
#define SRC1_SRC1_COEF76_SET1_REG_SRC_COEF6_Msk (0xffffUL)          /*!< SRC_COEF6 (Bitfield-Mask: 0xffff)                     */
/* =================================================  SRC1_COEF98_SET1_REG  ================================================== */
#define SRC1_SRC1_COEF98_SET1_REG_SRC_COEF9_Pos (16UL)              /*!< SRC_COEF9 (Bit 16)                                    */
#define SRC1_SRC1_COEF98_SET1_REG_SRC_COEF9_Msk (0xffff0000UL)      /*!< SRC_COEF9 (Bitfield-Mask: 0xffff)                     */
#define SRC1_SRC1_COEF98_SET1_REG_SRC_COEF8_Pos (0UL)               /*!< SRC_COEF8 (Bit 0)                                     */
#define SRC1_SRC1_COEF98_SET1_REG_SRC_COEF8_Msk (0xffffUL)          /*!< SRC_COEF8 (Bitfield-Mask: 0xffff)                     */
/* =====================================================  SRC1_CTRL_REG  ===================================================== */
#define SRC1_SRC1_CTRL_REG_SRC_PDM_DO_DEL_Pos (30UL)                /*!< SRC_PDM_DO_DEL (Bit 30)                               */
#define SRC1_SRC1_CTRL_REG_SRC_PDM_DO_DEL_Msk (0xc0000000UL)        /*!< SRC_PDM_DO_DEL (Bitfield-Mask: 0x03)                  */
#define SRC1_SRC1_CTRL_REG_SRC_PDM_MODE_Pos (28UL)                  /*!< SRC_PDM_MODE (Bit 28)                                 */
#define SRC1_SRC1_CTRL_REG_SRC_PDM_MODE_Msk (0x30000000UL)          /*!< SRC_PDM_MODE (Bitfield-Mask: 0x03)                    */
#define SRC1_SRC1_CTRL_REG_SRC_PDM_DI_DEL_Pos (26UL)                /*!< SRC_PDM_DI_DEL (Bit 26)                               */
#define SRC1_SRC1_CTRL_REG_SRC_PDM_DI_DEL_Msk (0xc000000UL)         /*!< SRC_PDM_DI_DEL (Bitfield-Mask: 0x03)                  */
#define SRC1_SRC1_CTRL_REG_SRC_OUT_FLOWCLR_Pos (25UL)               /*!< SRC_OUT_FLOWCLR (Bit 25)                              */
#define SRC1_SRC1_CTRL_REG_SRC_OUT_FLOWCLR_Msk (0x2000000UL)        /*!< SRC_OUT_FLOWCLR (Bitfield-Mask: 0x01)                 */
#define SRC1_SRC1_CTRL_REG_SRC_IN_FLOWCLR_Pos (24UL)                /*!< SRC_IN_FLOWCLR (Bit 24)                               */
#define SRC1_SRC1_CTRL_REG_SRC_IN_FLOWCLR_Msk (0x1000000UL)         /*!< SRC_IN_FLOWCLR (Bitfield-Mask: 0x01)                  */
#define SRC1_SRC1_CTRL_REG_SRC_OUT_UNFLOW_Pos (23UL)                /*!< SRC_OUT_UNFLOW (Bit 23)                               */
#define SRC1_SRC1_CTRL_REG_SRC_OUT_UNFLOW_Msk (0x800000UL)          /*!< SRC_OUT_UNFLOW (Bitfield-Mask: 0x01)                  */
#define SRC1_SRC1_CTRL_REG_SRC_OUT_OVFLOW_Pos (22UL)                /*!< SRC_OUT_OVFLOW (Bit 22)                               */
#define SRC1_SRC1_CTRL_REG_SRC_OUT_OVFLOW_Msk (0x400000UL)          /*!< SRC_OUT_OVFLOW (Bitfield-Mask: 0x01)                  */
#define SRC1_SRC1_CTRL_REG_SRC_IN_UNFLOW_Pos (21UL)                 /*!< SRC_IN_UNFLOW (Bit 21)                                */
#define SRC1_SRC1_CTRL_REG_SRC_IN_UNFLOW_Msk (0x200000UL)           /*!< SRC_IN_UNFLOW (Bitfield-Mask: 0x01)                   */
#define SRC1_SRC1_CTRL_REG_SRC_IN_OVFLOW_Pos (20UL)                 /*!< SRC_IN_OVFLOW (Bit 20)                                */
#define SRC1_SRC1_CTRL_REG_SRC_IN_OVFLOW_Msk (0x100000UL)           /*!< SRC_IN_OVFLOW (Bitfield-Mask: 0x01)                   */
#define SRC1_SRC1_CTRL_REG_SRC_RESYNC_Pos (19UL)                    /*!< SRC_RESYNC (Bit 19)                                   */
#define SRC1_SRC1_CTRL_REG_SRC_RESYNC_Msk (0x80000UL)               /*!< SRC_RESYNC (Bitfield-Mask: 0x01)                      */
#define SRC1_SRC1_CTRL_REG_SRC_OUT_OK_Pos (18UL)                    /*!< SRC_OUT_OK (Bit 18)                                   */
#define SRC1_SRC1_CTRL_REG_SRC_OUT_OK_Msk (0x40000UL)               /*!< SRC_OUT_OK (Bitfield-Mask: 0x01)                      */
#define SRC1_SRC1_CTRL_REG_SRC_OUT_US_Pos (16UL)                    /*!< SRC_OUT_US (Bit 16)                                   */
#define SRC1_SRC1_CTRL_REG_SRC_OUT_US_Msk (0x30000UL)               /*!< SRC_OUT_US (Bitfield-Mask: 0x03)                      */
#define SRC1_SRC1_CTRL_REG_SRC_OUT_CAL_BYPASS_Pos (14UL)            /*!< SRC_OUT_CAL_BYPASS (Bit 14)                           */
#define SRC1_SRC1_CTRL_REG_SRC_OUT_CAL_BYPASS_Msk (0x4000UL)        /*!< SRC_OUT_CAL_BYPASS (Bitfield-Mask: 0x01)              */
#define SRC1_SRC1_CTRL_REG_SRC_OUT_AMODE_Pos (13UL)                 /*!< SRC_OUT_AMODE (Bit 13)                                */
#define SRC1_SRC1_CTRL_REG_SRC_OUT_AMODE_Msk (0x2000UL)             /*!< SRC_OUT_AMODE (Bitfield-Mask: 0x01)                   */
#define SRC1_SRC1_CTRL_REG_SRC_PDM_OUT_INV_Pos (12UL)               /*!< SRC_PDM_OUT_INV (Bit 12)                              */
#define SRC1_SRC1_CTRL_REG_SRC_PDM_OUT_INV_Msk (0x1000UL)           /*!< SRC_PDM_OUT_INV (Bitfield-Mask: 0x01)                 */
#define SRC1_SRC1_CTRL_REG_SRC_FIFO_DIRECTION_Pos (11UL)            /*!< SRC_FIFO_DIRECTION (Bit 11)                           */
#define SRC1_SRC1_CTRL_REG_SRC_FIFO_DIRECTION_Msk (0x800UL)         /*!< SRC_FIFO_DIRECTION (Bitfield-Mask: 0x01)              */
#define SRC1_SRC1_CTRL_REG_SRC_FIFO_ENABLE_Pos (10UL)               /*!< SRC_FIFO_ENABLE (Bit 10)                              */
#define SRC1_SRC1_CTRL_REG_SRC_FIFO_ENABLE_Msk (0x400UL)            /*!< SRC_FIFO_ENABLE (Bitfield-Mask: 0x01)                 */
#define SRC1_SRC1_CTRL_REG_SRC_OUT_DSD_MODE_Pos (9UL)               /*!< SRC_OUT_DSD_MODE (Bit 9)                              */
#define SRC1_SRC1_CTRL_REG_SRC_OUT_DSD_MODE_Msk (0x200UL)           /*!< SRC_OUT_DSD_MODE (Bitfield-Mask: 0x01)                */
#define SRC1_SRC1_CTRL_REG_SRC_IN_DSD_MODE_Pos (8UL)                /*!< SRC_IN_DSD_MODE (Bit 8)                               */
#define SRC1_SRC1_CTRL_REG_SRC_IN_DSD_MODE_Msk (0x100UL)            /*!< SRC_IN_DSD_MODE (Bitfield-Mask: 0x01)                 */
#define SRC1_SRC1_CTRL_REG_SRC_DITHER_DISABLE_Pos (7UL)             /*!< SRC_DITHER_DISABLE (Bit 7)                            */
#define SRC1_SRC1_CTRL_REG_SRC_DITHER_DISABLE_Msk (0x80UL)          /*!< SRC_DITHER_DISABLE (Bitfield-Mask: 0x01)              */
#define SRC1_SRC1_CTRL_REG_SRC_IN_OK_Pos  (6UL)                     /*!< SRC_IN_OK (Bit 6)                                     */
#define SRC1_SRC1_CTRL_REG_SRC_IN_OK_Msk  (0x40UL)                  /*!< SRC_IN_OK (Bitfield-Mask: 0x01)                       */
#define SRC1_SRC1_CTRL_REG_SRC_IN_DS_Pos  (4UL)                     /*!< SRC_IN_DS (Bit 4)                                     */
#define SRC1_SRC1_CTRL_REG_SRC_IN_DS_Msk  (0x30UL)                  /*!< SRC_IN_DS (Bitfield-Mask: 0x03)                       */
#define SRC1_SRC1_CTRL_REG_SRC_PDM_IN_INV_Pos (3UL)                 /*!< SRC_PDM_IN_INV (Bit 3)                                */
#define SRC1_SRC1_CTRL_REG_SRC_PDM_IN_INV_Msk (0x8UL)               /*!< SRC_PDM_IN_INV (Bitfield-Mask: 0x01)                  */
#define SRC1_SRC1_CTRL_REG_SRC_IN_CAL_BYPASS_Pos (2UL)              /*!< SRC_IN_CAL_BYPASS (Bit 2)                             */
#define SRC1_SRC1_CTRL_REG_SRC_IN_CAL_BYPASS_Msk (0x4UL)            /*!< SRC_IN_CAL_BYPASS (Bitfield-Mask: 0x01)               */
#define SRC1_SRC1_CTRL_REG_SRC_IN_AMODE_Pos (1UL)                   /*!< SRC_IN_AMODE (Bit 1)                                  */
#define SRC1_SRC1_CTRL_REG_SRC_IN_AMODE_Msk (0x2UL)                 /*!< SRC_IN_AMODE (Bitfield-Mask: 0x01)                    */
#define SRC1_SRC1_CTRL_REG_SRC_EN_Pos     (0UL)                     /*!< SRC_EN (Bit 0)                                        */
#define SRC1_SRC1_CTRL_REG_SRC_EN_Msk     (0x1UL)                   /*!< SRC_EN (Bitfield-Mask: 0x01)                          */
/* =====================================================  SRC1_IN1_REG  ====================================================== */
#define SRC1_SRC1_IN1_REG_SRC_IN_Pos      (0UL)                     /*!< SRC_IN (Bit 0)                                        */
#define SRC1_SRC1_IN1_REG_SRC_IN_Msk      (0xffffffffUL)            /*!< SRC_IN (Bitfield-Mask: 0xffffffff)                    */
/* =====================================================  SRC1_IN2_REG  ====================================================== */
#define SRC1_SRC1_IN2_REG_SRC_IN_Pos      (0UL)                     /*!< SRC_IN (Bit 0)                                        */
#define SRC1_SRC1_IN2_REG_SRC_IN_Msk      (0xffffffffUL)            /*!< SRC_IN (Bitfield-Mask: 0xffffffff)                    */
/* ====================================================  SRC1_IN_FS_REG  ===================================================== */
#define SRC1_SRC1_IN_FS_REG_SRC_IN_FS_Pos (0UL)                     /*!< SRC_IN_FS (Bit 0)                                     */
#define SRC1_SRC1_IN_FS_REG_SRC_IN_FS_Msk (0xffffffUL)              /*!< SRC_IN_FS (Bitfield-Mask: 0xffffff)                   */
/* =====================================================  SRC1_MUX_REG  ====================================================== */
#define SRC1_SRC1_MUX_REG_PDM1_MUX_IN_Pos (6UL)                     /*!< PDM1_MUX_IN (Bit 6)                                   */
#define SRC1_SRC1_MUX_REG_PDM1_MUX_IN_Msk (0x40UL)                  /*!< PDM1_MUX_IN (Bitfield-Mask: 0x01)                     */
#define SRC1_SRC1_MUX_REG_PCM1_MUX_IN_Pos (3UL)                     /*!< PCM1_MUX_IN (Bit 3)                                   */
#define SRC1_SRC1_MUX_REG_PCM1_MUX_IN_Msk (0x38UL)                  /*!< PCM1_MUX_IN (Bitfield-Mask: 0x07)                     */
#define SRC1_SRC1_MUX_REG_SRC1_MUX_IN_Pos (0UL)                     /*!< SRC1_MUX_IN (Bit 0)                                   */
#define SRC1_SRC1_MUX_REG_SRC1_MUX_IN_Msk (0x7UL)                   /*!< SRC1_MUX_IN (Bitfield-Mask: 0x07)                     */
/* =====================================================  SRC1_OUT1_REG  ===================================================== */
#define SRC1_SRC1_OUT1_REG_SRC_OUT_Pos    (0UL)                     /*!< SRC_OUT (Bit 0)                                       */
#define SRC1_SRC1_OUT1_REG_SRC_OUT_Msk    (0xffffffffUL)            /*!< SRC_OUT (Bitfield-Mask: 0xffffffff)                   */
/* =====================================================  SRC1_OUT2_REG  ===================================================== */
#define SRC1_SRC1_OUT2_REG_SRC_OUT_Pos    (0UL)                     /*!< SRC_OUT (Bit 0)                                       */
#define SRC1_SRC1_OUT2_REG_SRC_OUT_Msk    (0xffffffffUL)            /*!< SRC_OUT (Bitfield-Mask: 0xffffffff)                   */
/* ====================================================  SRC1_OUT_FS_REG  ==================================================== */
#define SRC1_SRC1_OUT_FS_REG_SRC_OUT_FS_Pos (0UL)                   /*!< SRC_OUT_FS (Bit 0)                                    */
#define SRC1_SRC1_OUT_FS_REG_SRC_OUT_FS_Msk (0xffffffUL)            /*!< SRC_OUT_FS (Bitfield-Mask: 0xffffff)                  */


/* =========================================================================================================================== */
/* ================                                           SRC2                                            ================ */
/* =========================================================================================================================== */

